[
    {
      "verseNumber": 6,
      "verseText": "There was a man sent from God, whose name was John.",
      "freshTranslation": "There came into being a man, commissioned by God — his name was John.",
      "historicalContext": "After five verses of cosmic theology — the eternal Logos, creation, life, light — John suddenly drops to ground level. A man. Sent from God. Named John. This is John the Baptist (not the author). The shift from cosmic to human is intentional — it mirrors what's about to happen in verse 14 when the Word becomes flesh. God works through real people in real history, not just abstract principles. John the Baptist was a priest's son (Luke 1:5), lived in the wilderness, wore camel hair, ate locusts. He was the last Old Testament-style prophet and the bridge to the New.",
      "crossRefs": [
        {"ref": "Malachi 3:1", "explanation": "'Behold, I send my messenger, and he will prepare the way before me.' Written 400+ years before John the Baptist was born. The last verse of the last OT prophet predicted the first person introduced in this gospel."},
        {"ref": "Isaiah 40:3", "explanation": "'A voice crying in the wilderness: Prepare the way of the Lord.' John the Baptist quotes this about himself (John 1:23)."},
        {"ref": "Luke 1:13-17", "explanation": "The angel Gabriel announced John's birth to his father Zechariah, saying he would go before the Lord 'in the spirit and power of Elijah.'"}
      ],
      "words": [
        {
          "english": "There was",
          "original": "Ἐγένετο",
          "transliteration": "Egeneto",
          "pronunciation": "eh-GHEH-neh-toh",
          "strongs": "G1096",
          "partOfSpeech": "verb, aorist middle indicative, 3rd person singular",
          "literalMeaning": "came into being, came into existence",
          "definition": "HERE is the verb switch again. For the Word, John used ēn — 'was already existing.' For John the Baptist, he uses egeneto — 'came into being.' The Baptist had a beginning. The Word did not. Even John's grammar preaches theology. Every created being egeneto. Only the Logos ēn.",
          "translationNote": "'There was' completely hides the verb change from ēn to egeneto. A reader of the English would never know John switched verbs. 'There came into being' would preserve the contrast.",
          "twisted": true,
          "twistedExplanation": "Not deliberately twisted, but the English flattens a critical distinction. In Greek, the difference between ēn (verses 1-2) and egeneto (verse 6) is the difference between eternal existence and created existence. English 'was' hides this entirely."
        },
        {
          "english": "a man",
          "original": "ἄνθρωπος",
          "transliteration": "anthrōpos",
          "pronunciation": "AN-throw-pos",
          "strongs": "G444",
          "partOfSpeech": "noun, nominative masculine singular",
          "literalMeaning": "a human being, a person",
          "definition": "After five verses about the divine Logos, John introduces a human. Just anthrōpos — a man. Not an angel, not a heavenly being. A regular human person. The contrast is intentional: the Logos is eternal God; John is a created man. But this created man has a divine commission. God uses ordinary people for extraordinary purposes.",
          "translationNote": "Accurately translated.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "sent",
          "original": "ἀπεσταλμένος",
          "transliteration": "apestalmenos",
          "pronunciation": "ah-peh-STAL-meh-nos",
          "strongs": "G649",
          "partOfSpeech": "verb, perfect passive participle, nominative masculine singular",
          "literalMeaning": "having been sent, commissioned, dispatched on a mission",
          "definition": "From apostellō — to send out on a mission with authority. This is the root of 'apostle' (apostolos). The perfect tense means the sending happened in the past but the commission is still active — John was sent and REMAINS sent. The passive voice means he didn't send himself — he was sent BY someone. This is a divine commission, not self-appointment. Every true prophet is apestalmenos — sent by God, not self-promoting.",
          "translationNote": "Accurately translated, though 'sent' doesn't fully convey the perfect tense — he was sent and his mission continues.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "from God",
          "original": "παρὰ θεοῦ",
          "transliteration": "para theou",
          "pronunciation": "pah-RAH theh-OO",
          "strongs": "G3844, G2316",
          "partOfSpeech": "preposition + noun, genitive",
          "literalMeaning": "from beside God, from God's side, from God's presence",
          "definition": "Para with genitive = from beside, from the side of. John the Baptist didn't just receive orders from God at a distance. He came FROM God's side — from God's very presence. This elevates the Baptist's authority: he's not a freelance preacher with opinions. He comes directly from the throne room with a specific assignment.",
          "translationNote": "'From God' is adequate but loses the 'from beside' nuance of para. He didn't just come from God generically — he came from God's presence, God's side.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "whose name was John",
          "original": "ὄνομα αὐτῷ Ἰωάννης",
          "transliteration": "onoma autō Iōannēs",
          "pronunciation": "OH-no-mah ow-TOH ee-oh-AH-nays",
          "strongs": "G3686, G846, G2491",
          "partOfSpeech": "noun + pronoun + proper noun",
          "literalMeaning": "name to-him John (Yohanan — 'God is gracious')",
          "definition": "Iōannēs is the Greek form of the Hebrew יוֹחָנָן (Yohanan), meaning 'Yahweh is gracious' or 'God has shown grace.' His name IS his message. The last prophet before the Messiah carries a name that declares God's grace. He wasn't named 'God judges' or 'God punishes.' He was named 'God is gracious.' The forerunner of Christ arrives under the banner of grace, not law.",
          "translationNote": "Accurately translated, but readers miss that 'John' means something. Biblical names are almost always significant. His name declares the theme of his ministry.",
          "twisted": false,
          "twistedExplanation": null
        }
      ]
    },
    {
      "verseNumber": 7,
      "verseText": "This man came for a witness, to bear witness of the Light, that all through him might believe.",
      "freshTranslation": "This one came for the purpose of testimony — to testify about the Light — so that everyone might come to trust through him.",
      "historicalContext": "John the author is writing at a time when some people were still following John the Baptist's movement rather than Jesus. There were 'disciples of John' decades after the Baptist's death (Acts 19:1-3). The author is making clear: the Baptist was not the Light. He pointed TO the Light. This clarification was necessary for his first readers.",
      "crossRefs": [
        {"ref": "Acts 19:1-5", "explanation": "Paul found disciples in Ephesus (where this gospel was written!) who only knew John's baptism, not Jesus. This is exactly the confusion the author is correcting."},
        {"ref": "John 5:33-35", "explanation": "Jesus later says of the Baptist: 'He was a burning and shining lamp, and you were willing to rejoice for a while in his light.' A lamp, not THE Light. Reflects, doesn't generate."}
      ],
      "words": [
        {
          "english": "This man came",
          "original": "οὗτος ἦλθεν",
          "transliteration": "houtos ēlthen",
          "pronunciation": "HOO-tos AYL-then",
          "strongs": "G3778, G2064",
          "partOfSpeech": "demonstrative pronoun + verb, aorist active indicative",
          "literalMeaning": "this one came, this one arrived",
          "definition": "Houtos — 'this one,' pointing emphatically at the Baptist. Ēlthen — from erchomai, to come. Aorist tense — a specific, decisive arrival. He didn't wander in. He arrived with purpose.",
          "translationNote": "Accurately translated.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "for a witness",
          "original": "εἰς μαρτυρίαν",
          "transliteration": "eis martyrian",
          "pronunciation": "ace mar-too-REE-ahn",
          "strongs": "G1519, G3141",
          "partOfSpeech": "preposition + noun, accusative feminine singular",
          "literalMeaning": "for the purpose of testimony, for witness-bearing",
          "definition": "Martyria — testimony, witness, evidence. This is where we get the word 'martyr.' In the early church, bearing witness (martyria) and dying for that witness became so linked that the word itself came to mean someone who dies for their faith. John the Baptist literally became a martyr — beheaded for his testimony. The word predicted his fate. His entire purpose was martyria — not to be famous, not to build a following, but to point to someone else and say 'THAT one.'",
          "translationNote": "Accurately translated. The martyria→martyr connection is worth knowing.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "to bear witness of the Light",
          "original": "ἵνα μαρτυρήσῃ περὶ τοῦ φωτός",
          "transliteration": "hina martyrēsē peri tou phōtos",
          "pronunciation": "HEE-nah mar-too-RAY-say peh-REE too foh-TOHS",
          "strongs": "G2443, G3140, G4012, G5457",
          "partOfSpeech": "conjunction + verb subjunctive + preposition + noun genitive",
          "literalMeaning": "in order that he might testify about the Light",
          "definition": "Hina — purpose clause. 'In order that.' The Baptist's existence had a single purpose: testify about the Light. Not testify about himself, not build his own brand, not start a religion. Point. That's it. Peri tou phōtos — concerning the Light. The same phōs from verses 4-5. The Light that IS the life that IS in the Logos. The Baptist's job was to help people see what was already shining.",
          "translationNote": "Accurately translated.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "that all through him might believe",
          "original": "ἵνα πάντες πιστεύσωσιν δι' αὐτοῦ",
          "transliteration": "hina pantes pisteusōsin di autou",
          "pronunciation": "HEE-nah PAN-tes pis-TYOO-so-sin dee ow-TOO",
          "strongs": "G2443, G3956, G4100, G1223, G846",
          "partOfSpeech": "conjunction + adjective + verb subjunctive + preposition + pronoun",
          "literalMeaning": "in order that all might trust/believe through him",
          "definition": "Pisteusōsin — from pisteuō, to believe, to trust, to have faith, to be persuaded. This isn't intellectual agreement ('I believe that's a chair'). It's relational trust — entrusting yourself to someone. And pantes — ALL. Not 'some.' Not 'the elect.' ALL might believe. The Baptist's testimony was aimed at everyone. The scope of the invitation is universal even if the response isn't.",
          "translationNote": "'Believe' in modern English has weakened to mean 'think something is true.' The Greek pisteuō is much stronger — it's placing your trust in, committing yourself to, relying upon. More like 'trust' than 'believe.'",
          "twisted": true,
          "twistedExplanation": "The word 'believe' has been so watered down in English that 'I believe in God' can mean anything from deep personal trust to casual acknowledgment. In Greek, pisteuō means putting your full weight on something — like sitting in a chair you trust will hold you. Most English readers drastically underestimate what 'believe' means in the New Testament."
        }
      ]
    },
    {
      "verseNumber": 8,
      "verseText": "He was not that Light, but was sent to bear witness of that Light.",
      "freshTranslation": "He himself was not the Light — but he was sent to testify about the Light.",
      "historicalContext": "John the author says it twice in two verses: the Baptist is NOT the Light. This emphasis only makes sense if some readers might confuse the two. And they did — the Baptist had a massive following. Some thought HE was the Messiah (Luke 3:15). John the author is eliminating any ambiguity: the pointer is not the thing being pointed at.",
      "crossRefs": [
        {"ref": "John 3:28-30", "explanation": "The Baptist himself says: 'I am not the Christ, but I have been sent before Him... He must increase, but I must decrease.' The greatest humility statement in the Bible."},
        {"ref": "Luke 3:15", "explanation": "'The people were in expectation, and all were questioning in their hearts concerning John, whether he might be the Christ.' The confusion was real."}
      ],
      "words": [
        {
          "english": "He was not",
          "original": "οὐκ ἦν ἐκεῖνος",
          "transliteration": "ouk ēn ekeinos",
          "pronunciation": "ook ayn eh-KAY-nos",
          "strongs": "G3756, G1510, G1565",
          "partOfSpeech": "negative + verb + demonstrative pronoun",
          "literalMeaning": "not was that one",
          "definition": "Ouk — the strong Greek negative. Not maybe-not. Definitely not. Ekeinos — 'that one,' a distant demonstrative. John uses ekeinos to create distance between the Baptist and the Light — he wasn't even close to being the Light. The emphatic denial paired with the distant pronoun makes this as strong as Greek can make a 'no.'",
          "translationNote": "Accurately translated. The emphasis comes through.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "that Light",
          "original": "τὸ φῶς",
          "transliteration": "to phōs",
          "pronunciation": "toh FOHS",
          "strongs": "G5457",
          "partOfSpeech": "noun with article, nominative neuter singular",
          "literalMeaning": "the Light",
          "definition": "THE Light — with the definite article. Not a light. Not some light. THE Light. The one from verses 4-5. The life of the Logos that illuminates humanity. There's only one. The Baptist could reflect it, but he could never BE it.",
          "translationNote": "Accurately translated.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "but was sent to bear witness of that Light",
          "original": "ἀλλ' ἵνα μαρτυρήσῃ περὶ τοῦ φωτός",
          "transliteration": "all' hina martyrēsē peri tou phōtos",
          "pronunciation": "all HEE-nah mar-too-RAY-say peh-REE too foh-TOHS",
          "strongs": "G235, G2443, G3140, G4012, G5457",
          "partOfSpeech": "conjunction + purpose clause",
          "literalMeaning": "but in order that he might testify about the Light",
          "definition": "Alla — strong adversative conjunction. 'But' with force. Not just contrast — correction. 'He was NOT the Light — RATHER, he was sent to testify about it.' John redirects any misplaced attention from the Baptist to his actual function: witness. The greatest honor the Baptist had wasn't being great himself. It was pointing to someone greater.",
          "translationNote": "Accurately translated.",
          "twisted": false,
          "twistedExplanation": null
        }
      ]
    },
    {
      "verseNumber": 9,
      "verseText": "That was the true Light which gives light to every man coming into the world.",
      "freshTranslation": "The genuine Light — the one that illuminates every human being — was coming into the world.",
      "historicalContext": "This verse has a grammatical ambiguity in Greek that changes the meaning significantly. Is 'coming into the world' describing the Light or describing every person? Most translations attach it to 'every man coming into the world' (= every person who is born). But in Greek, 'coming' (erchomenon) can also modify 'Light' — 'the true Light was coming into the world.' The second reading is more likely and more profound: the Light itself was entering the world. The incarnation is approaching.",
      "crossRefs": [
        {"ref": "John 8:12", "explanation": "Jesus says: 'I am the light of the world. Whoever follows me will not walk in darkness.' He claims to BE this true Light."},
        {"ref": "John 9:5", "explanation": "'As long as I am in the world, I am the light of the world.' The Light came into the world — and it has a time limit."},
        {"ref": "Isaiah 49:6", "explanation": "'I will make you as a light for the nations, that my salvation may reach to the end of the earth.' The universal scope of the Light was prophesied."}
      ],
      "words": [
        {
          "english": "That was the true Light",
          "original": "Ἦν τὸ φῶς τὸ ἀληθινόν",
          "transliteration": "Ēn to phōs to alēthinon",
          "pronunciation": "ayn toh FOHS toh ah-lay-thee-NON",
          "strongs": "G1510, G5457, G228",
          "partOfSpeech": "verb + noun + adjective",
          "literalMeaning": "was the Light the genuine/real one",
          "definition": "Alēthinon — genuine, real, authentic, the original as opposed to copies. NOT alēthēs (truthful/honest) but alēthinon (the real deal vs imitations). There are many lights in the world — prophets, teachers, philosophies, religions. They're lamps. This is the SUN. Alēthinon says: every other light you've encountered was a reflection or imitation. THIS is the source. The real one. The original that all others are shadows of. John the Baptist was a lamp (John 5:35). Jesus is the alēthinon phōs — the genuine, original, ultimate Light.",
          "translationNote": "'True' is okay but in English 'true' usually means 'not false.' Alēthinon means more than 'not false' — it means 'the genuine article, the real thing, the original from which all copies derive.' 'Genuine' or 'authentic' would be better translations.",
          "twisted": true,
          "twistedExplanation": "Translating alēthinon as 'true' makes readers think 'as opposed to false.' The real meaning is 'as opposed to derivative/secondary.' The Baptist was a real light — he wasn't false. But he wasn't the GENUINE, ORIGINAL light. There's a difference between something being fake and something being a copy of the original. Alēthinon distinguishes originals from copies, not truth from lies."
        },
        {
          "english": "which gives light to every man",
          "original": "ὃ φωτίζει πάντα ἄνθρωπον",
          "transliteration": "ho phōtizei panta anthrōpon",
          "pronunciation": "ho foh-TEE-zay PAN-tah AN-throw-pon",
          "strongs": "G3739, G5461, G3956, G444",
          "partOfSpeech": "relative pronoun + verb present + adjective + noun",
          "literalMeaning": "which illuminates every human being",
          "definition": "Phōtizei — present tense, active voice. The Light ACTIVELY illuminates. It's not passive light sitting there waiting to be noticed. It goes out and illuminates. And panta anthrōpon — EVERY human. Universal. This means every person who has ever lived — whether they've heard the gospel or not — has been touched by this Light. This is the basis for general revelation, conscience, the sense of right and wrong, the perception of beauty. Romans 1:19-20 says the same thing: God has made Himself evident to all people through creation. The Light reaches everyone. Not everyone opens their eyes.",
          "translationNote": "'Gives light to' is accurate but slightly passive. Phōtizei is more active — 'illuminates,' 'lights up,' 'floods with light.'",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "coming into the world",
          "original": "ἐρχόμενον εἰς τὸν κόσμον",
          "transliteration": "erchomenon eis ton kosmon",
          "pronunciation": "er-KHO-meh-non ace ton KOS-mon",
          "strongs": "G2064, G1519, G2889",
          "partOfSpeech": "participle + preposition + noun",
          "literalMeaning": "coming into the world/ordered system",
          "definition": "Erchomenon — present participle of erchomai, 'coming.' Kosmon — world, ordered system, the created order. This is the first mention of kosmos in John — a word he'll use 78 times in this gospel. The Light was COMING into the kosmos. The eternal Logos was entering the created order. The uncreated was about to become part of creation. This is the prologue's countdown to verse 14 — the incarnation. Each verse gets closer: He was with God (v.1) → He made everything (v.3) → He is life and light (v.4) → He's coming into the world (v.9) → He was IN the world (v.10) → He BECAME flesh (v.14).",
          "translationNote": "The ambiguity of what 'coming' modifies (the Light or every person) is a real translation challenge. Most likely it modifies the Light — 'the genuine Light that illuminates every person was coming into the world.' The KJV attaches it to 'every man coming into the world' which works but misses the incarnation reference.",
          "twisted": true,
          "twistedExplanation": "The KJV rendering 'every man that cometh into the world' (attaching 'coming' to man instead of Light) has been the dominant reading for centuries. But most modern scholars agree erchomenon modifies phōs (the Light), not anthrōpon (man). This changes the verse from a statement about human birth to a statement about the incarnation — the Light ITSELF was entering the world. That's a much bigger claim."
        }
      ]
    },
    {
      "verseNumber": 10,
      "verseText": "He was in the world, and the world was made through Him, and the world did not know Him.",
      "freshTranslation": "He was present in the world — the very world that came into existence through Him — and the world did not recognize Him.",
      "historicalContext": "Three uses of 'world' (kosmos) in one verse, each with a different nuance. John is building a tragic irony: the Creator entered His own creation, and the creation didn't recognize its maker. Imagine an architect walking into a building he designed, and the building not knowing who he is. That's the scale of the tragedy John is describing.",
      "crossRefs": [
        {"ref": "Colossians 1:16-17", "explanation": "'All things were created through Him and for Him. He is before all things, and in Him all things hold together.' The world is held together by the one it rejected."},
        {"ref": "Isaiah 53:3", "explanation": "'He was despised and rejected by men, a man of sorrows and acquainted with grief.' Isaiah prophesied the rejection 700 years earlier."}
      ],
      "words": [
        {
          "english": "He was in the world",
          "original": "ἐν τῷ κόσμῳ ἦν",
          "transliteration": "en tō kosmō ēn",
          "pronunciation": "en toh KOS-moh ayn",
          "strongs": "G1722, G2889, G1510",
          "partOfSpeech": "preposition + noun + verb imperfect",
          "literalMeaning": "in the world He was existing",
          "definition": "Again ēn — imperfect, continuous existence. He wasn't just visiting. He was continually present in the world. Some scholars see this as referring to the pre-incarnate presence of the Logos in creation — He was always here, sustaining everything, even before Bethlehem. The world didn't suddenly gain His presence at the incarnation. It always had it. It just didn't know.",
          "translationNote": "Accurately translated.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "and the world was made through Him",
          "original": "καὶ ὁ κόσμος δι' αὐτοῦ ἐγένετο",
          "transliteration": "kai ho kosmos di autou egeneto",
          "pronunciation": "kai ho KOS-mos dee ow-TOO eh-GHEH-neh-toh",
          "strongs": "G2532, G2889, G1223, G846, G1096",
          "partOfSpeech": "conjunction + noun + preposition + pronoun + verb aorist",
          "literalMeaning": "and the world through Him came into being",
          "definition": "Egeneto again — the world CAME INTO BEING through Him. The world is a created thing (egeneto). He is the uncreated creator (ēn). And now the created thing doesn't recognize its creator. This is the setup for the most painful statement: He made it, He was in it, and it was blind to Him.",
          "translationNote": "Accurately translated.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "and the world did not know Him",
          "original": "καὶ ὁ κόσμος αὐτὸν οὐκ ἔγνω",
          "transliteration": "kai ho kosmos auton ouk egnō",
          "pronunciation": "kai ho KOS-mos ow-TON ook EHG-noh",
          "strongs": "G2532, G2889, G846, G3756, G1097",
          "partOfSpeech": "conjunction + noun + pronoun + negative + verb aorist",
          "literalMeaning": "and the world Him did not know/recognize",
          "definition": "Egnō — from ginōskō, to know experientially, to recognize, to perceive. This is relational knowledge, not intellectual. The world didn't RECOGNIZE Him. It's not that they lacked information — creation itself declares God's glory (Psalm 19:1). They had the data. They didn't have the recognition. Like a child who doesn't recognize their father in a crowd. The information is there. The connection isn't made. The world's failure wasn't intellectual but relational — it didn't KNOW its maker in the intimate, ginōskō sense.",
          "translationNote": "'Know' is accurate but in English can sound purely intellectual. Ginōskō is experiential recognition — not 'they didn't know facts about Him' but 'they didn't recognize Him when He was standing right in front of them.'",
          "twisted": false,
          "twistedExplanation": null
        }
      ]
    },
    {
      "verseNumber": 11,
      "verseText": "He came to His own, and His own did not receive Him.",
      "freshTranslation": "He came to His own home — to His own people — and His own people did not welcome Him in.",
      "historicalContext": "This is the most painful verse in the prologue. 'His own' (ta idia) means His own property, His own home. Israel was God's chosen people — His inheritance, His vineyard (Isaiah 5), His firstborn son (Exodus 4:22). The Logos came HOME. And home rejected Him. This is personal. This isn't the ignorant world not recognizing a stranger. This is family refusing to open the door.",
      "crossRefs": [
        {"ref": "Matthew 23:37", "explanation": "Jesus weeps: 'O Jerusalem, Jerusalem... how often I wanted to gather your children together, as a hen gathers her chicks under her wings, but you were not willing!' The rejection was willful, not accidental."},
        {"ref": "Isaiah 5:1-7", "explanation": "God planted a vineyard (Israel), built a wall around it, expected good grapes, and got wild ones. The parable of rejected love."},
        {"ref": "Exodus 4:22", "explanation": "'Israel is My firstborn son.' Israel wasn't just a nation — it was God's family. The rejection is familial."}
      ],
      "words": [
        {
          "english": "He came to His own",
          "original": "εἰς τὰ ἴδια ἦλθεν",
          "transliteration": "eis ta idia ēlthen",
          "pronunciation": "ace tah EE-dee-ah AYL-then",
          "strongs": "G1519, G2398, G2064",
          "partOfSpeech": "preposition + adjective neuter plural + verb aorist",
          "literalMeaning": "to His own things/home/property He came",
          "definition": "Ta idia — neuter plural of idios, meaning 'one's own things, one's own home, one's own property.' This is the word for personal belongings, your own house, your own territory. John 19:27 uses the same phrase when John took Mary 'to his own home' (eis ta idia). The Logos came to HIS OWN HOME. The world was His creation. Israel was His people. The Temple was His house. He came home. And home didn't want Him.",
          "translationNote": "'His own' is vague in English. The Greek specifies: His own HOME, His own PROPERTY. It's not just 'His own people' — it's His own place, His own domain. He came to where He belonged.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "and His own did not receive Him",
          "original": "καὶ οἱ ἴδιοι αὐτὸν οὐ παρέλαβον",
          "transliteration": "kai hoi idioi auton ou parelabon",
          "pronunciation": "kai hoy EE-dee-oy ow-TON oo pah-REH-lah-bon",
          "strongs": "G2532, G2398, G846, G3756, G3880",
          "partOfSpeech": "conjunction + adjective masculine plural + pronoun + negative + verb aorist",
          "literalMeaning": "and His own people Him did not receive/welcome alongside",
          "definition": "Notice the shift: ta idia (neuter — His own THINGS/home) becomes hoi idioi (masculine — His own PEOPLE). He came to His place; His people rejected Him. Parelabon — from paralambanō — to receive alongside, to welcome, to take to oneself. It implies hospitality — taking someone into your home, into your life. They didn't just fail to recognize Him (like the world in v.10). They actively refused to receive Him. Recognition vs reception — the world was blind; Israel was unwilling. That's worse.",
          "translationNote": "'Receive' captures parelabon adequately, but the shift from neuter 'His own' (home/property) to masculine 'His own' (people) is invisible in English. It's the same phrase in English but different genders in Greek, making two distinct points.",
          "twisted": true,
          "twistedExplanation": "English can't show the neuter→masculine shift. In verse 11a, 'His own' is neuter (ta idia = His own home/domain). In verse 11b, 'His own' is masculine (hoi idioi = His own people). The English reads like repetition. The Greek reads like escalation: His home → His family. The rejection gets more personal with each word."
        }
      ]
    },
    {
      "verseNumber": 12,
      "verseText": "But as many as received Him, to them He gave the right to become children of God, to those who believe in His name:",
      "freshTranslation": "But to everyone who did receive Him — who trusted in His name — He gave the authority to become born ones of God.",
      "historicalContext": "After the devastating rejection of verses 10-11, John pivots with 'but' (de). Not everyone rejected Him. Some received Him. And to those who did, something unprecedented happened: they were authorized to become God's children. In the Old Testament, Israel was God's 'son' collectively (Exodus 4:22). But individual humans becoming 'children of God' through the Logos — that's new. That's the new covenant.",
      "crossRefs": [
        {"ref": "Romans 8:14-16", "explanation": "Paul expands this: 'For as many as are led by the Spirit of God, these are sons of God... The Spirit Himself bears witness with our spirit that we are children of God.'"},
        {"ref": "Galatians 3:26", "explanation": "'For you are all sons of God through faith in Christ Jesus.' The mechanism is faith/trust, exactly as John says."},
        {"ref": "1 John 3:1", "explanation": "Same author, overwhelmed by the same truth: 'See what great love the Father has lavished on us, that we should be called children of God! And that is what we are!'"}
      ],
      "words": [
        {
          "english": "But as many as received Him",
          "original": "ὅσοι δὲ ἔλαβον αὐτόν",
          "transliteration": "hosoi de elabon auton",
          "pronunciation": "HOH-soy deh EH-lah-bon ow-TON",
          "strongs": "G3745, G1161, G2983, G846",
          "partOfSpeech": "relative pronoun + conjunction + verb aorist + pronoun",
          "literalMeaning": "as many as however received/took Him",
          "definition": "Hosoi — 'as many as,' 'whoever,' 'everyone who.' No restriction. No ethnic requirement. No prerequisite. Whoever. De — mild adversative, 'but/however.' Elabon — from lambanō, to receive, to take, to grasp. This is the positive counterpart to parelabon in verse 11. Israel didn't paralambanō (welcome alongside). But whoever DID lambanō (receive, grasp) Him got something extraordinary.",
          "translationNote": "Accurately translated.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "to them He gave the right",
          "original": "ἔδωκεν αὐτοῖς ἐξουσίαν",
          "transliteration": "edōken autois exousian",
          "pronunciation": "EH-doh-ken ow-TOYS ex-oo-SEE-ahn",
          "strongs": "G1325, G846, G1849",
          "partOfSpeech": "verb aorist + pronoun + noun accusative",
          "literalMeaning": "He gave to them authority/right/power",
          "definition": "Exousia — this word is HUGE. It means authority, right, power, permission, liberty. It's not just a legal right like a certificate. It's actual authority — delegated power. The same word used when Jesus 'gave them authority (exousia) over unclean spirits' (Matthew 10:1). God doesn't just permit you to be His child. He gives you the AUTHORITY of a child — the status, the access, the inheritance, the family name. Exousia includes the power to actually become what you're authorized to be.",
          "translationNote": "'Right' is okay but weak. Exousia means authorized power, not just permission. 'Authority' is better. You don't just have permission to call God Father — you have the delegated authority of a son or daughter.",
          "twisted": true,
          "twistedExplanation": "Translating exousia as 'right' domesticates it. In English, a 'right' is passive — something you're allowed to do. Exousia is active — it's the power and authority to do it. You don't just have the right to become God's child. You have been given the authority, the power, the divine backing to actually become one. That's a much bigger statement."
        },
        {
          "english": "to become children of God",
          "original": "τέκνα θεοῦ γενέσθαι",
          "transliteration": "tekna theou genesthai",
          "pronunciation": "TEK-nah theh-OO gheh-NES-thai",
          "strongs": "G5043, G2316, G1096",
          "partOfSpeech": "noun + noun genitive + verb aorist infinitive",
          "literalMeaning": "born-ones of God to become",
          "definition": "Tekna — not huioi (sons) but tekna — 'born ones,' 'offspring,' children in the sense of being BORN from a parent. The word emphasizes origin — where you came from. And genesthai — from ginomai, to become. Not 'to be declared' children of God. To BECOME them. Something actually changes. You become something you weren't before. This isn't a title change. It's a nature change. And it connects directly to verse 13 — which explains HOW this birth happens.",
          "translationNote": "'Children' is accurate for tekna. The key nuance is that tekna emphasizes birth/origin while huioi emphasizes status/position. John chose the birth word — you're not adopted into a legal position (Paul uses huioi for that). You're BORN into a family. Different metaphor, different emphasis.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "to those who believe in His name",
          "original": "τοῖς πιστεύουσιν εἰς τὸ ὄνομα αὐτοῦ",
          "transliteration": "tois pisteuousin eis to onoma autou",
          "pronunciation": "toys pis-TYOO-oo-sin ace toh OH-no-mah ow-TOO",
          "strongs": "G3588, G4100, G1519, G3686, G846",
          "partOfSpeech": "article + participle present + preposition + noun + pronoun",
          "literalMeaning": "to the ones trusting into the name of Him",
          "definition": "Pisteuousin — present participle of pisteuō. Present tense means ongoing, continuous trust — not a one-time decision but a continuing state of trust. Eis to onoma — 'into the name.' Not just believing ABOUT His name or THAT His name is real. Believing INTO it — entering into it, investing yourself in it. In Hebrew thought, a name (שֵׁם / shem) IS the person — their character, reputation, authority, essence. To believe 'into His name' means to entrust yourself to everything He is.",
          "translationNote": "'Believe in' flattens the Greek. The preposition eis (into) with pisteuō implies movement — you're not just believing about something from the outside. You're trusting yourself INTO something. Committing. Entering in.",
          "twisted": true,
          "twistedExplanation": "'Believe in' has become a passive phrase in English — 'I believe in Santa Claus' and 'I believe in Jesus' sound grammatically identical. But pisteuō eis is active, directional, and total — it means to place your whole trust INTO someone, to commit yourself to them. The English phrasing makes salvation sound like a mental checkbox. The Greek makes it sound like jumping off a cliff into someone's arms."
        }
      ]
    },
    {
      "verseNumber": 13,
      "verseText": "who were born, not of blood, nor of the will of the flesh, nor of the will of man, but of God.",
      "freshTranslation": "These ones were born — not from bloodline, not from physical desire, not from a husband's decision — but from God Himself.",
      "historicalContext": "John lists three things that do NOT produce spiritual birth, then names the one thing that does. This was revolutionary for a Jewish audience: being born into the right bloodline (Abraham's descendants) doesn't make you God's child. Physical descent is irrelevant to spiritual birth. John the Baptist said the same thing: 'Do not think to say to yourselves, we have Abraham as our father' (Matthew 3:9). The new birth isn't genetic. It's from God.",
      "crossRefs": [
        {"ref": "John 3:3-6", "explanation": "Jesus tells Nicodemus: 'Unless one is born again, he cannot see the kingdom of God... That which is born of the flesh is flesh, and that which is born of the Spirit is spirit.' Verse 13 is the thesis; John 3 is the explanation."},
        {"ref": "Matthew 3:9", "explanation": "John the Baptist: 'Do not think to say, We have Abraham as our father. For I tell you, God is able from these stones to raise up children for Abraham.' Bloodline doesn't equal sonship."},
        {"ref": "Romans 9:6-8", "explanation": "Paul makes the same point: 'Not all who are descended from Israel belong to Israel... it is not the children of the flesh who are the children of God, but the children of the promise.'"}
      ],
      "words": [
        {
          "english": "who were born",
          "original": "οἳ ἐγεννήθησαν",
          "transliteration": "hoi egennēthēsan",
          "pronunciation": "hoy eh-ghen-NAY-thay-san",
          "strongs": "G3739, G1080",
          "partOfSpeech": "relative pronoun + verb, aorist passive indicative, 3rd person plural",
          "literalMeaning": "who were begotten/generated/born",
          "definition": "Gennaō — to beget, to give birth, to generate. Passive voice — they were born BY someone else. They didn't birth themselves. This is God's action, not human effort. You don't generate your own spiritual birth any more than you chose to be physically born. Someone else did that to you.",
          "translationNote": "Accurately translated.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "not of blood",
          "original": "οὐκ ἐξ αἱμάτων",
          "transliteration": "ouk ex haimatōn",
          "pronunciation": "ook ex hai-MAH-tone",
          "strongs": "G3756, G1537, G129",
          "partOfSpeech": "negative + preposition + noun genitive plural",
          "literalMeaning": "not out of bloods (plural)",
          "definition": "Haimatōn — bloods, PLURAL. This is unusual. 'Bloods' in Hebrew idiom refers to bloodline — the mixing of parents' blood to produce offspring. It's about genetic descent, family lineage, ethnic heritage. Being Jewish by birth. Having Abraham's DNA. John says: that's not how you become God's child. Your family tree is irrelevant to your spiritual birth. This destroyed the primary Jewish assumption about covenant membership.",
          "translationNote": "Most translations say 'blood' (singular) when the Greek is clearly plural 'bloods' (haimatōn). The plural points specifically to lineage/descent — the mixing of two parents' blood. 'Bloodline' would be more accurate than 'blood.'",
          "twisted": true,
          "twistedExplanation": "Changing the plural 'bloods' to singular 'blood' hides the specific meaning. 'Not of blood' sounds vague and mysterious. 'Not of bloods' (or 'not of bloodlines') clearly means genetic descent and family heritage don't produce spiritual birth. The plural is theologically precise; the singular translation is theologically fuzzy."
        },
        {
          "english": "nor of the will of the flesh",
          "original": "οὐδὲ ἐκ θελήματος σαρκός",
          "transliteration": "oude ek thelēmatos sarkos",
          "pronunciation": "oo-DEH ek theh-LAY-mah-tos sar-KOHS",
          "strongs": "G3761, G1537, G2307, G4561",
          "partOfSpeech": "negative + preposition + noun genitive + noun genitive",
          "literalMeaning": "nor out of the will/desire of flesh",
          "definition": "Thelēma — will, desire, wish, determination. Sarx — flesh, the physical body, human nature in its weakness. The 'will of the flesh' is physical/sexual desire — the natural human drive to reproduce. You can't produce spiritual children through physical means. No amount of human effort, religious ritual, or physical action generates spiritual birth. It's not something your body does.",
          "translationNote": "Accurately translated, though 'will of the flesh' sounds abstract. It specifically means human sexual/reproductive desire — you can't birth yourself into God's family through physical procreation.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "nor of the will of man",
          "original": "οὐδὲ ἐκ θελήματος ἀνδρός",
          "transliteration": "oude ek thelēmatos andros",
          "pronunciation": "oo-DEH ek theh-LAY-mah-tos an-DROHS",
          "strongs": "G3761, G1537, G2307, G435",
          "partOfSpeech": "negative + preposition + noun genitive + noun genitive",
          "literalMeaning": "nor out of the will/decision of a husband/man",
          "definition": "NOW John uses anēr (andros) — a male, specifically a husband — NOT anthrōpos (generic human). This is deliberate. In the ancient world, the husband decided to have children. It was the patriarch's decision to produce an heir. John says: a man's decision to have children doesn't produce children of God. No human authority figure — no father, no priest, no rabbi, no pastor — can decide to make you God's child. That authority belongs to God alone.",
          "translationNote": "'Man' hides the specificity. Anēr means 'male/husband' specifically. This isn't repeating 'flesh' — it's adding a new layer. Flesh = physical desire. Anēr = a husband's deliberate decision. Neither works. Only God's action works.",
          "twisted": true,
          "twistedExplanation": "Translating anēr as 'man' (generic) instead of 'husband' or 'male' hides John's progression: bloods (lineage) → flesh (physical desire) → husband (male authority/decision). Three layers of human reproduction, all negated. The English makes it sound like two vague repetitions. The Greek is a precise, escalating denial of every human mechanism for producing spiritual life."
        },
        {
          "english": "but of God",
          "original": "ἀλλ' ἐκ θεοῦ ἐγεννήθησαν",
          "transliteration": "all' ek theou egennēthēsan",
          "pronunciation": "all ek theh-OO eh-ghen-NAY-thay-san",
          "strongs": "G235, G1537, G2316, G1080",
          "partOfSpeech": "conjunction + preposition + noun genitive + verb aorist passive",
          "literalMeaning": "but out of God they were born/begotten",
          "definition": "Alla — the strong adversative again. After three 'not from's, one thundering 'BUT FROM.' Ek theou — out of God, from God as the source. God is the origin of the new birth. Not your bloodline, not your body, not your husband, not your pastor, not your own decision ultimately — GOD. He begets. You are begotten. The passive voice (egennēthēsan — 'they were born') means you don't do the birthing. You receive it. Just like your physical birth wasn't your idea or your effort, your spiritual birth originates with God.",
          "translationNote": "Accurately translated. The force of the alla (but) after three negations is powerful even in English.",
          "twisted": false,
          "twistedExplanation": null
        }
      ]
    },
    {
      "verseNumber": 14,
      "verseText": "And the Word became flesh and dwelt among us, and we beheld His glory, the glory as of the only begotten of the Father, full of grace and truth.",
      "freshTranslation": "And the Word became flesh — became human — and pitched His tent among us. We gazed upon His glory — glory like that of a Father's one and only Son — overflowing with grace and truth.",
      "historicalContext": "THIS IS IT. This is the verse the entire prologue has been building toward. The eternal Logos — who was with God, who was God, who made everything — became sarx. Flesh. Meat. The most physical, earthy, unglamorous word John could have chosen. Not 'became human' (anthrōpos) or 'took on a body' (sōma). FLESH. The stuff that bleeds and sweats and gets hungry and tired and dies. The infinite became finite. The Creator became a creature. The uncreated Word that spoke galaxies into existence became a baby who needed His mother to feed Him. This is the most staggering claim in all of religious literature. No other religion makes this claim — that God didn't just VISIT humanity but BECAME human. 'Dwelt among us' is literally 'tabernacled among us' — eskēnōsen — He pitched His tent, echoing the tabernacle in the wilderness where God's presence dwelt with Israel. God is camping with humanity again.",
      "crossRefs": [
        {"ref": "Exodus 25:8", "explanation": "'Let them make me a sanctuary, that I may dwell (שָׁכַן / shakan) among them.' The tabernacle was God's tent among His people. John says Jesus IS the new tabernacle — God's presence dwelling in human flesh."},
        {"ref": "Exodus 33:18-23", "explanation": "Moses asked to see God's glory. God said 'you cannot see my face and live' and showed only His back. Now the glory LIVES among us in flesh. What Moses could only glimpse, John says 'we beheld.'"},
        {"ref": "Philippians 2:6-8", "explanation": "Paul describes the same event: 'Who, being in the form of God, did not consider equality with God something to be grasped, but emptied Himself, taking the form of a servant, being made in the likeness of men.'"},
        {"ref": "1 Timothy 3:16", "explanation": "'Great indeed is the mystery of godliness: God was manifested in the flesh.' The early church creed, saying the same thing John says."},
        {"ref": "Colossians 2:9", "explanation": "'For in Him the whole fullness of deity dwells bodily.' All of God, in a body. That's verse 14 in one sentence."}
      ],
      "words": [
        {
          "english": "And the Word",
          "original": "Καὶ ὁ λόγος",
          "transliteration": "Kai ho logos",
          "pronunciation": "kai ho LOH-gos",
          "strongs": "G2532, G3056",
          "partOfSpeech": "conjunction + noun with article",
          "literalMeaning": "and the Word/Logos",
          "definition": "The same Logos from verse 1. The one who was in the beginning. The one who was face-to-face with God. The one who WAS God. The one through whom everything was made. That Logos. John brings us full circle — you know who He is now. You've spent 13 verses learning about His eternity, His divinity, His creative power. Now watch what He does.",
          "translationNote": "See verse 1 notes on logos.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "became",
          "original": "ἐγένετο",
          "transliteration": "egeneto",
          "pronunciation": "eh-GHEH-neh-toh",
          "strongs": "G1096",
          "partOfSpeech": "verb, aorist middle indicative, 3rd person singular",
          "literalMeaning": "became, came into being as",
          "definition": "The most shocking use of egeneto in the Bible. In verse 1, the Word ĒN (was — eternally existing). In verse 3, everything else EGENETO (came into being — was created). Now the Word Himself EGENETO — became something He wasn't before. The eternal entered time. The uncreated took on created nature. This isn't saying the Word was REPLACED by flesh or TURNED INTO flesh. It's saying the Word ADDED flesh to Himself. He didn't stop being the Logos. He became the Logos-in-flesh. Both natures. One person. This single word is the foundation of everything Christians believe about the incarnation.",
          "translationNote": "'Became' is accurate and the best English can do. The weight of egeneto here — the same verb used for creation in verse 3 now applied to the Creator Himself — is staggering but impossible to convey in translation without a footnote.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "flesh",
          "original": "σάρξ",
          "transliteration": "sarx",
          "pronunciation": "sarks",
          "strongs": "G4561",
          "partOfSpeech": "noun, nominative feminine singular",
          "literalMeaning": "flesh, meat, the physical body, human nature in its weakness and mortality",
          "definition": "John didn't say the Word became anthrōpos (a human) or sōma (a body) or morphē (a form). He said SARX — flesh. Raw, physical, vulnerable, mortal flesh. This is the most visceral, physical, unglamorous word available. Sarx is meat. It's what you see at a butcher shop. It bleeds, bruises, breaks, and dies. John chose this word ON PURPOSE to combat the Gnostic heresy that Jesus only APPEARED to be human (docetism). No — He became SARX. Real flesh. Real blood. Real hunger, real thirst, real pain, real death. The God who holds galaxies together had a belly button. That's sarx.",
          "translationNote": "Accurately translated. 'Flesh' in English still carries the right rawness. Some modern translations soften it to 'human' or 'human being' which loses the shock value John intended. He WANTED it to be jarring.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "and dwelt among us",
          "original": "καὶ ἐσκήνωσεν ἐν ἡμῖν",
          "transliteration": "kai eskēnōsen en hēmin",
          "pronunciation": "kai eh-SKAY-noh-sen en hay-MEEN",
          "strongs": "G2532, G4637, G1722, G1473",
          "partOfSpeech": "conjunction + verb aorist + preposition + pronoun",
          "literalMeaning": "and tabernacled/pitched-tent in/among us",
          "definition": "Skēnoō — to pitch a tent, to tabernacle, to set up camp. From skēnē — a tent. This is a MASSIVE allusion to the Old Testament. The tabernacle (mishkan / מִשְׁכָּן in Hebrew, from shakan / שָׁכַן — to dwell) was the portable tent where God's glory-presence dwelt among Israel in the wilderness. The Shekinah (שְׁכִינָה) — the visible glory of God — filled the tabernacle (Exodus 40:34). John is saying: Jesus IS the new tabernacle. God's glory-presence isn't in a tent made of animal skins anymore. It's in FLESH. The Greek skēnoō even SOUNDS like the Hebrew shakan. John is almost certainly making a deliberate phonetic connection between the two languages for his bilingual audience.",
          "translationNote": "'Dwelt' is severely inadequate. It's technically not wrong but it completely hides the tabernacle connection. 'Tabernacled among us' or 'pitched His tent among us' would preserve the most important allusion in the verse. Every Jew reading this in Greek would have heard the echo of the mishkan. English readers miss it entirely.",
          "twisted": true,
          "twistedExplanation": "Translating eskēnōsen as simply 'dwelt' is one of the biggest losses in Bible translation. The word means 'tabernacled' — it directly connects Jesus to the OT tabernacle where God's presence lived among Israel. The entire theology of God's presence moving from tent → temple → flesh → believers is encoded in this one verb. 'Dwelt' erases all of it. Every reader should know this word means 'pitched His tent' — God went camping with humanity."
        },
        {
          "english": "and we beheld His glory",
          "original": "καὶ ἐθεασάμεθα τὴν δόξαν αὐτοῦ",
          "transliteration": "kai etheasametha tēn doxan autou",
          "pronunciation": "kai eh-theh-ah-SAH-meh-thah tayn DOX-ahn ow-TOO",
          "strongs": "G2532, G2300, G3588, G1391, G846",
          "partOfSpeech": "conjunction + verb aorist middle + article + noun + pronoun",
          "literalMeaning": "and we gazed upon/contemplated the glory of Him",
          "definition": "Theaomai — not just 'see' (blepō) or 'look at' (horaō). Theaomai means to gaze at with wonder, to contemplate, to behold something spectacular. It's where we get 'theater' — a place of spectacle and viewing. John isn't saying 'we noticed Him.' He's saying 'we couldn't stop staring.' We GAZED at His glory. And doxa — glory, magnificence, splendor, the visible manifestation of God's nature. The same doxa that filled the tabernacle (Exodus 40:34), that Moses begged to see (Exodus 33:18), that was too intense for humans to survive — John says 'we beheld it.' In a human face. In flesh.",
          "translationNote": "'Beheld' is decent — it's more elevated than 'saw.' But 'gazed upon' or 'contemplated' would better capture theaomai's sense of prolonged, awestruck observation. This wasn't a glance. It was a stare.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "the glory as of the only begotten of the Father",
          "original": "δόξαν ὡς μονογενοῦς παρὰ πατρός",
          "transliteration": "doxan hōs monogenous para patros",
          "pronunciation": "DOX-ahn hohs mo-no-gheh-NOOS pah-RAH pah-TROHS",
          "strongs": "G1391, G5613, G3439, G3844, G3962",
          "partOfSpeech": "noun + conjunction + adjective genitive + preposition + noun genitive",
          "literalMeaning": "glory as of an only-one-of-its-kind from-beside a Father",
          "definition": "Monogenēs — THIS WORD. It does NOT mean 'only begotten' in the sense of 'created' or 'born.' It comes from monos (only) + genos (kind, type, class) — meaning 'one of a kind, unique, the only one of its type.' The older derivation from gennaō (to beget) has been corrected by modern scholarship. Monogenēs means unique, not procreated. Isaac was called Abraham's monogenēs (Hebrews 11:17) even though Abraham had other sons (Ishmael). Isaac was the unique one — the promised one, the one-of-a-kind. Jesus isn't God's Son because God 'begat' Him in time. He's monogenēs — the utterly unique, one-of-a-kind Son. There is no other like Him. Para patros — 'from beside a Father' — the same intimate para from verse 6. From the Father's side.",
          "translationNote": "'Only begotten' is a famously problematic translation. It implies the Son was 'begotten' or produced at some point in time, which contradicts verse 1 (the Word was ALREADY existing in the beginning). Modern translations increasingly use 'only,' 'one and only,' or 'unique' — which is what monogenēs actually means. The KJV's 'only begotten' has caused centuries of theological confusion.",
          "twisted": true,
          "twistedExplanation": "'Only begotten' (KJV) led to the Arian heresy and Jehovah's Witness theology — the idea that the Son was 'begotten' (created/produced) by the Father at some point. But monogenēs means 'one-of-a-kind,' not 'only-produced.' The Son is unique, not manufactured. This single mistranslation has fueled more theological error than almost any other word in the Bible. Modern scholarship overwhelmingly supports 'one and only' or 'unique' as the correct translation."
        },
        {
          "english": "full of grace and truth",
          "original": "πλήρης χάριτος καὶ ἀληθείας",
          "transliteration": "plērēs charitos kai alētheias",
          "pronunciation": "PLAY-rays KAH-ree-tos kai ah-lay-THAY-ahs",
          "strongs": "G4134, G5485, G2532, G225",
          "partOfSpeech": "adjective + noun genitive + conjunction + noun genitive",
          "literalMeaning": "full/complete of grace/unmerited-favor and truth/reality",
          "definition": "Plērēs — full, complete, lacking nothing. Not 'containing some grace.' FULL of it. Overflowing. Charis — grace, unmerited favor, the free gift of God's goodness that you didn't earn and can't repay. This is the first use of charis in John's gospel — and he saves it for the incarnation. Grace doesn't appear in the abstract. It appears in flesh. Alētheia — truth, reality, what is genuinely real. Not just 'correct information' but reality itself as opposed to illusion. Together, charis kai alētheia echoes the Old Testament description of God: חֶסֶד וֶאֱמֶת (chesed ve'emet) — lovingkindness and faithfulness (Exodus 34:6). When God revealed His character to Moses, He described Himself as 'abounding in chesed and emet.' John is saying: that same God — that same character — is now visible in flesh.",
          "translationNote": "'Grace and truth' is accurate. The OT connection to chesed ve'emet (lovingkindness and faithfulness) from Exodus 34:6 is crucial — John is declaring that Jesus is the embodiment of God's self-described character. What God said about Himself to Moses is now walking around in sandals.",
          "twisted": false,
          "twistedExplanation": null
        }
      ]
    }
  ]
