[
    {
      "verseNumber": 15,
      "verseText": "John bore witness of Him and cried out, saying, \"This was He of whom I said, 'He who comes after me is preferred before me, for He was before me.'\"",
      "freshTranslation": "John testified about Him and shouted: 'This is the one I was talking about — the one coming after me has been placed ahead of me, because He existed before me.'",
      "historicalContext": "John the Baptist was physically OLDER than Jesus by about six months (Luke 1:26, 36). So when he says 'He was before me,' he can't mean chronologically in human terms. He means in a deeper sense — the Logos existed before the Baptist, before Abraham, before creation. The Baptist is claiming that the man standing in front of him — his younger cousin — is the pre-existent God.",
      "crossRefs": [
        {"ref": "John 8:58", "explanation": "Jesus Himself claims this: 'Before Abraham was, I AM (egō eimi).' The same pre-existence the Baptist recognized."},
        {"ref": "Colossians 1:17", "explanation": "'He is before all things.' Not just before John. Before everything."}
      ],
      "words": [
        {
          "english": "John bore witness of Him and cried out",
          "original": "Ἰωάννης μαρτυρεῖ περὶ αὐτοῦ καὶ κέκραγεν",
          "transliteration": "Iōannēs martyrei peri autou kai kekragen",
          "pronunciation": "ee-oh-AH-nays mar-too-RAY peh-REE ow-TOO kai KEH-krah-ghen",
          "strongs": "G2491, G3140, G4012, G846, G2532, G2896",
          "partOfSpeech": "noun + verb present + preposition + pronoun + conjunction + verb perfect",
          "literalMeaning": "John testifies about Him and has cried out",
          "definition": "Martyrei — present tense! John's testimony is ongoing, still active, still speaking through the record. And kekragen — perfect tense of krazō — to cry out, to shout, to scream. Perfect tense means he cried out in the past and the cry is still echoing. Krazō isn't polite speaking. It's shouting. The Baptist wasn't casually mentioning Jesus. He was screaming at people to pay attention. This is a street preacher level of urgency.",
          "translationNote": "'Bore witness' (past tense) misses the present tense in Greek — John's testimony is treated as ongoing. 'Cried out' is good — krazō is loud and urgent.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "He who comes after me is preferred before me",
          "original": "ὁ ὀπίσω μου ἐρχόμενος ἔμπροσθέν μου γέγονεν",
          "transliteration": "ho opisō mou erchomenos emprosthen mou gegonen",
          "pronunciation": "ho oh-PEE-soh moo er-KHO-meh-nos EM-pros-then moo GHEH-go-nen",
          "strongs": "G3588, G3694, G1473, G2064, G1715, G1473, G1096",
          "partOfSpeech": "article + adverb + pronoun + participle + adverb + pronoun + verb perfect",
          "literalMeaning": "the one after me coming has become/been placed before me",
          "definition": "Opisō mou — 'after me' (in time, in ministry order). The Baptist started his ministry first. Jesus came after. But emprosthen mou — 'before me, ahead of me' — in rank, in importance, in position. Gegonen — perfect tense of ginomai — 'has become' or 'has been placed.' He has taken the position ahead. The one who came later in time holds the higher position. Because...",
          "translationNote": "'Preferred before me' (KJV) sounds like a personal preference. The Greek means He has been RANKED ahead, placed in front. It's positional authority, not preference.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "for He was before me",
          "original": "ὅτι πρῶτός μου ἦν",
          "transliteration": "hoti prōtos mou ēn",
          "pronunciation": "HOH-tee PRO-tos moo ayn",
          "strongs": "G3754, G4413, G1473, G1510",
          "partOfSpeech": "conjunction + adjective + pronoun + verb imperfect",
          "literalMeaning": "because first/before me He was existing",
          "definition": "Prōtos — first, before, chief. And ĒN — that same imperfect verb from verse 1. He WAS ALREADY EXISTING before me. Not egeneto (came into being before me) but ēn (was continually existing before me). The Baptist, speaking about his younger cousin, uses the verb reserved for eternal pre-existence. He knows exactly who Jesus is. A man born six months after the Baptist — but who existed before the universe.",
          "translationNote": "Accurately translated. The force of ēn (eternal pre-existence) vs potential egeneto (created before) is critical but invisible in English 'was.'",
          "twisted": false,
          "twistedExplanation": null
        }
      ]
    },
    {
      "verseNumber": 16,
      "verseText": "And of His fullness we have all received, and grace for grace.",
      "freshTranslation": "Out of His fullness we have all received — grace upon grace, one wave of grace replacing the last.",
      "historicalContext": "John shifts from the Baptist's testimony back to his own first-person reflection. 'We have all received' — John includes himself and all believers. The image is of an inexhaustible supply — you take from His fullness and it doesn't diminish. Like an ocean you can't empty.",
      "crossRefs": [
        {"ref": "Colossians 1:19", "explanation": "'For it pleased the Father that in Him all the fullness (plērōma) should dwell.' The same concept — Jesus contains the totality of God's being."},
        {"ref": "Ephesians 3:19", "explanation": "Paul prays believers would 'be filled with all the fullness (plērōma) of God.' What's in Christ flows into His people."},
        {"ref": "Colossians 2:10", "explanation": "'And you are complete (filled up) in Him.' Believers share in the fullness."}
      ],
      "words": [
        {
          "english": "And of His fullness",
          "original": "ὅτι ἐκ τοῦ πληρώματος αὐτοῦ",
          "transliteration": "hoti ek tou plērōmatos autou",
          "pronunciation": "HOH-tee ek too play-ROH-mah-tos ow-TOO",
          "strongs": "G3754, G1537, G4138, G846",
          "partOfSpeech": "conjunction + preposition + noun genitive + pronoun",
          "literalMeaning": "because out of the fullness of Him",
          "definition": "Plērōma — fullness, completeness, the total sum of everything. From plēroō — to fill completely. This was a loaded term in John's world. Gnostic philosophers used plērōma to describe the totality of divine powers. John hijacks their word: the plērōma isn't a complex system of emanations. It's all in ONE person — Jesus. Everything God is, everything God has, the total package — that's the plērōma and it lives in the Word-made-flesh. And ek — out of. We receive OUT OF His fullness. It flows from Him to us.",
          "translationNote": "'Fullness' captures plērōma well. The word is rich and technical but 'fullness' conveys the core meaning.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "we have all received",
          "original": "ἡμεῖς πάντες ἐλάβομεν",
          "transliteration": "hēmeis pantes elabomen",
          "pronunciation": "hay-MAYS PAN-tes eh-LAH-bo-men",
          "strongs": "G1473, G3956, G2983",
          "partOfSpeech": "pronoun + adjective + verb aorist",
          "literalMeaning": "we all received/took",
          "definition": "Hēmeis pantes — WE ALL. John includes everyone. Elabomen — from lambanō, to receive. Same root as verse 12 where those who 'received Him' got the authority to become children of God. Those who received Him then received FROM His fullness. The receiving doesn't stop at the initial acceptance. It continues — you keep drawing from the supply.",
          "translationNote": "Accurately translated.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "and grace for grace",
          "original": "καὶ χάριν ἀντὶ χάριτος",
          "transliteration": "kai charin anti charitos",
          "pronunciation": "kai KAH-rin an-TEE KAH-ree-tos",
          "strongs": "G2532, G5485, G473, G5485",
          "partOfSpeech": "conjunction + noun + preposition + noun",
          "literalMeaning": "and grace in place of / upon / in exchange for grace",
          "definition": "Anti — this preposition is debated. It can mean (1) 'in place of' — new grace replacing old grace, like waves on a beach, one replacing the next; (2) 'upon' — grace piled on grace; (3) 'in exchange for' — grace received in response to grace. Most likely meaning: wave after wave of grace, each one replacing the last. Like ocean waves — the moment one grace recedes, the next one arrives. It never stops. You don't get one serving of grace and that's it. It's continuous, relentless, unending. The image is of overwhelming, excessive, never-ending generosity from God.",
          "translationNote": "'Grace for grace' is literal but cryptic. Most modern readers have no idea what it means. 'Grace upon grace' (ESV/NIV) is better. 'One wave of grace after another' captures the dynamic, unending quality John is describing.",
          "twisted": true,
          "twistedExplanation": "The KJV 'grace for grace' is so cryptic it's almost meaningless to modern readers. Anti charitos is a beautiful image — grace replacing grace, like waves — that gets lost in overly literal translation. 'Grace upon grace' or 'grace after grace' would serve readers far better."
        }
      ]
    },
    {
      "verseNumber": 17,
      "verseText": "For the law was given through Moses, but grace and truth came through Jesus Christ.",
      "freshTranslation": "For the law was given through Moses — but grace and truth arrived through Jesus the Messiah.",
      "historicalContext": "THIS is the first time Jesus is named in John's gospel. Seventeen verses of building up — Logos, God, Creator, life, light, flesh, glory — and NOW John drops the name: Jesus Christ. Iēsous Christos. The reveal. Everything you've been reading about? His name is Jesus. And John sets up a deliberate contrast: Moses brought the law (a good thing — given by God). But Jesus brought something greater: grace AND truth — the embodiment of chesed ve'emet (Exodus 34:6). The law told you what God required. Jesus IS what God is like.",
      "crossRefs": [
        {"ref": "Exodus 34:6", "explanation": "God's self-description to Moses: 'Abounding in chesed (lovingkindness) and emet (faithfulness/truth).' John says this same pair — grace and truth — came through Jesus. Moses heard God describe Himself. Jesus IS that description in person."},
        {"ref": "Romans 6:14", "explanation": "'You are not under law but under grace.' Paul makes the same Moses→Jesus, law→grace transition."},
        {"ref": "Hebrews 3:3-6", "explanation": "'Jesus has been counted worthy of more glory than Moses.' Greater than the greatest prophet."}
      ],
      "words": [
        {
          "english": "For the law was given through Moses",
          "original": "ὅτι ὁ νόμος διὰ Μωϋσέως ἐδόθη",
          "transliteration": "hoti ho nomos dia Mōyseōs edothē",
          "pronunciation": "HOH-tee ho NO-mos dee-AH mo-oo-SEH-ohs eh-DOH-thay",
          "strongs": "G3754, G3551, G1223, G3475, G1325",
          "partOfSpeech": "conjunction + noun + preposition + proper noun + verb aorist passive",
          "literalMeaning": "because the law through Moses was given",
          "definition": "Nomos — law, regulation, principle. Specifically the Torah — the law of Moses. Dia Mōyseōs — through Moses as the agent. Edothē — passive of didōmi (to give). The law was GIVEN — passive voice — meaning God gave it THROUGH Moses. Moses was the delivery system, not the source. And John isn't dismissing the law — he says it was 'given,' which is a positive word. The law was a gift. But it was an incomplete gift. It told you what righteousness looked like but couldn't make you righteous.",
          "translationNote": "Accurately translated.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "but grace and truth came through Jesus Christ",
          "original": "ἡ χάρις καὶ ἡ ἀλήθεια διὰ Ἰησοῦ Χριστοῦ ἐγένετο",
          "transliteration": "hē charis kai hē alētheia dia Iēsou Christou egeneto",
          "pronunciation": "hay KAH-ris kai hay ah-LAY-thay-ah dee-AH ee-ay-SOO khris-TOO eh-GHEH-neh-toh",
          "strongs": "G5485, G2532, G225, G1223, G2424, G5547, G1096",
          "partOfSpeech": "noun + conjunction + noun + preposition + proper noun + verb aorist",
          "literalMeaning": "the grace and the truth through Jesus Christ came into being",
          "definition": "The law was 'given' (edothē). Grace and truth 'came into being' (egeneto) — they arrived, they materialized, they became real and present. Not just communicated from a distance like the law on tablets. Grace and truth showed up in person. Iēsous — the Greek form of Hebrew Yehoshua (יְהוֹשֻׁעַ) or shortened Yeshua (יֵשׁוּעַ), meaning 'Yahweh saves' or 'Yahweh is salvation.' His name is His mission. Christos — from chriō, to anoint. The Greek equivalent of Hebrew Mashiach (מָשִׁיחַ) — Messiah, the Anointed One. After 17 verses of cosmic theology, John finally says the name: Jesus the Messiah. The Logos has a human name.",
          "translationNote": "'Jesus Christ' is so familiar that readers forget both words are meaningful. Jesus = 'God saves.' Christ = 'Anointed One/Messiah.' Every time you read 'Jesus Christ' you're reading 'God-saves, the-Anointed-King.' It's a title and a mission statement, not a first and last name.",
          "twisted": true,
          "twistedExplanation": "Transliterating Christos as 'Christ' instead of translating it as 'Messiah' or 'Anointed One' has made 'Christ' sound like Jesus' last name to most Western readers. It's not. It's His title — the long-awaited Anointed King of Israel. 'Jesus the Messiah' or 'Jesus the Anointed One' would help readers understand that this name is a claim to the throne, not just an identifier."
        }
      ]
    },
    {
      "verseNumber": 18,
      "verseText": "No one has seen God at any time. The only begotten Son, who is in the bosom of the Father, He has declared Him.",
      "freshTranslation": "No one has ever seen God. The one-of-a-kind Son — the one who exists in the Father's intimate embrace — He has made God fully known.",
      "historicalContext": "The prologue's final verse and its ultimate claim. No human has seen God directly — not even Moses, who only saw God's back (Exodus 33:23). But the Son, who lives in the Father's embrace, has made the invisible God visible. Want to know what God is like? Look at Jesus. He is the exegesis of God — literally. The Greek word for 'declared' is exēgēsato — He 'exegeted' God. Explained God. Made God readable. The Son is God's self-interpretation.",
      "crossRefs": [
        {"ref": "Exodus 33:20", "explanation": "God told Moses: 'You cannot see My face, for no man shall see Me and live.' John 1:18 affirms this — then says the Son makes it possible anyway. Not by showing God's raw glory, but by translating it into flesh."},
        {"ref": "John 14:9", "explanation": "Jesus says to Philip: 'He who has seen Me has seen the Father.' The direct fulfillment of verse 18. The Son makes the Father visible."},
        {"ref": "Hebrews 1:3", "explanation": "'The Son is the radiance of God's glory and the exact representation (charaktēr) of His being.' Same theology — the Son IS what God looks like."},
        {"ref": "Colossians 1:15", "explanation": "'He is the image (eikōn) of the invisible God.' The invisible made visible. That's John 1:18 in one phrase."}
      ],
      "words": [
        {
          "english": "No one has seen God at any time",
          "original": "Θεὸν οὐδεὶς ἑώρακεν πώποτε",
          "transliteration": "Theon oudeis heōraken pōpote",
          "pronunciation": "theh-ON oo-DAYS heh-OH-rah-ken POH-po-teh",
          "strongs": "G2316, G3762, G3708, G4455",
          "partOfSpeech": "noun + pronoun + verb perfect + adverb",
          "literalMeaning": "God no one has seen ever",
          "definition": "Theon comes FIRST for emphasis — GOD, no one has seen. Heōraken — perfect tense of horaō — to see. Perfect tense: no one has seen God AND CONTINUES IN THAT STATE of having seen Him. No human being has ever had direct, unmediated visual access to God's essential being. Moses saw a manifestation. Isaiah saw a vision. But the raw, unfiltered essence of God? No human eyes have processed that. Pōpote — at any time, ever. Total negation. Not 'rarely' or 'almost never.' NEVER. This sets up the astounding claim that follows: no one has seen God... EXCEPT one person can show you.",
          "translationNote": "Accurately translated. The emphasis on 'God' being first in the Greek sentence is lost in English word order.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "The only begotten Son",
          "original": "μονογενὴς θεὸς",
          "transliteration": "monogenēs theos",
          "pronunciation": "mo-no-gheh-NAYS theh-OS",
          "strongs": "G3439, G2316",
          "partOfSpeech": "adjective + noun",
          "literalMeaning": "the unique/one-of-a-kind God",
          "definition": "MAJOR textual issue here. The earliest and best manuscripts (P66, P75, Codex Sinaiticus, Codex Vaticanus) read monogenēs THEOS — 'the unique God' or 'the one-of-a-kind God.' Later manuscripts changed this to monogenēs HUIOS — 'the only begotten Son.' The difference is enormous. The original reading calls Jesus monogenēs THEOS — the unique God. Not just the unique Son. GOD. This is the strongest declaration of Christ's deity in the entire prologue. Scribes likely changed theos to huios because calling Jesus 'the unique God' felt too bold, or to harmonize with John 3:16 which uses monogenēs huios. But the harder reading (theos) is almost certainly original — scribes don't make texts MORE provocative, they soften them.",
          "translationNote": "Most English translations follow the later manuscripts and read 'only begotten Son.' The oldest manuscripts read 'the unique God' (monogenēs theos). The NIV gets close with 'the one and only Son, who is himself God.' But the original text is more direct: the one-of-a-kind God. The Son IS God. Full stop.",
          "twisted": true,
          "twistedExplanation": "This is one of the most significant textual variants in the entire New Testament. The earliest manuscripts call Jesus 'the unique GOD' (monogenēs theos). Later scribes changed it to 'the only begotten SON' (monogenēs huios) — probably because 'unique God' was too theologically intense. Most English translations follow the later, softer reading. The original reading makes the strongest possible claim: the one who explains God IS God. The KJV's 'only begotten Son' is based on inferior manuscripts AND mistranslates monogenēs (see verse 14 notes)."
        },
        {
          "english": "who is in the bosom of the Father",
          "original": "ὁ ὢν εἰς τὸν κόλπον τοῦ πατρός",
          "transliteration": "ho ōn eis ton kolpon tou patros",
          "pronunciation": "ho own ace ton KOL-pon too pah-TROHS",
          "strongs": "G3588, G5607, G1519, G2859, G3962",
          "partOfSpeech": "article + participle present + preposition + noun + noun genitive",
          "literalMeaning": "the one being into the chest/lap/embrace of the Father",
          "definition": "Ho ōn — 'the one BEING' — present participle of eimi. He IS (right now, continuously) in the Father's embrace. Not 'was' — IS. Even while on earth, even in flesh, the Son never left the Father's intimate presence. Kolpon — bosom, chest, lap. The place of closest intimacy. In ancient dining, the closest friend reclined next to you with their head near your chest (John 13:23 — the beloved disciple was 'in the bosom' of Jesus at the Last Supper). This is not just proximity. This is the deepest possible intimacy. Face-to-face (pros ton theon, v.1) and chest-to-chest (eis ton kolpon). The Son knows the Father not from observation but from embrace.",
          "translationNote": "'Bosom' is archaic but captures kolpon's intimacy. 'Embrace' or 'closest side' would be more natural in modern English. The point is extreme closeness — the Son is as close to the Father as physically possible.",
          "twisted": false,
          "twistedExplanation": null
        },
        {
          "english": "He has declared Him",
          "original": "ἐκεῖνος ἐξηγήσατο",
          "transliteration": "ekeinos exēgēsato",
          "pronunciation": "eh-KAY-nos ex-ay-GAY-sah-toh",
          "strongs": "G1565, G1834",
          "partOfSpeech": "demonstrative pronoun + verb, aorist middle indicative",
          "literalMeaning": "that one has exegeted/explained/narrated/made known",
          "definition": "Exēgēsato — from exēgeomai — to lead out, to explain, to interpret, to narrate fully. THIS IS WHERE WE GET THE WORD 'EXEGESIS.' Exegesis is the careful interpretation and explanation of a text. John says Jesus EXEGETED God. Jesus is God's exegesis. Want to understand God? Read Jesus. He is the interpretation, the explanation, the full narration of who God is. No one has seen God — but the Son, from the Father's embrace, has made Him fully known. He translated the invisible into visible, the infinite into finite, the unknowable into knowable. He is the exegesis of God. The final word of the prologue is the thesis of the entire gospel: Jesus explains God.",
          "translationNote": "'Declared' is weak. 'Made known' (NIV) is better. But the real word is 'exegeted' — He interpreted God, explained God, narrated God. Jesus is God's self-explanation. The fact that our technical word for 'interpreting scripture' (exegesis) comes from the word John uses for what Jesus does with God is profound: the same careful attention we give to understanding a text is what Jesus does with the Father's nature. He reads God to us.",
          "twisted": true,
          "twistedExplanation": "'Declared' (KJV) and even 'made known' (NIV) understate exēgēsato. The word means to interpret, explain, narrate fully — to exegete. Jesus didn't just 'declare' God like making an announcement. He EXPLAINED God. He interpreted God into human language, human experience, human flesh. This is the thesis of John's gospel in one word, and most translations undersell it."
        }
      ]
    }
]
