{"book":"John","bookGreek":"Κατὰ Ἰωάννην","chapter":5,"author":"John, apostle, ~85-95 AD from Ephesus.","audience":"Greek-speaking believers in Asia Minor.","historicalContext":"Jesus heals a lame man at the Pool of Bethesda on the Sabbath, igniting the first major conflict with Jewish authorities. The healing itself is brief; the lengthy discourse that follows (v.19-47) is Jesus' most extensive defense of His divine authority — claiming equality with the Father in giving life and executing judgment.","verses":[
{"verseNumber":1,"verseText":"After this there was a feast of the Jews; and Jesus went up to Jerusalem.","freshTranslation":"After this, there was a Jewish feast, and Jesus went up to Jerusalem.","historicalContext":"Which feast isn't specified — possibly Passover, Tabernacles, or Purim. 'Went up' is literal: Jerusalem sits at 2,500 feet elevation. You always go UP to Jerusalem, both geographically and spiritually.","crossRefs":[{"ref":"Psalm 122:1","explanation":"'I rejoiced with those who said to me, Let us go to the house of the LORD.'"}],"words":[{"english":"a feast","original":"ἑορτή","transliteration":"heortē","pronunciation":"heh-or-TAY","strongs":"G1859","partOfSpeech":"noun, nominative","literalMeaning":"feast, festival, holy day","definition":"Heortē refers to one of the Jewish pilgrimage festivals when Jews traveled to Jerusalem. The unspecified feast keeps the focus on what happens there rather than the calendar date.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":2,"verseText":"Now there is at Jerusalem by the sheep market a pool, which is called in the Hebrew tongue Bethesda, having five porches.","freshTranslation":"In Jerusalem near the Sheep Gate there is a pool called Bethesda in Hebrew, surrounded by five covered colonnades.","historicalContext":"Archaeologists discovered this exact pool in the 19th century near St. Anne's Church — two rectangular pools with five porticoes (four sides plus a divider), confirming John's precise description. Bethesda means 'House of Mercy' or 'House of Outpouring.' It was a gathering place for the sick and disabled.","crossRefs":[{"ref":"Nehemiah 3:1","explanation":"The Sheep Gate is mentioned in Nehemiah's description of Jerusalem's walls — near the northeast corner of the Temple Mount."}],"words":[{"english":"Bethesda","original":"Βηθεσδά","transliteration":"Bēthesda","pronunciation":"bay-thes-DAH","strongs":"G964","partOfSpeech":"proper noun, indeclinable","literalMeaning":"house of mercy/grace, house of outpouring","definition":"From Hebrew beth (house) + chesed (mercy/lovingkindness) or eshdah (outpouring). The name is ironic — this 'House of Mercy' held people who had waited decades without mercy. Jesus brings true mercy to a place named for it.","translationNote":"KJV 'Bethesda' is correct. Some manuscripts read 'Bethzatha' or 'Bethsaida' but Bethesda has the best attestation.","twisted":false,"twistedExplanation":null},{"english":"five porches","original":"πέντε στοάς","transliteration":"pente stoas","pronunciation":"PEN-teh sto-AS","strongs":"G4002, G4745","partOfSpeech":"numeral + noun","literalMeaning":"five roofed colonnades/porticoes","definition":"Stoa means a covered colonnade or walkway providing shade. Five porticoes around two pools — archaeologically confirmed. The detail demonstrates John's firsthand knowledge of pre-70 AD Jerusalem, supporting early authorship.","translationNote":"KJV 'porches' is slightly misleading. These were large covered walkways, not porches on houses.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":3,"verseText":"In these lay a great multitude of impotent folk, of blind, halt, and withered, waiting for the moving of the water.","freshTranslation":"Under these colonnades lay crowds of disabled people — blind, lame, and paralyzed — waiting for the water to stir.","historicalContext":"A scene of concentrated human suffering. These people had no other options — no hospitals, no social services. They gathered at a pool rumored to have healing properties when the water stirred (possibly from an intermittent spring). The five porticoes sheltered a community of desperate, forgotten people.","crossRefs":[],"words":[{"english":"impotent folk","original":"ἀσθενούντων","transliteration":"asthenountōn","pronunciation":"as-then-OON-tone","strongs":"G770","partOfSpeech":"verb, present active participle, genitive plural","literalMeaning":"the ones being weak, sick, without strength","definition":"Astheneō means to be weak, sick, powerless — from a (without) + sthenos (strength). The present participle indicates an ongoing condition. These weren't temporarily ill — they were chronically disabled, many for decades.","translationNote":"KJV 'impotent folk' is archaic. Modern: 'disabled' or 'sick.'","twisted":false,"twistedExplanation":null}]},
{"verseNumber":4,"verseText":"For an angel went down at a certain season into the pool, and troubled the water: whosoever then first after the troubling of the water stepped in was made whole of whatsoever disease he had.","freshTranslation":"[This verse is not found in the earliest and most reliable manuscripts. It was likely added later to explain the belief about the stirring water.]","historicalContext":"Most modern scholars and translations note that verse 4 is absent from the earliest Greek manuscripts (P66, P75, Sinaiticus, Vaticanus). It was likely a scribal addition explaining the popular belief about the pool. The intermittent spring beneath the pool may have caused periodic bubbling, which people attributed to angelic activity.","crossRefs":[],"words":[{"english":"[Textual Note]","original":"[Not in earliest manuscripts]","transliteration":"","pronunciation":"","strongs":"","partOfSpeech":"","literalMeaning":"","definition":"This verse appears in later manuscripts but is absent from the oldest and most reliable ones. Most modern translations either omit it or bracket it with a footnote. The belief in angelic stirring of the water was a folk tradition, not necessarily endorsed by John.","translationNote":"This verse is a later scribal addition. Its inclusion in the KJV reflects the Textus Receptus manuscript tradition rather than the earliest evidence.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":5,"verseText":"And a certain man was there, which had an infirmity thirty and eight years.","freshTranslation":"One man there had been disabled for thirty-eight years.","historicalContext":"Thirty-eight years — nearly a lifetime in the ancient world. This number may echo Israel's 38 years of wandering after Kadesh-Barnea (Deuteronomy 2:14). Just as Israel was stuck in the wilderness unable to enter the Promised Land, this man is stuck at the pool unable to enter the healing water. Jesus will do for him what he cannot do for himself.","crossRefs":[{"ref":"Deuteronomy 2:14","explanation":"'Thirty-eight years passed from Kadesh-Barnea until we crossed the Zered Valley.' Israel's 38-year paralysis in the wilderness mirrors this man's condition."}],"words":[{"english":"thirty and eight years","original":"τριάκοντα καὶ ὀκτὼ ἔτη","transliteration":"triakonta kai oktō etē","pronunciation":"tree-AH-kon-tah kai ok-TOH ET-ay","strongs":"G5144, G3638, G2094","partOfSpeech":"numerals + noun","literalMeaning":"thirty and eight years","definition":"An extraordinarily long time to be disabled — most of his adult life. The number emphasizes the hopelessness of his condition and the magnitude of Jesus' healing. No human remedy had worked for 38 years.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":6,"verseText":"When Jesus saw him lie, and knew that he had been now a long time in that case, he saith unto him, Wilt thou be made whole?","freshTranslation":"When Jesus saw him lying there and learned he had been in this condition for a long time, He asked him, 'Do you want to get well?'","historicalContext":"Jesus seeks this man out — among the 'great multitude' of sick people, He chooses one. The question seems obvious (of course he wants to be healed!), but it's penetrating. After 38 years, illness becomes identity. Some people become so defined by their condition that wellness is frightening. Jesus asks him to declare his desire before acting.","crossRefs":[{"ref":"Mark 10:51","explanation":"Jesus asked blind Bartimaeus the same kind of question: 'What do you want me to do for you?' He makes people articulate their need."}],"words":[{"english":"Wilt thou be made whole?","original":"Θέλεις ὑγιὴς γενέσθαι;","transliteration":"Theleis hygiēs genesthai?","pronunciation":"THEL-ays hoo-ghee-AYS gen-ES-thai","strongs":"G2309, G5199, G1096","partOfSpeech":"verb + adjective + verb","literalMeaning":"Do you want/desire to become healthy/whole?","definition":"Thelō (to will, desire) + hygiēs (healthy, whole, sound — root of 'hygiene') + ginomai (to become). Jesus asks about his will — his desire, his intention. Hygiēs means complete wholeness, not just absence of disease. Jesus offers total restoration, not just symptom relief.","translationNote":"KJV 'made whole' is excellent — better than modern 'get well' because hygiēs implies complete wholeness, not just physical healing.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":7,"verseText":"The impotent man answered him, Sir, I have no man, when the water is troubled, to put me into the pool: but while I am coming, another steppeth down before me.","freshTranslation":"The disabled man answered, 'Sir, I have no one to put me in the pool when the water is stirred. While I'm trying to get there, someone else gets in ahead of me.'","historicalContext":"His answer reveals his situation: he's alone, unable to move quickly, and has been beaten to the water every time for years. He's answering the wrong question — Jesus asked 'Do you want to be well?' and he explains why the pool system doesn't work for him. He's still thinking about the old remedy. Jesus is about to show him a completely different one.","crossRefs":[],"words":[{"english":"I have no man","original":"ἄνθρωπον οὐκ ἔχω","transliteration":"anthrōpon ouk echō","pronunciation":"AN-thro-pon ook EKH-oh","strongs":"G444, G2192","partOfSpeech":"noun + verb","literalMeaning":"a person/human I do not have","definition":"The pathos of this statement: 'I have no one.' Thirty-eight years of disability and complete isolation. No family, no friend, no helper. The man who has no anthrōpos (human) is about to receive help from the Son of anthrōpos (the Son of Man).","translationNote":"Accurate. The loneliness embedded in this statement is heartbreaking.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":8,"verseText":"Jesus saith unto him, Rise, take up thy bed, and walk.","freshTranslation":"Jesus said to him, 'Get up. Pick up your mat and walk.'","historicalContext":"Three imperatives — get up, pick up, walk. No ritual, no prayer, no touching the water. Just a command. Jesus doesn't help him INTO the pool; He makes the pool irrelevant. The command to carry his mat is deliberately provocative — carrying objects on the Sabbath was forbidden by the oral law, which will ignite the controversy in v.10.","crossRefs":[{"ref":"Mark 2:11","explanation":"Jesus gives identical commands to the paralytic lowered through the roof: 'Get up, take your mat and go home.' Same authority, same result."},{"ref":"Acts 3:6","explanation":"Peter at the temple gate: 'In the name of Jesus Christ of Nazareth, walk.' The apostles continue what Jesus started."}],"words":[{"english":"Rise","original":"Ἔγειρε","transliteration":"Egeire","pronunciation":"EG-ay-reh","strongs":"G1453","partOfSpeech":"verb, present active imperative","literalMeaning":"rise up, get up, be raised","definition":"Egeirō — the same word used for resurrection. 'Rise' from a mat prefigures rising from the dead. When Jesus says 'get up,' things that were dead come alive. The present imperative means 'start rising now.'","translationNote":"Accurate. The resurrection overtone is intentional.","twisted":false,"twistedExplanation":null},{"english":"take up thy bed","original":"ἆρον τὸν κράβαττόν σου","transliteration":"aron ton krabatton sou","pronunciation":"AH-ron ton KRAH-bat-ton soo","strongs":"G142, G2895","partOfSpeech":"verb + noun","literalMeaning":"lift up your pallet/mat","definition":"Krabattos was a poor man's sleeping mat — a thin pad that could be rolled up and carried. Jesus tells him to carry what used to carry him. The bed that was his prison becomes his testimony. This also deliberately violates the Sabbath carrying prohibition, forcing a public confrontation.","translationNote":"KJV 'bed' is too generous. This was a thin straw mat — the bed of the poorest of the poor.","twisted":false,"twistedExplanation":null},{"english":"walk","original":"περιπάτει","transliteration":"peripatei","pronunciation":"per-ee-PAH-tay","strongs":"G4043","partOfSpeech":"verb, present active imperative","literalMeaning":"walk around, move about, live","definition":"Peripateō means to walk around — but in Jewish/Christian usage it also means 'to conduct one's life.' Jesus isn't just saying 'move your legs' — He's saying 'go live your life.' After 38 years of lying down, start walking through the world.","translationNote":"Accurate. The double meaning (physical walking + living one's life) is present in both Greek and English.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":9,"verseText":"And immediately the man was made whole, and took up his bed, and walked: and on the same day was the sabbath.","freshTranslation":"Instantly the man was healed. He picked up his mat and walked. Now that day was a Sabbath.","historicalContext":"'Immediately' — 38 years of paralysis ended in a second. John drops the Sabbath detail at the end like a bomb: 'oh, and by the way, this was a Sabbath.' Everything that follows — the interrogation, the persecution, Jesus' massive discourse — flows from this one fact. Jesus deliberately chose to heal on the Sabbath to force the question of His authority.","crossRefs":[{"ref":"Mark 3:4","explanation":"Jesus asked: 'Which is lawful on the Sabbath: to do good or to do evil, to save life or to kill?' He consistently challenged Sabbath legalism."}],"words":[{"english":"immediately","original":"εὐθέως","transliteration":"eutheōs","pronunciation":"yoo-THEH-ohs","strongs":"G2112","partOfSpeech":"adverb","literalMeaning":"immediately, at once, straight away","definition":"Eutheōs marks instantaneous healing — no recovery period, no gradual improvement. 38 years of atrophied muscles instantly restored. This is creation-level power: the Word who made human bodies in the beginning remakes one in a moment.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null},{"english":"the sabbath","original":"σάββατον","transliteration":"sabbaton","pronunciation":"SAB-bah-ton","strongs":"G4521","partOfSpeech":"noun, nominative","literalMeaning":"sabbath, day of rest","definition":"From Hebrew shabbat (to cease, rest). The Sabbath was the most sacred institution in Judaism — violation was theoretically punishable by death (Exodus 31:14). By healing and commanding mat-carrying on the Sabbath, Jesus forces a confrontation about His authority over God's own institution.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":10,"verseText":"The Jews therefore said unto him that was cured, It is the sabbath day: it is not lawful for thee to carry thy bed.","freshTranslation":"So the Jewish leaders said to the healed man, 'It is the Sabbath — it is not lawful for you to carry your mat.'","historicalContext":"The authorities notice the mat first, not the miracle. A man who hasn't walked in 38 years is on his feet, and their concern is the mat. This perfectly illustrates Jesus' later critique: they strain out gnats and swallow camels. The prohibition on carrying objects on the Sabbath came from the Mishnah's interpretation of Jeremiah 17:21, not directly from Moses.","crossRefs":[{"ref":"Jeremiah 17:21","explanation":"'Do not carry a load on the Sabbath day.' The scriptural basis for the carrying prohibition, though the oral law expanded it far beyond Jeremiah's intent."}],"words":[{"english":"it is not lawful","original":"οὐκ ἔξεστίν","transliteration":"ouk exestin","pronunciation":"ook EX-es-tin","strongs":"G1832","partOfSpeech":"verb, impersonal","literalMeaning":"it is not permitted, it is not lawful","definition":"Exesti means 'it is permitted/lawful.' With ouk (not), it becomes a legal prohibition. They cite the oral law tradition about Sabbath carrying, treating rabbinical interpretation as having the force of divine command. They can't see the miracle for the regulation.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":11,"verseText":"He answered them, He that made me whole, the same said unto me, Take up thy bed, and walk.","freshTranslation":"He replied, 'The man who healed me told me, Pick up your mat and walk.'","historicalContext":"Simple, devastating logic: the One powerful enough to heal a 38-year disability has more authority than your Sabbath rules. If He commands me to carry, I carry. The healed man instinctively recognizes that miraculous healing power trumps rabbinical regulations.","crossRefs":[],"words":[{"english":"He that made me whole","original":"Ὁ ποιήσας με ὑγιῆ","transliteration":"Ho poiēsas me hygiē","pronunciation":"ho poy-AY-sas meh hoo-ghee-AY","strongs":"G4160, G5199","partOfSpeech":"participle + adjective","literalMeaning":"the one having made me healthy/whole","definition":"Poieō (to make, create) + hygiēs (whole, healthy). The man's defense is simple: whoever has the power to CREATE wholeness has the authority to define how I respond. Maker outranks regulator.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":12,"verseText":"Then asked they him, What man is that which said unto thee, Take up thy bed, and walk?","freshTranslation":"They asked him, 'Who is this man who told you to pick it up and walk?'","historicalContext":"Notice: they don't ask 'Who healed you?' They ask 'Who told you to carry?' They're building a legal case, not investigating a miracle. Their focus reveals their priorities — the violation matters more than the healing.","crossRefs":[],"words":[{"english":"What man","original":"Τίς ἐστιν ὁ ἄνθρωπος","transliteration":"Tis estin ho anthrōpos","pronunciation":"tis ES-tin ho AN-thro-pos","strongs":"G5101, G444","partOfSpeech":"pronoun + noun","literalMeaning":"Who is the man/person","definition":"They call Jesus 'the man' (ho anthrōpos) — reducing Him to a mere human who violated their rules. They don't yet know it's Jesus, and they're already framing Him as a lawbreaker rather than a healer.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":13,"verseText":"And he that was healed wist not who it was: for Jesus had conveyed himself away, a multitude being in that place.","freshTranslation":"But the man who was healed didn't know who it was, because Jesus had slipped away into the crowd.","historicalContext":"Jesus heals and disappears — no credit-seeking, no public display. He slipped away (exeneusen — literally 'swam out,' like turning one's head to escape) into the crowd. The man was healed by someone whose name he didn't even know.","crossRefs":[],"words":[{"english":"conveyed himself away","original":"ἐξένευσεν","transliteration":"exeneusen","pronunciation":"ex-EN-yoo-sen","strongs":"G1593","partOfSpeech":"verb, aorist active indicative","literalMeaning":"turned aside, slipped away, withdrew","definition":"Exneuō means to turn aside, to dodge, to slip away — a vivid verb suggesting Jesus deliberately melted into the crowd. He performed the miracle and vanished, avoiding the kind of sign-seeking crowd enthusiasm He warned about in chapter 2.","translationNote":"KJV 'conveyed himself away' is awkward. The Greek is more dynamic — He ducked out, slipped away, dodged.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":14,"verseText":"Afterward Jesus findeth him in the temple, and said unto him, Behold, thou art made whole: sin no more, lest a worse thing come unto thee.","freshTranslation":"Later Jesus found him in the temple and said, 'Look, you have been made well. Stop sinning, or something worse may happen to you.'","historicalContext":"Jesus seeks the man out again — this time in the temple, where the healed man may have gone to give thanks. The warning 'sin no more' doesn't mean his disability was caused by his sin (see 9:3), but that spiritual sickness is worse than physical. A 'worse thing' than 38 years of paralysis — that's a sobering warning about the consequences of rejecting God.","crossRefs":[{"ref":"John 9:3","explanation":"In the next healing, Jesus explicitly says the man's blindness was NOT caused by sin. Disability and sin don't have a 1:1 correlation."},{"ref":"John 8:11","explanation":"To the woman caught in adultery: 'Go, and sin no more.' Same command — Jesus pairs mercy with the call to change."}],"words":[{"english":"sin no more","original":"μηκέτι ἁμάρτανε","transliteration":"mēketi hamartane","pronunciation":"may-KET-ee hah-mar-TAH-neh","strongs":"G3371, G264","partOfSpeech":"adverb + verb, present active imperative","literalMeaning":"no longer sin/miss the mark","definition":"Mēketi (no longer, not anymore) + hamartanō (to sin, miss the mark — from archery, missing the target). The present imperative means 'stop the ongoing practice of sinning.' Jesus pairs physical healing with a call to spiritual transformation. Wholeness of body demands wholeness of life.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":15,"verseText":"The man departed, and told the Jews that it was Jesus, which had made him whole.","freshTranslation":"The man went and told the Jewish leaders that it was Jesus who had healed him.","historicalContext":"The man reports Jesus to the authorities — whether from gratitude, naivety, or pressure is unclear. This identification triggers the persecution. The irony: the man Jesus healed becomes the informant who launches the case against Him.","crossRefs":[],"words":[{"english":"told the Jews","original":"ἀνήγγειλεν τοῖς Ἰουδαίοις","transliteration":"anēngeilen tois Ioudaiois","pronunciation":"an-AYN-gay-len toys ee-oo-DYE-oys","strongs":"G312, G2453","partOfSpeech":"verb + noun","literalMeaning":"reported/announced to the Jewish leaders","definition":"Anangellō means to report, announce, declare. Ioudaioi in John often means specifically the Jewish religious authorities (the Sanhedrin and their associates), not Jewish people generally. The man reports to the establishment — the very people who questioned him about the mat.","translationNote":"'Jews' in John usually means 'Jewish leaders/authorities' — not the general population. Many translations now clarify this.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":16,"verseText":"And therefore did the Jews persecute Jesus, and sought to slay him, because he had done these things on the sabbath day.","freshTranslation":"Because of this, the Jewish leaders began persecuting Jesus — they even sought to kill Him — because He was doing these things on the Sabbath.","historicalContext":"The first mention of a death plot against Jesus in John's gospel. Healing on the Sabbath was the trigger, but the real issue (as v.18 reveals) is Jesus' claim to divine authority. The imperfect tense 'was doing' (epoiei) suggests an ongoing pattern of Sabbath activity, not just this one incident.","crossRefs":[{"ref":"John 7:1","explanation":"'The Jewish leaders were looking for a way to kill him.' The death threat continues throughout John."}],"words":[{"english":"persecute","original":"ἐδίωκον","transliteration":"ediōkon","pronunciation":"eh-DEE-oh-kon","strongs":"G1377","partOfSpeech":"verb, imperfect active indicative","literalMeaning":"were pursuing, were persecuting, were hunting","definition":"Diōkō means to pursue, chase, persecute — like hunting prey. The imperfect tense indicates ongoing, escalating persecution. This wasn't a one-time confrontation but the beginning of a sustained campaign against Jesus that would culminate at the cross.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null},{"english":"sought to slay him","original":"ἐζήτουν αὐτὸν ἀποκτεῖναι","transliteration":"ezētoun auton apokteinai","pronunciation":"eh-ZAY-toon ow-TON ah-pok-TAY-nai","strongs":"G2212, G615","partOfSpeech":"verb + verb, aorist infinitive","literalMeaning":"were seeking to kill him","definition":"Zēteō (to seek, search for) + apokteinō (to kill). They're actively plotting His death — not figuratively but literally. A Sabbath healing escalates to a murder plot. The disproportionate response reveals that the real issue isn't the Sabbath but Jesus' authority claims.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":17,"verseText":"But Jesus answered them, My Father worketh hitherto, and I work.","freshTranslation":"But Jesus answered them, 'My Father is still working, and I too am working.'","historicalContext":"Jesus' defense is not 'I didn't violate the Sabbath.' His defense is 'God works on the Sabbath, and so do I.' Jewish theology acknowledged that God continues sustaining creation on the Sabbath (babies are born, the sun rises). Jesus claims the same exemption — placing Himself in the same category as God. The phrase 'My Father' (not 'our Father') claims a unique filial relationship.","crossRefs":[{"ref":"John 10:30","explanation":"'I and the Father are one.' The same claim of divine identity that begins here continues throughout John."},{"ref":"John 14:10","explanation":"'The Father, living in me, does his work.' Jesus' works are the Father's works performed through the Son."}],"words":[{"english":"My Father","original":"Ὁ πατήρ μου","transliteration":"Ho patēr mou","pronunciation":"ho pah-TAYR moo","strongs":"G3962","partOfSpeech":"noun with possessive","literalMeaning":"the Father of me","definition":"Patēr (father) with the possessive mou (my). Jesus doesn't say 'our Father' (as in the Lord's Prayer) but 'MY Father' — claiming a unique, exclusive relationship. The Jewish leaders understood this perfectly, as v.18 shows: He was making Himself equal with God.","translationNote":"Accurate. The 'my' is the explosive word here — it claims unique sonship.","twisted":false,"twistedExplanation":null},{"english":"worketh... I work","original":"ἐργάζεται... κἀγὼ ἐργάζομαι","transliteration":"ergazetai... kagō ergazomai","pronunciation":"er-GAH-zeh-tai... kah-GO er-GAH-zo-mai","strongs":"G2038","partOfSpeech":"verb, present middle indicative (both)","literalMeaning":"is working... and I am working","definition":"Ergazomai — to work, to labor, to be active. Both present tense: the Father IS working (right now, continuously), and I AM working (in the same way, with the same authority). Jesus claims to work alongside God in the ongoing maintenance of creation — a claim to divine prerogative.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":18,"verseText":"Therefore the Jews sought the more to kill him, because he not only had broken the sabbath, but said also that God was his Father, making himself equal with God.","freshTranslation":"This made the Jewish leaders even more determined to kill Him. Not only was He breaking the Sabbath, but He was calling God His own Father, making Himself equal with God.","historicalContext":"John's editorial comment confirms what the authorities understood: calling God 'My Father' in this context was a claim to equality with God. They didn't misunderstand Jesus; they understood perfectly. The question was whether they would accept or reject the claim. They chose rejection and murder.","crossRefs":[{"ref":"Philippians 2:6","explanation":"Christ Jesus, 'who, being in very nature God, did not consider equality with God something to be grasped.' Paul affirms the equality Jesus claimed here."},{"ref":"John 10:33","explanation":"They later say explicitly: 'You, a mere man, claim to be God.' They always understood the claim."}],"words":[{"english":"making himself equal with God","original":"ἴσον ἑαυτὸν ποιῶν τῷ θεῷ","transliteration":"ison heauton poiōn tō theō","pronunciation":"EE-son heh-ow-TON poy-OHN to theh-OH","strongs":"G2470, G4160, G2316","partOfSpeech":"adjective + pronoun + participle + noun","literalMeaning":"equal himself making to God","definition":"Isos (equal, the same as) + heauton (himself) + poieō (making) + theō (God). This is the clearest possible statement: Jesus was making Himself EQUAL (isos) with God. Not similar, not close, not a representative — EQUAL. The authorities got the message. Modern attempts to deny Jesus claimed divinity must reckon with this verse.","translationNote":"Accurate. This is John's own interpretation, not a misunderstanding by the authorities.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":19,"verseText":"Then answered Jesus and said unto them, Verily, verily, I say unto you, The Son can do nothing of himself, but what he seeth the Father do: for what things soever he doeth, these also doeth the Son likewise.","freshTranslation":"Jesus responded, 'Truly, truly, I tell you — the Son can do nothing on His own. He only does what He sees the Father doing, because whatever the Father does, the Son also does.'","historicalContext":"Jesus doesn't back down from the equality claim — He deepens it. His defense sounds humble ('can do nothing of himself') but is actually the strongest possible claim: everything the Father does, the Son does. Complete functional equality. A son in the ancient world learned his father's trade by watching and imitating — Jesus claims to be doing exactly what He sees the Father do, in real time.","crossRefs":[{"ref":"John 14:9","explanation":"'Anyone who has seen me has seen the Father.' The Son's actions are the Father's actions made visible."}],"words":[{"english":"of himself","original":"ἀφ' ἑαυτοῦ","transliteration":"aph' heautou","pronunciation":"af heh-ow-TOO","strongs":"G1438","partOfSpeech":"preposition + reflexive pronoun","literalMeaning":"from himself, on his own initiative","definition":"Apo + heautou means independently, on his own. Jesus claims He never acts independently from the Father — not from inability but from perfect unity of will. He's not limited; He's aligned. The Son and Father are so united that independent action is impossible.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":20,"verseText":"For the Father loveth the Son, and sheweth him all things that himself doeth: and he will shew him greater works than these, that ye may marvel.","freshTranslation":"For the Father loves the Son and shows Him everything He does. And He will show Him even greater works than these, so that you will be amazed.","historicalContext":"Love is the basis of the Father-Son relationship: the Father SHOWS the Son everything because He loves Him. 'Greater works' than healing a lame man include raising the dead (v.21) and executing final judgment (v.22). The Bethesda healing was just the appetizer.","crossRefs":[{"ref":"John 14:12","explanation":"'Greater works than these will you do, because I am going to the Father.' The 'greater works' theme extends to believers."}],"words":[{"english":"loveth","original":"φιλεῖ","transliteration":"philei","pronunciation":"fil-AY","strongs":"G5368","partOfSpeech":"verb, present active indicative","literalMeaning":"loves with affection, cherishes","definition":"Phileō — affectionate, personal love (different from agapaō used in 3:16). This is intimate family love — the Father cherishes the Son with deep personal affection, not just principled love. The present tense means this love is constant and ongoing.","translationNote":"Accurate. The use of phileō (affectionate love) rather than agapaō (principled love) emphasizes the warmth of the Father-Son relationship.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":21,"verseText":"For as the Father raiseth up the dead, and quickeneth them; even so the Son quickeneth whom he will.","freshTranslation":"For just as the Father raises the dead and gives them life, so the Son also gives life to whomever He chooses.","historicalContext":"Only God can raise the dead and give life — this was a fundamental Jewish belief (Deuteronomy 32:39, 1 Samuel 2:6). Jesus claims this power for Himself: 'the Son gives life to whomever He chooses.' This is a divine prerogative exercised with sovereign freedom ('whom he will'). It will be demonstrated literally when Jesus raises Lazarus in chapter 11.","crossRefs":[{"ref":"Deuteronomy 32:39","explanation":"'I put to death and I bring to life.' God alone has power over life and death — now Jesus claims the same."},{"ref":"John 11:25","explanation":"'I am the resurrection and the life.' Jesus demonstrates this claim by raising Lazarus from the dead."}],"words":[{"english":"quickeneth / gives life","original":"ζωοποιεῖ","transliteration":"zōopoiei","pronunciation":"zo-op-oy-AY","strongs":"G2227","partOfSpeech":"verb, present active indicative","literalMeaning":"makes alive, gives life","definition":"Zōopoieō — from zōē (life) + poieō (to make). To make alive, to give life. This is creation-level power: generating life where there was death. Both the Father and Son possess this power, and the Son exercises it with sovereign freedom — 'whom he will.'","translationNote":"KJV 'quickeneth' is archaic English for 'makes alive.' Modern: 'gives life to.'","twisted":false,"twistedExplanation":null}]},
{"verseNumber":22,"verseText":"For the Father judgeth no man, but hath committed all judgment unto the Son:","freshTranslation":"Moreover, the Father judges no one but has entrusted all judgment to the Son,","historicalContext":"Another divine prerogative transferred: judgment. The Old Testament consistently presents God as the ultimate judge (Genesis 18:25, Psalm 96:13). Now Jesus says the Father has delegated ALL judgment to the Son. This isn't temporary or partial — it's comprehensive. The Son judges humanity on behalf of the Father.","crossRefs":[{"ref":"Acts 17:31","explanation":"'He has set a day when he will judge the world with justice by the man he has appointed.' Paul confirms Jesus as the appointed judge."},{"ref":"2 Corinthians 5:10","explanation":"'We must all appear before the judgment seat of Christ.' Christ is the judge."}],"words":[{"english":"all judgment","original":"τὴν κρίσιν πᾶσαν","transliteration":"tēn krisin pasan","pronunciation":"tayn KREE-sin PAH-san","strongs":"G2920, G3956","partOfSpeech":"noun + adjective","literalMeaning":"the judgment all/every","definition":"Krisis (judgment, decision, verdict) + pasan (all, every, total). Not some judgment — ALL judgment. Every evaluation of every human life throughout all of history is entrusted to the Son. This is the most comprehensive delegation of divine authority imaginable.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":23,"verseText":"That all men should honour the Son, even as they honour the Father. He that honoureth not the Son honoureth not the Father which hath sent him.","freshTranslation":"— so that all may honor the Son just as they honor the Father. Whoever does not honor the Son does not honor the Father who sent Him.","historicalContext":"The purpose of delegated judgment: equal honor. The Son is to receive the SAME honor as the Father — not less, not similar, but identical (kathōs — 'just as, in the same way'). Refusing to honor the Son is refusing to honor the Father. This eliminates any form of 'God yes, Jesus no' religion.","crossRefs":[{"ref":"Philippians 2:10-11","explanation":"'At the name of Jesus every knee should bow... and every tongue acknowledge that Jesus Christ is Lord.' Universal honor for the Son."}],"words":[{"english":"even as / just as","original":"καθώς","transliteration":"kathōs","pronunciation":"kah-THOHS","strongs":"G2531","partOfSpeech":"conjunction/adverb","literalMeaning":"just as, in the same way as, to the same degree","definition":"Kathōs means 'in exactly the same manner as' — not approximately, not similarly, but identically. The honor due to the Son is EQUAL to the honor due to the Father. This is either the most arrogant statement ever made or the most truthful.","translationNote":"Accurate. 'Even as' captures the precise equality.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":24,"verseText":"Verily, verily, I say unto you, He that heareth my word, and believeth on him that sent me, hath everlasting life, and shall not come into condemnation; but is passed from death unto life.","freshTranslation":"Truly, truly, I tell you — whoever hears my word and believes the One who sent me has eternal life and will not face judgment but has crossed over from death to life.","historicalContext":"One of the most important promises in the Bible. Three present-tense realities for the believer: (1) HAS eternal life (now, not just future), (2) will NOT come into judgment (settled, guaranteed), (3) HAS PASSED from death to life (completed transfer, past tense). Salvation isn't waiting — it's already happened.","crossRefs":[{"ref":"1 John 3:14","explanation":"'We know that we have passed from death to life, because we love each other.'"},{"ref":"Romans 8:1","explanation":"'There is now no condemnation for those who are in Christ Jesus.'"}],"words":[{"english":"is passed from death unto life","original":"μεταβέβηκεν ἐκ τοῦ θανάτου εἰς τὴν ζωήν","transliteration":"metabebēken ek tou thanatou eis tēn zōēn","pronunciation":"meh-tah-BEB-ay-ken ek too THAN-ah-too ays tayn zo-AYN","strongs":"G3327, G2288, G2222","partOfSpeech":"verb, perfect active indicative + nouns","literalMeaning":"has crossed over/transferred from the death into the life","definition":"Metabainō (to cross over, transfer from one state to another) in the perfect tense — has crossed and remains crossed. It's a completed, permanent transfer. Like crossing a river: once you're on the other side, you're on the other side. The believer has already moved from the realm of death into the realm of life.","translationNote":"'Is passed' captures the perfect tense well — it's a done deal, not a process.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":25,"verseText":"Verily, verily, I say unto you, The hour is coming, and now is, when the dead shall hear the voice of the Son of God: and they that hear shall live.","freshTranslation":"Truly, truly, I tell you — a time is coming, and has now arrived, when the dead will hear the voice of the Son of God, and those who hear will live.","historicalContext":"'Is coming AND now is' — both future resurrection AND present spiritual resurrection. The spiritually dead hear Jesus' voice NOW and come alive (spiritual resurrection). The physically dead will hear His voice at the final resurrection (v.28-29). Jesus claims the power to give life through His voice alone — the Logos speaks, and the dead arise.","crossRefs":[{"ref":"Ephesians 2:1","explanation":"'You were dead in your transgressions and sins.' Spiritual death is the present reality Jesus' voice overcomes."},{"ref":"John 11:43","explanation":"'Lazarus, come out!' A literal demonstration of the dead hearing Jesus' voice and living."}],"words":[{"english":"the dead shall hear the voice","original":"οἱ νεκροὶ ἀκούσουσιν τῆς φωνῆς","transliteration":"hoi nekroi akousousin tēs phōnēs","pronunciation":"hoy nek-ROY ah-KOO-soo-sin tays fo-NAYS","strongs":"G3498, G191, G5456","partOfSpeech":"adjective + verb + noun","literalMeaning":"the dead ones will hear the voice/sound","definition":"Nekroi (dead ones) + akouō (to hear, to understand, to obey) + phōnē (voice, sound). The dead hearing a voice is a paradox — dead people can't hear. But Jesus' voice has creative power that reaches even into death. When the Logos speaks, death itself must release its hold.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":26,"verseText":"For as the Father hath life in himself; so hath he given to the Son to have life in himself;","freshTranslation":"For just as the Father has life in Himself, so He has granted the Son to have life in Himself.","historicalContext":"Self-existent life — life that doesn't depend on an external source — is the most fundamental divine attribute. Everything else receives life FROM God; God has life IN Himself. Jesus claims the same: the Son has self-existent life. This is not created life but the same uncaused, self-generating life that belongs to God alone.","crossRefs":[{"ref":"John 1:4","explanation":"'In him was life.' The opening chapter already declared this — the Word contains life within Himself."},{"ref":"John 14:6","explanation":"'I am the way, the truth, and the LIFE.' Jesus doesn't just give life; He IS life."}],"words":[{"english":"life in himself","original":"ζωὴν ἐν ἑαυτῷ","transliteration":"zōēn en heautō","pronunciation":"zo-AYN en heh-ow-TOH","strongs":"G2222, G1438","partOfSpeech":"noun + preposition + pronoun","literalMeaning":"life in himself","definition":"Zōē en heautō — self-contained, self-generating life. This is the theological concept of aseity: God's life has no source outside Himself. He IS life. And Jesus claims the same attribute — not derived life but self-existent life, given (granted) by the Father in the eternal relationship of the Trinity.","translationNote":"Accurate. This is one of the highest Christological claims in the entire Bible.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":27,"verseText":"And hath given him authority to execute judgment also, because he is the Son of man.","freshTranslation":"And He has given Him authority to judge, because He is the Son of Man.","historicalContext":"The reason for Jesus' judicial authority: He is the Son of Man — Daniel 7:13-14's figure who receives universal dominion. The Son of Man title combines humanity (He can judge humans because He IS human) with divine authority (Daniel's figure receives everlasting kingdom). He judges not as a distant deity but as one who has lived the human experience.","crossRefs":[{"ref":"Daniel 7:13-14","explanation":"'One like a son of man... was given authority, glory and sovereign power; all nations and peoples of every language worshiped him.'"},{"ref":"Hebrews 4:15","explanation":"'We do not have a high priest who is unable to empathize with our weaknesses.' Jesus judges as one who understands human experience from the inside."}],"words":[{"english":"the Son of man","original":"υἱὸς ἀνθρώπου","transliteration":"huios anthrōpou","pronunciation":"hwee-OS an-THRO-poo","strongs":"G5207, G444","partOfSpeech":"noun phrase (anarthrous — without the article)","literalMeaning":"a son of man, a human one","definition":"Notably, the article is ABSENT here — it's 'a son of man' not 'THE Son of Man.' This may emphasize His genuine humanity: He has authority to judge because He shares in human nature. He's not an alien judge but one of us — qualified to judge humanity because He has been human.","translationNote":"The missing article is significant and usually not reflected in translation. Most versions add 'the' but the Greek leaves it out, emphasizing humanity.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":28,"verseText":"Marvel not at this: for the hour is coming, in the which all that are in the graves shall hear his voice,","freshTranslation":"Don't be amazed at this — for a time is coming when all who are in their graves will hear His voice,","historicalContext":"Now Jesus moves from spiritual resurrection (v.25 — 'and now is') to physical resurrection (no 'and now is' — purely future). EVERYONE in the graves — not some, all — will hear His voice. This is universal bodily resurrection, which even the Pharisees believed in (Acts 23:8), though they didn't expect it to come through a Galilean carpenter.","crossRefs":[{"ref":"1 Thessalonians 4:16","explanation":"'The Lord himself will come down from heaven, with a loud command... and the dead in Christ will rise first.'"},{"ref":"Daniel 12:2","explanation":"'Multitudes who sleep in the dust of the earth will awake — some to everlasting life, others to shame and everlasting contempt.'"}],"words":[{"english":"all that are in the graves","original":"πάντες οἱ ἐν τοῖς μνημείοις","transliteration":"pantes hoi en tois mnēmeiois","pronunciation":"PAN-tes hoy en toys mnay-MAY-oys","strongs":"G3956, G3419","partOfSpeech":"adjective + noun, dative plural","literalMeaning":"all those in the memorial tombs","definition":"Mnēmeion (tomb, memorial, grave — from mnēmē, memory). ALL who are in graves — every human who has ever died. No exceptions, no exclusions. The scope is universal. And they will respond to the voice (phōnē) of the Son of Man — the same creative voice that spoke the universe into existence.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":29,"verseText":"And shall come forth; they that have done good, unto the resurrection of life; and they that have done evil, unto the resurrection of damnation.","freshTranslation":"— and they will come out. Those who have done good will rise to live, and those who have done evil will rise to face judgment.","historicalContext":"Two resurrections, two destinies. This isn't salvation by works — the context of the entire discourse is about believing in the Son (v.24). The 'good' they have done is responding to God in faith; the 'evil' is rejecting the light (3:19-20). The final sorting reveals what was already true in life: those who trusted the Son have life; those who rejected Him face judgment.","crossRefs":[{"ref":"Daniel 12:2","explanation":"'Some to everlasting life, others to shame and everlasting contempt.' Jesus echoes Daniel almost verbatim."},{"ref":"Matthew 25:46","explanation":"'Then they will go away to eternal punishment, but the righteous to eternal life.'"}],"words":[{"english":"resurrection of life","original":"ἀνάστασιν ζωῆς","transliteration":"anastasin zōēs","pronunciation":"ah-NAS-tah-sin zo-AYS","strongs":"G386, G2222","partOfSpeech":"noun + noun, genitive","literalMeaning":"a standing up/rising of life","definition":"Anastasis (resurrection — from ana 'up' + histēmi 'to stand') + zōēs (of life). Resurrection characterized by LIFE — not just reanimation but entrance into the fullness of eternal life. The genitive 'of life' describes the quality and destination of this resurrection.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null},{"english":"resurrection of damnation/judgment","original":"ἀνάστασιν κρίσεως","transliteration":"anastasin kriseōs","pronunciation":"ah-NAS-tah-sin KREE-seh-ohs","strongs":"G386, G2920","partOfSpeech":"noun + noun, genitive","literalMeaning":"a standing up/rising of judgment","definition":"Anastasis kriseōs — resurrection characterized by judgment (krisis). Not 'damnation' (KJV's choice) but 'judgment' — evaluation, verdict, sentencing. Everyone rises; the question is what kind of resurrection you rise into.","translationNote":"KJV 'damnation' is too strong for krisis. The Greek means 'judgment/evaluation,' not automatic condemnation. Modern translations correctly use 'judgment.'","twisted":true,"twistedExplanation":"Krisis means judgment or evaluation, not damnation. The KJV's 'damnation' imports a verdict that the Greek word doesn't contain. It's a resurrection FOR judgment — the outcome of that judgment isn't specified by this word alone."}]},
{"verseNumber":30,"verseText":"I can of mine own self do nothing: as I hear, I judge: and my judgment is just; because I seek not mine own will, but the will of the Father which hath sent me.","freshTranslation":"By myself I can do nothing. I judge only as I hear, and my judgment is just, because I don't seek my own will but the will of the One who sent me.","historicalContext":"Jesus returns to the theme of v.19: complete dependence on and alignment with the Father. His judgment is perfect BECAUSE it's not His own — it's the Father's judgment flowing through Him. Perfect submission to the Father's will guarantees perfect justice. This is the model for all authority: power exercised in submission to a higher will.","crossRefs":[{"ref":"John 8:16","explanation":"'Even if I do judge, my decisions are true, because I am not alone. I stand with the Father who sent me.'"}],"words":[{"english":"my judgment is just","original":"ἡ κρίσις ἡ ἐμὴ δικαία ἐστίν","transliteration":"hē krisis hē emē dikaia estin","pronunciation":"hay KREE-sis hay em-AY dik-EYE-ah es-TIN","strongs":"G2920, G1342","partOfSpeech":"noun + adjective","literalMeaning":"the judgment the mine righteous/just is","definition":"Dikaia (just, righteous, fair) — from dikē (justice/right). Jesus' judgment is perfectly just because it perfectly reflects the Father's will. There's no bias, no corruption, no self-interest. Perfect alignment with the Father produces perfect justice.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":31,"verseText":"If I bear witness of myself, my witness is not true.","freshTranslation":"If I testify about myself, my testimony is not valid.","historicalContext":"Jewish law required two or three witnesses for valid testimony (Deuteronomy 19:15). Jesus acknowledges this principle — self-testimony alone is legally insufficient. He's about to present four witnesses: John the Baptist (v.33), His works (v.36), the Father (v.37), and the Scriptures (v.39).","crossRefs":[{"ref":"Deuteronomy 19:15","explanation":"'A matter must be established by the testimony of two or three witnesses.' The legal standard Jesus is addressing."}],"words":[{"english":"my witness is not true/valid","original":"ἡ μαρτυρία μου οὐκ ἔστιν ἀληθής","transliteration":"hē martyria mou ouk estin alēthēs","pronunciation":"hay mar-too-REE-ah moo ook ES-tin ah-lay-THAYS","strongs":"G3141, G227","partOfSpeech":"noun + adjective","literalMeaning":"the testimony of me not is true/valid","definition":"Martyria (testimony, witness — root of 'martyr') + alēthēs (true, genuine, valid). Jesus isn't saying His self-testimony is false — He's acknowledging it wouldn't be legally valid under Jewish law. He has other witnesses.","translationNote":"'True' can be misleading — Jesus isn't saying He'd lie about Himself. Alēthēs here means legally valid/admissible, not factually accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":32,"verseText":"There is another that beareth witness of me; and I know that the witness which he witnesseth of me is true.","freshTranslation":"There is another who testifies about me, and I know that His testimony about me is true.","historicalContext":"The 'another' is primarily the Father (v.37), though Jesus will first mention John the Baptist as a concession to human testimony. The Father's testimony is the ultimate validation — if God testifies, no additional witness is needed.","crossRefs":[],"words":[{"english":"another","original":"ἄλλος","transliteration":"allos","pronunciation":"AL-los","strongs":"G243","partOfSpeech":"adjective/pronoun","literalMeaning":"another of the same kind","definition":"Allos means another of the same type (as opposed to heteros, another of a different type). The 'another' who testifies is of the same nature as Jesus — the Father. A divine witness testifying about a divine Son.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":33,"verseText":"Ye sent unto John, and he bare witness unto the truth.","freshTranslation":"You sent a delegation to John, and he testified to the truth.","historicalContext":"Reference to John 1:19-27 when the Sanhedrin sent priests and Levites to question John the Baptist. John's testimony: Jesus is the Lamb of God, the one who baptizes with the Holy Spirit, the Son of God. The authorities sought John's testimony themselves — they can't now dismiss it.","crossRefs":[{"ref":"John 1:19-34","explanation":"The delegation's interview with John the Baptist, where he testified about Jesus' identity."}],"words":[{"english":"bare witness unto the truth","original":"μεμαρτύρηκεν τῇ ἀληθείᾳ","transliteration":"memartyrēken tē alētheia","pronunciation":"meh-mar-TOO-ray-ken tay ah-LAY-thay-ah","strongs":"G3140, G225","partOfSpeech":"verb, perfect active + noun, dative","literalMeaning":"has testified/witnessed to the truth","definition":"Perfect tense memartyrēken — John HAS testified and his testimony stands. Alētheia (truth) — John bore witness not just to Jesus but to THE truth. His testimony wasn't opinion; it was revelation.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":34,"verseText":"But I receive not testimony from man: but these things I say, that ye might be saved.","freshTranslation":"Not that I need human testimony — but I mention this so that you may be saved.","historicalContext":"Jesus doesn't NEED John's testimony to validate Himself — the Father's witness is sufficient. He mentions John as a concession to human weakness: since they sent a delegation to John, they should listen to what John said. His goal isn't winning an argument but saving them.","crossRefs":[],"words":[{"english":"that ye might be saved","original":"ἵνα ὑμεῖς σωθῆτε","transliteration":"hina hymeis sōthēte","pronunciation":"HEE-nah hoo-MAYS so-THAY-teh","strongs":"G2443, G4982","partOfSpeech":"conjunction + verb, aorist passive subjunctive","literalMeaning":"in order that you might be saved/rescued","definition":"Sōzō (to save, rescue, deliver) in the subjunctive — expressing purpose and possibility. Jesus' motive in presenting evidence isn't self-defense but their salvation. Even while they plot His murder, He's trying to save them. The love of 3:16 in action.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":35,"verseText":"He was a burning and a shining light: and ye were willing for a season to rejoice in his light.","freshTranslation":"John was a lamp that burned and gave light, and for a while you were happy to enjoy his light.","historicalContext":"Jesus calls John a 'lamp' (lychnos), not 'the light' (phōs). A lamp burns fuel and eventually goes out; the true Light (1:9) shines eternally. The authorities enjoyed John's popularity for a season — it was exciting, novel, even politically useful — but they weren't willing to follow where his testimony led: to Jesus.","crossRefs":[{"ref":"John 1:8","explanation":"'He was not the light, but came to bear witness about the light.' John the evangelist makes the same distinction."}],"words":[{"english":"a burning and a shining light/lamp","original":"ὁ λύχνος ὁ καιόμενος καὶ φαίνων","transliteration":"ho lychnos ho kaiomenos kai phainōn","pronunciation":"ho LOOKH-nos ho kai-OM-en-os kai FAI-known","strongs":"G3088, G2545, G5316","partOfSpeech":"noun + participles","literalMeaning":"the lamp the burning and shining","definition":"Lychnos is a lamp — a portable oil lamp, not the sun. It provides real light but is derivative and temporary. Kaiomenos (burning — consuming fuel) + phainōn (shining — giving light). John burned with prophetic fire and illuminated the darkness, but he was a lamp pointing to the Sun. Lamps are useful; they're not the source.","translationNote":"KJV 'light' is misleading — the Greek is lychnos (lamp), not phōs (light). Jesus is the phōs; John was a lychnos. The distinction matters.","twisted":true,"twistedExplanation":"Translating lychnos as 'light' blurs the distinction between John (a lamp) and Jesus (THE Light). John 1:8 explicitly says John was NOT the light. Calling him a 'light' here contradicts that. He was a lamp — derivative, temporary, pointing to the source."}]},
{"verseNumber":36,"verseText":"But I have greater witness than that of John: for the works which the Father hath given me to finish, the same works that I do, bear witness of me, that the Father hath sent me.","freshTranslation":"But I have a testimony weightier than John's. The very works the Father has given me to accomplish — the works I am doing — testify that the Father has sent me.","historicalContext":"Witness #2: Jesus' works (erga). The miracles, signs, and deeds Jesus performs are self-authenticating — they carry the Father's signature. The Bethesda healing is one such work. These works aren't just impressive feats; they're the Father's own actions performed through the Son, bearing the Father's unmistakable mark.","crossRefs":[{"ref":"John 10:25","explanation":"'The works I do in my Father's name testify about me.'"},{"ref":"John 14:11","explanation":"'Believe me when I say that I am in the Father and the Father is in me — or at least believe on the evidence of the works themselves.'"}],"words":[{"english":"the works","original":"τὰ ἔργα","transliteration":"ta erga","pronunciation":"tah ER-gah","strongs":"G2041","partOfSpeech":"noun, nominative neuter plural","literalMeaning":"the works, deeds, actions","definition":"Ergon (work, deed, action) — in John, Jesus' 'works' include miracles, signs, teachings, and ultimately His death and resurrection. They're not just impressive — they're the Father's own works done through the Son. They carry divine authentication that no human testimony can match.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":37,"verseText":"And the Father himself, which hath sent me, hath borne witness of me. Ye have neither heard his voice at any time, nor seen his shape.","freshTranslation":"And the Father who sent me has Himself testified about me. You have never heard His voice or seen His form.","historicalContext":"Witness #3: the Father Himself. But Jesus adds a stinging observation: they've never heard God's voice or seen His form. Despite being religious leaders devoted to God, they've never actually encountered Him. Their religion is secondhand — they know ABOUT God but don't know God. This is a devastating indictment of the religious establishment.","crossRefs":[{"ref":"Matthew 3:17","explanation":"At Jesus' baptism: 'This is my Son, whom I love; with him I am well pleased.' The Father DID speak — but they missed it."},{"ref":"Exodus 33:20","explanation":"'No one may see me and live.' Even Moses couldn't see God's face. The invisibility of God makes Jesus' visible revelation all the more significant."}],"words":[{"english":"his voice... his shape","original":"φωνὴν αὐτοῦ... εἶδος αὐτοῦ","transliteration":"phōnēn autou... eidos autou","pronunciation":"fo-NAYN ow-TOO... AY-dos ow-TOO","strongs":"G5456, G1491","partOfSpeech":"nouns, accusative","literalMeaning":"his voice/sound... his form/appearance","definition":"Phōnē (voice) and eidos (visible form, appearance). Two modes of divine self-revelation — auditory and visual — and the authorities have experienced neither. They study Scripture about God but have never encountered God. Jesus stands before them as God's voice AND God's visible form, and they can't see it.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":38,"verseText":"And ye have not his word abiding in you: for whom he hath sent, him ye believe not.","freshTranslation":"And you do not have His word living in you, because you do not believe the one He sent.","historicalContext":"The third indictment: God's word (logos) doesn't 'abide' (menō — dwell, remain, make its home) in them. They READ the word, study the word, memorize the word — but the word doesn't LIVE in them. The proof: they reject the person the word points to. If the word truly lived in them, it would lead them to Jesus.","crossRefs":[{"ref":"John 15:7","explanation":"'If you remain in me and my words remain in you, ask whatever you wish.' The word abiding is the mark of a true disciple."}],"words":[{"english":"abiding","original":"μένοντα","transliteration":"menonta","pronunciation":"MEN-on-tah","strongs":"G3306","partOfSpeech":"verb, present active participle","literalMeaning":"remaining, dwelling, staying","definition":"Menō — to remain, abide, dwell, make one's home. One of John's most important words (used 40 times in his gospel). God's word should LIVE in a person — not just be memorized or studied but deeply internalized, shaping thinking and action. Their rejection of Jesus proves the word hasn't made its home in them.","translationNote":"Accurate. 'Abiding' captures the deep, permanent indwelling.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":39,"verseText":"Search the scriptures; for in them ye think ye have eternal life: and they are they which testify of me.","freshTranslation":"You study the Scriptures diligently because you think that in them you possess eternal life. These are the very Scriptures that testify about me!","historicalContext":"Witness #4: the Scriptures themselves. This is devastating: the authorities devoted their lives to Scripture study, believing Torah knowledge was the path to eternal life. Jesus says: 'You're right that Scripture is the path — but you've missed the destination. The Scriptures point to ME, and you refuse to come to me.' The map is useless if you won't travel to the destination it shows.","crossRefs":[{"ref":"Luke 24:27","explanation":"'Beginning with Moses and all the Prophets, he explained to them what was said in all the Scriptures concerning himself.'"},{"ref":"2 Timothy 3:15","explanation":"'The Holy Scriptures, which are able to make you wise for salvation through faith in Christ Jesus.'"}],"words":[{"english":"Search the scriptures","original":"ἐραυνᾶτε τὰς γραφάς","transliteration":"eraunate tas graphas","pronunciation":"er-ow-NAH-teh tas grah-FAS","strongs":"G2045, G1124","partOfSpeech":"verb, present active (imperative or indicative) + noun","literalMeaning":"search/examine the writings","definition":"Eraunaō means to search carefully, to examine thoroughly, to investigate. It can be read as imperative ('Search the Scriptures!') or indicative ('You DO search the Scriptures'). The indicative fits better: Jesus acknowledges they're already diligent students. The problem isn't insufficient study — it's that their study misses its subject: Him.","translationNote":"The verb could be imperative (command) or indicative (statement). Context favors indicative — Jesus is observing their devotion to study, not commanding it.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":40,"verseText":"And ye will not come to me, that ye might have life.","freshTranslation":"— yet you refuse to come to me to receive life.","historicalContext":"The heart of the problem: not intellectual but volitional. They won't come. Not 'cannot' but 'will not' (ou thelete — you do not will/desire). They have the Scriptures, they have the testimony, they have the evidence — and they choose not to come. The barrier to salvation isn't information but will.","crossRefs":[{"ref":"Matthew 23:37","explanation":"'Jerusalem, Jerusalem... how often I have longed to gather your children together... but you were not willing.' Same anguish over willful rejection."}],"words":[{"english":"ye will not come","original":"οὐ θέλετε ἐλθεῖν","transliteration":"ou thelete elthein","pronunciation":"oo THEL-eh-teh el-THANE","strongs":"G2309, G2064","partOfSpeech":"verb + verb, aorist infinitive","literalMeaning":"you do not will/desire to come","definition":"Thelō (to will, desire, choose) + erchomai (to come). The negative ou thelete means 'you are unwilling' — it's a choice, not an inability. Jesus has presented four witnesses, offered eternal life, and they still won't come. The problem is hardened will, not insufficient evidence.","translationNote":"KJV 'will not' could sound like future tense ('you will not come'). The Greek is present tense: 'you are not willing to come.'","twisted":false,"twistedExplanation":null}]},
{"verseNumber":41,"verseText":"I receive not honour from men.","freshTranslation":"I don't accept glory from people.","historicalContext":"Jesus clarifies His motive: He's not seeking their approval or honor. He doesn't need their validation. This sets up the contrast in v.44: THEY seek honor from each other, which prevents them from believing.","crossRefs":[],"words":[{"english":"honour/glory","original":"δόξαν","transliteration":"doxan","pronunciation":"DOX-ahn","strongs":"G1391","partOfSpeech":"noun, accusative","literalMeaning":"glory, honor, praise, reputation","definition":"Doxa (glory, honor — root of 'doxology'). Jesus doesn't seek human glory because He already has the Father's glory (1:14, 17:5). Human honor is counterfeit compared to divine glory. His ministry isn't driven by crowd approval.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":42,"verseText":"But I know you, that ye have not the love of God in you.","freshTranslation":"But I know you — you don't have the love of God in your hearts.","historicalContext":"Jesus sees their hearts (as in 2:24-25). The fundamental diagnosis: they lack love for God. All their religion, study, and devotion is loveless. They love the system, the status, the knowledge — but not God Himself. Without love for God, they can't recognize God standing in front of them.","crossRefs":[{"ref":"1 John 4:8","explanation":"'Whoever does not love does not know God, because God is love.' Love for God is the prerequisite for knowing God."}],"words":[{"english":"the love of God","original":"τὴν ἀγάπην τοῦ θεοῦ","transliteration":"tēn agapēn tou theou","pronunciation":"tayn ah-GAH-payn too theh-OO","strongs":"G26, G2316","partOfSpeech":"noun + noun, genitive","literalMeaning":"the love of God","definition":"Agapē tou theou — ambiguous genitive: could mean 'love FOR God' (subjective) or 'love FROM God' (objective). Both apply: they neither love God nor have received His love into their hearts. The genitive ambiguity is probably intentional — both dimensions are missing.","translationNote":"Accurate. The ambiguity between 'love for God' and 'God's love' may be deliberate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":43,"verseText":"I am come in my Father's name, and ye receive me not: if another shall come in his own name, him ye will receive.","freshTranslation":"I have come in my Father's name, and you don't receive me. But if someone else comes in their own name, you'll welcome them.","historicalContext":"A prophetic warning: they reject the One who comes with the Father's authority but will accept false messiahs who come on their own authority. History proved Jesus right — between 70 and 135 AD, multiple false messiahs arose (including Bar Kochba) and received enthusiastic Jewish support, ending in catastrophe.","crossRefs":[{"ref":"Matthew 24:5","explanation":"'Many will come in my name, claiming, I am the Messiah, and will deceive many.'"}],"words":[{"english":"in my Father's name","original":"ἐν τῷ ὀνόματι τοῦ πατρός μου","transliteration":"en tō onomati tou patros mou","pronunciation":"en to ON-oh-mah-tee too pah-TROS moo","strongs":"G3686, G3962","partOfSpeech":"preposition + noun + noun","literalMeaning":"in the name of my Father","definition":"Coming 'in the name of' someone means coming with their authority, representing them, bearing their commission. Jesus comes bearing the Father's name — His authority, His mission, His message. A false messiah comes in his own name — self-appointed, self-authorized, self-serving.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":44,"verseText":"How can ye believe, which receive honour one of another, and seek not the honour that cometh from God only?","freshTranslation":"How can you believe, when you accept praise from one another but don't seek the praise that comes from the only God?","historicalContext":"The root cause of unbelief: they're addicted to human approval. The Pharisees' entire system was built on mutual validation — titles, public prayers, prominent seats, scholarly reputation. When your identity depends on peer approval, you can't risk believing something your peers reject. Human honor and divine faith are incompatible currencies.","crossRefs":[{"ref":"John 12:43","explanation":"'They loved human praise more than praise from God.' John repeats this diagnosis."},{"ref":"Matthew 6:1-2","explanation":"'Be careful not to practice your righteousness in front of others to be seen by them.' Jesus attacks the approval-seeking pattern."}],"words":[{"english":"How can ye believe","original":"πῶς δύνασθε ὑμεῖς πιστεῦσαι","transliteration":"pōs dynasthe hymeis pisteusai","pronunciation":"pohs DOO-nas-theh hoo-MAYS pis-TYOO-sai","strongs":"G4459, G1410, G4100","partOfSpeech":"adverb + verb + pronoun + verb","literalMeaning":"how are you able/possible to believe","definition":"A rhetorical question exposing the impossibility of faith when addicted to human honor. Dynamai (to be able, to have power) — Jesus says they CANNOT believe while seeking human glory. It's not just difficult; it's impossible. The two currencies cancel each other out.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":45,"verseText":"Do not think that I will accuse you to the Father: there is one that accuseth you, even Moses, in whom ye trust.","freshTranslation":"Don't think that I will be your accuser before the Father. Your accuser is Moses — the very one you have put your hope in.","historicalContext":"Final irony: they don't need Jesus to accuse them; Moses already does. The Torah they claim to follow is the very document that condemns them for rejecting its fulfillment. Their greatest hero becomes their prosecutor. Moses wrote about Jesus (v.46); rejecting Jesus means rejecting Moses.","crossRefs":[{"ref":"Romans 2:12","explanation":"'All who sin under the law will be judged by the law.' The law they champion becomes the standard they're judged by."}],"words":[{"english":"Moses, in whom ye trust","original":"Μωϋσῆς, εἰς ὃν ὑμεῖς ἠλπίκατε","transliteration":"Mōusēs, eis hon hymeis ēlpikate","pronunciation":"mo-oo-SAYS ays hon hoo-MAYS AYL-pee-kah-teh","strongs":"G3475, G1679","partOfSpeech":"proper noun + verb, perfect active indicative","literalMeaning":"Moses, into whom you have placed hope","definition":"Elpizō (to hope, to trust, to place confidence in) in the perfect tense — they have placed and continue to place their hope in Moses. But Moses himself wrote about Jesus. Their trusted hero is their accuser — the very Scriptures they revere condemn their unbelief.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":46,"verseText":"For had ye believed Moses, ye would have believed me: for he wrote of me.","freshTranslation":"If you actually believed Moses, you would believe me, because he wrote about me.","historicalContext":"The logical chain: Moses wrote about Jesus → truly believing Moses leads to believing Jesus → not believing Jesus proves you don't truly believe Moses. Their Moses-devotion is superficial — they honor the text without following where it leads. They're fans of the map but refuse to go to the destination.","crossRefs":[{"ref":"Luke 24:27","explanation":"'Beginning with Moses and all the Prophets, he explained what was said in all the Scriptures concerning himself.'"},{"ref":"Deuteronomy 18:15","explanation":"'The LORD your God will raise up for you a prophet like me from among your own brothers. You must listen to him.' Moses COMMANDED them to listen to Jesus."}],"words":[{"english":"he wrote of me","original":"περὶ ἐμοῦ ἔγραψεν","transliteration":"peri emou egrapsen","pronunciation":"per-EE em-OO EG-rap-sen","strongs":"G4012, G1125","partOfSpeech":"preposition + pronoun + verb, aorist","literalMeaning":"about/concerning me he wrote","definition":"Graphō (to write) in the aorist — Moses wrote at a definitive point in history. Peri emou (about me) — the Pentateuch's messianic prophecies all point to Jesus. Genesis 3:15 (seed of the woman), 22:18 (blessing through Abraham's seed), 49:10 (Shiloh/scepter from Judah), Deuteronomy 18:15 (prophet like Moses). Moses was always writing about Jesus.","translationNote":"Accurate.","twisted":false,"twistedExplanation":null}]},
{"verseNumber":47,"verseText":"But if ye believe not his writings, how shall ye believe my words?","freshTranslation":"But if you don't believe what Moses wrote, how will you ever believe what I say?","historicalContext":"The discourse ends with a devastating question. If they can't believe the written Word they've studied their entire lives, how will they believe the living Word standing in front of them? The argument is complete: four witnesses (John, works, Father, Scripture), all rejected. The prosecution rests. Jesus has made His case; their unbelief is now willful, informed, and inexcusable.","crossRefs":[{"ref":"Luke 16:31","explanation":"Abraham says to the rich man in Hades: 'If they do not listen to Moses and the Prophets, they will not be convinced even if someone rises from the dead.' Same principle — if written revelation doesn't convince, nothing will."}],"words":[{"english":"his writings... my words","original":"τοῖς γράμμασιν... τοῖς ῥήμασιν","transliteration":"tois grammasin... tois rhēmasin","pronunciation":"toys GRAM-mah-sin... toys HRAY-mah-sin","strongs":"G1121, G4487","partOfSpeech":"nouns, dative plural","literalMeaning":"the writings/letters... the spoken words","definition":"Gramma (writing, letter, document) vs. rhēma (spoken word, utterance). Jesus contrasts written Scripture (which they've had for centuries to study) with spoken revelation (which they're hearing right now). If the permanent, written, studied revelation doesn't convince, how will the spoken, immediate word? The argument moves from lesser to greater — if you can't trust ink on parchment, you won't trust words from a mouth.","translationNote":"Accurate. The gramma/rhēma distinction is significant — written vs. spoken revelation.","twisted":false,"twistedExplanation":null}]}
]}
