{"book": "John", "bookGreek": "Κατὰ Ἰωάννην", "chapter": 2, "author": "John (Ἰωάννης / Yohanan — 'God is gracious'), son of Zebedee, one of Jesus' inner circle of three disciples. A Galilean fisherman turned apostle, he is traditionally identified as 'the disciple whom Jesus loved.' Writing likely from Ephesus in the 80s–90s AD, John composed the most theological of the four Gospels, emphasizing Jesus' divine identity through carefully selected 'signs' and extended discourses.", "audience": "Greek-speaking believers and seekers in Asia Minor (modern Turkey), particularly in and around Ephesus. John writes for a mixed audience of Jewish and Gentile Christians who need deeper theological grounding, as well as seekers drawn to the philosophical and spiritual claims about Jesus. His Gospel assumes some familiarity with the Synoptic tradition while deliberately supplementing it with unique material.", "historicalContext": "John chapter 2 presents the first of Jesus' seven signs — turning water into wine at a wedding in Cana — followed by the dramatic cleansing of the Jerusalem Temple. The wedding miracle reveals Jesus' glory to his disciples in an intimate Galilean setting, while the Temple cleansing publicly confronts the religious establishment. Together they introduce a key Johannine theme: Jesus is replacing the institutions and rituals of Judaism with something greater — himself. The 'sign' at Cana transforms purification water into celebration wine; the Temple action points to Jesus' body as the true temple. These twin episodes set the theological agenda for the entire Gospel.", "verses": [{"verseNumber": 1, "verseText": "And the third day there was a marriage in Cana of Galilee; and the mother of Jesus was there:", "freshTranslation": "On the third day, a wedding took place in Cana of Galilee, and the mother of Jesus was there.", "historicalContext": "Jewish weddings were week-long community celebrations, often involving the entire village. Cana was a small town in the Galilean hills, likely modern Khirbet Qana, about 9 miles north of Nazareth. 'The third day' connects to the sequence beginning in John 1:19, but may also carry theological overtones — foreshadowing the resurrection 'on the third day.' Mary's presence without Joseph being mentioned suggests Joseph may have already died.", "crossRefs": [{"ref": "John 1:43", "explanation": "The previous day's events in the sequence leading to 'the third day'"}, {"ref": "Genesis 1:9-13", "explanation": "The third day in creation when dry land appears and vegetation springs forth — a day of life and fruitfulness"}, {"ref": "1 Corinthians 15:4", "explanation": "Christ's resurrection 'on the third day' — John may be layering this foreshadowing"}], "words": [{"english": "And the third", "original": "τῇ τρίτῃ", "transliteration": "tē tritē", "pronunciation": "tay TREE-tay", "strongs": "G5154", "partOfSpeech": "Adjective, dative feminine singular, with definite article", "literalMeaning": "the third", "definition": "Tritos means 'third' in a sequence. In Jewish reckoning, counting is inclusive — so 'the third day' after the events of John 1:43 means the day after tomorrow by modern counting. The phrase carries deep resonance throughout Scripture: God's decisive actions frequently occur 'on the third day' (Abraham and Isaac, Esther approaching the king, Hosea 6:2, and ultimately the resurrection). John's audience would catch this theological echo.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "day", "original": "ἡμέρᾳ", "transliteration": "hēmera", "pronunciation": "hay-MEH-rah", "strongs": "G2250", "partOfSpeech": "Noun, dative feminine singular", "literalMeaning": "day, daytime", "definition": "Hēmera refers to a day, either the daylight period or a full 24-hour cycle. In Jewish culture, a day began at sunset. The word appears over 380 times in the New Testament, often marking significant theological moments. Here it establishes the temporal framework John has been building since chapter 1, creating a 'week' of events that some scholars see as paralleling the creation week of Genesis.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "a wedding", "original": "γάμος", "transliteration": "gamos", "pronunciation": "GAH-moss", "strongs": "G1062", "partOfSpeech": "Noun, nominative masculine singular", "literalMeaning": "wedding, marriage feast", "definition": "Gamos denotes a wedding celebration, encompassing the entire multi-day festivity rather than just the ceremony itself. Jewish weddings in first-century Galilee were communal affairs lasting up to a week, involving feasting, music, dancing, and abundant wine. The groom's family bore the cost and the social obligation to provide generously. Running out of wine would be a serious social humiliation, potentially even grounds for a lawsuit. Jesus frequently uses wedding imagery for the messianic age (Matthew 22:1-14, 25:1-13), and the prophets depicted God's relationship with Israel as a marriage.", "translationNote": "KJV's 'marriage' is accurate but slightly clinical — 'wedding' or 'wedding feast' better captures the celebratory atmosphere of gamos.", "twisted": false, "twistedExplanation": null}, {"english": "took place", "original": "ἐγένετο", "transliteration": "egeneto", "pronunciation": "eh-GHEH-neh-toh", "strongs": "G1096", "partOfSpeech": "Verb, aorist middle indicative, 3rd person singular", "literalMeaning": "came to be, happened", "definition": "Ginomai is one of the most versatile verbs in Greek, meaning 'to come into being, to happen, to become.' It appeared prominently in John 1:3 ('all things were made through him') and 1:14 ('the Word became flesh'). Its use here subtly connects this wedding event to John's theology of divine action entering the material world. The aorist tense presents the event as a completed historical fact.", "translationNote": "KJV's 'there was' is adequate but flattens the verb's dynamic sense of something happening or coming about.", "twisted": false, "twistedExplanation": null}, {"english": "in Cana", "original": "ἐν Κανὰ", "transliteration": "en Kana", "pronunciation": "en kah-NAH", "strongs": "G2580", "partOfSpeech": "Proper noun, indeclinable, with preposition", "literalMeaning": "Cana (place of reeds)", "definition": "Kana is a small Galilean village whose name likely derives from the Hebrew qaneh, meaning 'reed.' It appears only in John's Gospel (2:1, 2:11, 4:46, 21:2), marking it as a distinctly Johannine location. The traditional identification with Kafr Kanna near Nazareth dates only to the Crusader period; modern archaeology favors Khirbet Qana, about 9 miles north of Nazareth, which shows habitation in the first century. Nathanael was from Cana (John 21:2), which may explain the connection to this wedding.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "of Galilee", "original": "τῆς Γαλιλαίας", "transliteration": "tēs Galilaias", "pronunciation": "tays gah-lee-LYE-ahs", "strongs": "G1056", "partOfSpeech": "Proper noun, genitive feminine singular, with definite article", "literalMeaning": "Galilee (the circle, the district)", "definition": "Galilaia comes from the Hebrew galil, meaning 'circle' or 'region,' specifically 'Galil ha-Goyim' — 'the circle of the Gentiles' (Isaiah 9:1). This northern region of Israel was culturally diverse, more rural than Judea, and looked down upon by the Jerusalem elite as unsophisticated and religiously lax. It was fertile agricultural land around the Sea of Galilee, with a mixed Jewish-Gentile population. That Jesus begins his ministry here, not in Jerusalem, is theologically significant — God's glory appears first in the margins, not the center of power.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "and the mother", "original": "καὶ ἡ μήτηρ", "transliteration": "kai hē mētēr", "pronunciation": "kai hay MAY-tair", "strongs": "G3384", "partOfSpeech": "Noun, nominative feminine singular, with conjunction and article", "literalMeaning": "mother", "definition": "Mētēr means 'mother' and is the root of English words like 'maternal' and 'metropolis' (mother-city). Remarkably, John never calls Mary by her name — she is always 'the mother of Jesus' (here and at the cross in 19:25-27). This is not disrespect but a theological choice: John presents her in terms of her relationship to Jesus and her role in the narrative of salvation. She appears only at the beginning of Jesus' signs (here) and at the cross — bookending his public ministry.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "of Jesus", "original": "τοῦ Ἰησοῦ", "transliteration": "tou Iēsou", "pronunciation": "too ee-ay-SOO", "strongs": "G2424", "partOfSpeech": "Proper noun, genitive masculine singular", "literalMeaning": "Yahweh saves, Yahweh is salvation", "definition": "Iēsous is the Greek form of the Hebrew Yeshua (Joshua), meaning 'Yahweh saves' or 'Yahweh is salvation.' It was a common Jewish name in the first century — the historian Josephus mentions about twenty different men named Jesus. The name itself is a theological statement embedded in an ordinary name: every time it is spoken, it proclaims that salvation comes from Israel's God. The genitive here indicates Mary's relationship to Jesus — she is defined by who her son is.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "was there", "original": "ἦν ἐκεῖ", "transliteration": "ēn ekei", "pronunciation": "ayn eh-KAY", "strongs": "G1563", "partOfSpeech": "Verb (imperfect active indicative, 3rd singular) + Adverb", "literalMeaning": "was there", "definition": "The imperfect tense of eimi ('to be') combined with ekei ('there') indicates Mary was already present at the wedding — she didn't arrive with Jesus. This suggests she may have been involved in the wedding preparations, possibly as a relative or close family friend of the wedding family. Her prior presence and awareness of the wine situation support the idea of a close familial connection to the hosts.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 2, "verseText": "And both Jesus was called, and his disciples, to the marriage.", "freshTranslation": "Jesus and his disciples had also been invited to the wedding.", "historicalContext": "Jesus' newly called disciples (from chapter 1) accompany him. That Jesus was 'called' (invited) to a wedding — and accepted — shows his engagement with ordinary social life. Unlike the ascetic John the Baptist, Jesus participated in celebrations. The inclusion of his disciples, who numbered perhaps five at this point (Andrew, Simon Peter, Philip, Nathanael, and the unnamed disciple), would have increased the strain on the host's provisions.", "crossRefs": [{"ref": "Matthew 11:19", "explanation": "Jesus was known as 'a friend of tax collectors and sinners' who came 'eating and drinking'"}, {"ref": "John 1:35-51", "explanation": "The calling of Jesus' first disciples, who now accompany him"}], "words": [{"english": "was called", "original": "ἐκλήθη", "transliteration": "eklēthē", "pronunciation": "eh-KLAY-thay", "strongs": "G2564", "partOfSpeech": "Verb, aorist passive indicative, 3rd person singular", "literalMeaning": "was called, was invited", "definition": "Kaleō means 'to call, to invite, to summon.' In the passive voice here, it means 'was invited.' The word carries a range of meaning from social invitation to divine calling — the same verb is used for God's calling of believers (Romans 8:30). That Jesus accepts this social invitation to a celebration is theologically important: he sanctifies ordinary human joy by his presence. The root gives us 'ecclesiastical' (ekklēsia — 'the called-out ones').", "translationNote": "KJV's 'was called' is technically correct but sounds odd in modern English; 'was invited' better conveys the social context.", "twisted": false, "twistedExplanation": null}, {"english": "and his disciples", "original": "καὶ οἱ μαθηταὶ αὐτοῦ", "transliteration": "kai hoi mathētai autou", "pronunciation": "kai hoy mah-thay-TIE ow-TOO", "strongs": "G3101", "partOfSpeech": "Noun, nominative masculine plural, with article and pronoun", "literalMeaning": "learners, students, followers", "definition": "Mathētēs comes from manthanō ('to learn') and means 'learner, pupil, apprentice.' Unlike the modern notion of a student in a classroom, a first-century disciple lived with and imitated their teacher (rabbi) in every aspect of life. The relationship was total — a disciple would literally follow their rabbi from place to place, absorb their teaching, copy their behavior, and eventually teach others. The word appears 261 times in the New Testament, almost exclusively in the Gospels and Acts. At this early stage, Jesus' disciple group was small and newly formed.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "to the wedding", "original": "εἰς τὸν γάμον", "transliteration": "eis ton gamon", "pronunciation": "ace tohn GAH-mohn", "strongs": "G1062", "partOfSpeech": "Preposition + Noun, accusative masculine singular", "literalMeaning": "into/to the wedding", "definition": "The preposition eis ('into, to') with gamos indicates motion toward and participation in the wedding feast. The accusative case with eis emphasizes entry into the celebration. Weddings were the most joyful events in Jewish communal life, and refusing an invitation was considered a serious social offense. Jesus' willing participation in this celebration stands in contrast to religious leaders who avoided such gatherings for fear of ritual contamination.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 3, "verseText": "And when they wanted wine, the mother of Jesus saith unto him, They have no wine.", "freshTranslation": "When the wine ran out, the mother of Jesus said to him, 'They have no wine.'", "historicalContext": "Running out of wine at a wedding was a devastating social failure for the host family — it could bring lasting shame in an honor-shame culture and even lead to legal claims from the bride's family. Wine was not a luxury but a staple of celebration; the Talmud states that 'there is no joy without wine.' Mary's statement to Jesus is not merely informational — she clearly expects him to do something about it, though his public ministry has not yet begun. Her confidence suggests she has witnessed something of his power or character that gave her this expectation.", "crossRefs": [{"ref": "Psalm 104:15", "explanation": "Wine that 'gladdens the heart of man' — wine as God's gift of joy"}, {"ref": "Isaiah 25:6", "explanation": "The messianic banquet described with 'aged wine' — abundance of wine signals God's kingdom"}], "words": [{"english": "when they wanted wine / when the wine ran out", "original": "ὑστερήσαντος οἴνου", "transliteration": "hysterēsantos oinou", "pronunciation": "hoo-steh-RAY-sahn-tohs OY-noo", "strongs": "G5302", "partOfSpeech": "Verb, aorist active participle, genitive masculine singular (genitive absolute) + Noun, genitive masculine singular", "literalMeaning": "wine having fallen short / wine having failed", "definition": "Hystereō means 'to fall short, to lack, to be deficient, to run out.' It comes from hysteros ('later, behind') and carries the sense of being left behind or coming up short. The genitive absolute construction here ('wine having failed') is a sophisticated Greek grammatical structure indicating a circumstantial clause. The KJV's 'when they wanted wine' uses 'wanted' in the archaic sense of 'lacked,' not 'desired.' This verb appears in Philippians 4:12 for Paul's experience of 'being in need.' The wine didn't merely get low — it completely failed.", "translationNote": "KJV's 'when they wanted wine' is misleading to modern readers who read 'wanted' as 'desired.' The Greek clearly means 'when the wine ran out/failed.' This is a significant translation clarity issue.", "twisted": true, "twistedExplanation": "The KJV's 'wanted' in 1611 meant 'lacked,' but modern readers consistently misread it as 'desired,' losing the urgency of the social crisis. The wine had completely run out — the family was facing public humiliation."}, {"english": "the mother of Jesus", "original": "ἡ μήτηρ τοῦ Ἰησοῦ", "transliteration": "hē mētēr tou Iēsou", "pronunciation": "hay MAY-tair too ee-ay-SOO", "strongs": "G3384", "partOfSpeech": "Noun, nominative feminine singular, with article", "literalMeaning": "the mother of Jesus", "definition": "Again John identifies Mary solely by her relationship to Jesus. Her initiative in bringing the problem to Jesus suggests she has some role or connection to the hosting family — perhaps as a relative helping with arrangements. In the honor-shame dynamics of the scene, a woman would not typically approach a male teacher publicly unless the social bonds warranted it. Her confidence that Jesus can address this situation is remarkable given that, as John notes, this will be his first sign.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "says to him", "original": "λέγει πρὸς αὐτόν", "transliteration": "legei pros auton", "pronunciation": "LEH-gay prohs ow-TOHN", "strongs": "G3004", "partOfSpeech": "Verb, present active indicative, 3rd person singular + preposition + pronoun", "literalMeaning": "says toward him", "definition": "Legō means 'to say, to speak, to tell.' John uses the historical present tense here — narrating a past event with a present-tense verb — which creates dramatic vividness, pulling the reader into the moment. This is a characteristic feature of John's narrative style. The preposition pros ('toward') adds a sense of directness and intentionality to her speech — she speaks pointedly to Jesus.", "translationNote": "KJV's 'saith' captures the historical present but sounds archaic. The present tense is meant to create narrative immediacy.", "twisted": false, "twistedExplanation": null}, {"english": "they have no wine", "original": "οἶνον οὐκ ἔχουσιν", "transliteration": "oinon ouk echousin", "pronunciation": "OY-nohn ook EH-khoo-sin", "strongs": "G3631", "partOfSpeech": "Noun (accusative masculine singular) + Negative particle + Verb (present active indicative, 3rd person plural)", "literalMeaning": "wine not they-have", "definition": "Oinos ('wine') is placed first in the Greek for emphasis — it's the wine that is the crisis. Oinos refers to fermented grape juice, the standard beverage at meals and celebrations throughout the ancient Mediterranean world. It was typically diluted with water (2:1 or 3:1 water to wine). The emphatic word order and the stark negation (ouk — absolute 'not') convey the completeness of the shortage. Mary states the problem without stating a solution, leaving space for Jesus to act as he sees fit.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 4, "verseText": "Jesus saith unto her, Woman, what have I to do with thee? mine hour is not yet come.", "freshTranslation": "Jesus said to her, 'Woman, what concern is that to you and me? My hour has not yet come.'", "historicalContext": "Jesus' response sounds harsh in English but is not disrespectful in Greek. 'Woman' (gynai) was a formal address — the same word Jesus uses from the cross when tenderly committing Mary to John's care (19:26). The phrase 'what to me and to you' is a Semitic idiom found throughout the Old Testament (Judges 11:12, 2 Samuel 16:10, 1 Kings 17:18) that establishes distance between two parties' concerns. Jesus introduces the critical Johannine concept of 'the hour' — his appointed time of glorification through the cross, which structures the entire Gospel's timeline.", "crossRefs": [{"ref": "John 19:26", "explanation": "Jesus addresses Mary as 'Woman' from the cross — same respectful term"}, {"ref": "John 7:30", "explanation": "'His hour had not yet come' — recurring theme of divine timing throughout John"}, {"ref": "2 Samuel 16:10", "explanation": "Same Semitic idiom 'what have I to do with you' used by David — expressing differing concerns"}], "words": [{"english": "Woman", "original": "γύναι", "transliteration": "gynai", "pronunciation": "GOO-nai", "strongs": "G1135", "partOfSpeech": "Noun, vocative feminine singular", "literalMeaning": "woman, lady", "definition": "Gynē (vocative: gynai) means 'woman' and was a perfectly respectful form of address in Greek culture — comparable to 'Madam' or 'Ma'am.' Homer uses it for goddesses, and Augustus Caesar addressed Cleopatra this way. It was NOT rude or dismissive. However, it was unusual for a son to address his mother this way instead of using 'mother' (mēter). John's Jesus uses this form to signal that their relationship is being redefined: he acts not as Mary's son following family obligations, but as the Messiah following the Father's timing. The same address appears at the cross (19:26), creating a deliberate bookend.", "translationNote": "English 'woman' sounds shockingly rude when addressed to one's mother, but the Greek carries no disrespect whatsoever. This is one of the most commonly misunderstood moments in the Gospels.", "twisted": true, "twistedExplanation": "Modern English readers hear 'Woman' as dismissive or even hostile. The Greek gynai was a term of respect and dignity. The cultural mismatch causes readers to perceive conflict where John intends a theological statement about Jesus' identity and mission transcending family ties."}, {"english": "what have I to do with thee", "original": "τί ἐμοὶ καὶ σοί", "transliteration": "ti emoi kai soi", "pronunciation": "tee eh-MOY kai SOY", "strongs": "G5101", "partOfSpeech": "Interrogative pronoun + personal pronouns, dative", "literalMeaning": "what to me and to you?", "definition": "This is a Semitic idiom (Hebrew: mah li walak) that literally asks 'what is there between me and you?' Its meaning ranges from mild distancing ('that's not our concern') to strong rejection ('leave me alone'), depending on context. In the Old Testament it appears in Joshua 22:24, Judges 11:12, 2 Samuel 16:10, 19:22, and 1 Kings 17:18. Here the tone is mild — Jesus is not rejecting Mary but clarifying that his actions follow divine timing, not family pressure. He will in fact help, but on his own terms and timetable.", "translationNote": "KJV's literal rendering sounds rude in English. Better: 'What concern is that to you and me?' or 'Why involve me?' The idiom signals gentle redirection, not rejection.", "twisted": true, "twistedExplanation": "The English phrasing 'what have I to do with thee' sounds like a harsh rebuke. The Semitic idiom is much softer — more like 'this isn't really our problem' or 'why are you bringing this to me?' The context confirms the mild reading: Jesus proceeds to help."}, {"english": "my hour", "original": "ἡ ὥρα μου", "transliteration": "hē hōra mou", "pronunciation": "hay HO-rah moo", "strongs": "G5610", "partOfSpeech": "Noun, nominative feminine singular, with article and possessive pronoun", "literalMeaning": "the hour of me", "definition": "Hōra means 'hour, time, season, appointed moment.' In John's Gospel, 'the hour' becomes a major theological concept referring to Jesus' appointed time of glorification through his death, resurrection, and return to the Father. It creates a dramatic arc: the hour 'has not yet come' (2:4, 7:30, 8:20), then dramatically 'the hour has come' (12:23, 13:1, 17:1). Here at the very first sign, Jesus already has the cross in view. The definite article ('the hour') indicates a specific, predetermined divine appointment.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "is not yet come", "original": "οὔπω ἥκει", "transliteration": "oupō hēkei", "pronunciation": "OO-poh HAY-kay", "strongs": "G3768", "partOfSpeech": "Adverb (not yet) + Verb, present active indicative, 3rd person singular", "literalMeaning": "not yet has arrived", "definition": "Oupō is a compound of ou ('not') and pō ('yet'), meaning 'not yet' — implying that it will come eventually. Hēkō means 'to have come, to have arrived, to be present.' The present tense of hēkō with a perfect sense ('has arrived') emphasizes that the hour is not yet a present reality. This 'not yet' creates the entire dramatic tension of John's Gospel — everything moves toward 'the hour' when it finally arrives. Jesus operates on divine time, not human urgency.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 5, "verseText": "His mother saith unto the servants, Whatsoever he saith unto you, do it.", "freshTranslation": "His mother said to the servants, 'Whatever he tells you, do it.'", "historicalContext": "Despite Jesus' seemingly discouraging reply, Mary shows remarkable faith by instructing the servants to obey him. Her words echo Pharaoh's command about Joseph in Genesis 41:55 ('whatever he says to you, do it') and Israel's covenant response at Sinai ('all that the LORD has spoken, we will do' — Exodus 19:8). Mary's confidence suggests an intimate knowledge of Jesus' character — she knows he will act. Her instruction to the servants shows she had some authority at this event, supporting the theory of a family connection to the hosts.", "crossRefs": [{"ref": "Genesis 41:55", "explanation": "Pharaoh's identical command about Joseph — 'whatever he says to you, do it'"}, {"ref": "Exodus 19:8", "explanation": "Israel's covenant pledge: 'all that the LORD has spoken we will do'"}], "words": [{"english": "His mother", "original": "ἡ μήτηρ αὐτοῦ", "transliteration": "hē mētēr autou", "pronunciation": "hay MAY-tair ow-TOO", "strongs": "G3384", "partOfSpeech": "Noun, nominative feminine singular, with article and pronoun", "literalMeaning": "the mother of him", "definition": "Now the perspective shifts — she is 'his mother' rather than 'the mother of Jesus.' This subtle variation in John's narration draws attention to the relational dynamic: after Jesus has established his divine mission above family ties (v.4), John still acknowledges the human bond. Mary's response to Jesus' seeming refusal reveals her character: she neither argues nor retreats but acts in confident faith.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "says to the servants", "original": "λέγει τοῖς διακόνοις", "transliteration": "legei tois diakonois", "pronunciation": "LEH-gay toys dee-ah-KOH-noys", "strongs": "G1249", "partOfSpeech": "Verb (present active indicative) + Noun, dative masculine plural", "literalMeaning": "says to the servers/attendants", "definition": "Diakonos means 'servant, attendant, minister' — one who serves at table or carries out tasks for another. This is the root of the English 'deacon.' In the ancient world, diakonoi at a wedding would be responsible for serving food and wine, managing logistics, and attending to guests. The word carries no stigma — it denotes function rather than status. Jesus himself says he came 'not to be served but to serve (diakonēsai)' (Mark 10:45). These servants become the first witnesses to Jesus' miraculous power.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Whatever he tells you, do it", "original": "ὅ τι ἂν λέγῃ ὑμῖν ποιήσατε", "transliteration": "ho ti an legē hymin poiēsate", "pronunciation": "hoh tee ahn LEH-gay hoo-MEEN poy-AY-sah-teh", "strongs": "G4160", "partOfSpeech": "Relative pronoun + particle + subjunctive verb + pronoun + aorist imperative verb", "literalMeaning": "whatever he may say to you, do", "definition": "Poieō (imperative: poiēsate) means 'to do, to make, to accomplish.' The aorist imperative conveys a decisive, once-for-all command — 'just do it' — rather than an ongoing instruction. Combined with the indefinite relative clause ('whatever he may say'), Mary gives the servants an open-ended mandate of total obedience. This is one of the most powerful statements of faith in the Gospels: Mary doesn't know what Jesus will do, but she trusts it completely. Her words serve as a model of discipleship for John's readers.", "translationNote": "Accurate. KJV preserves the force well.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 6, "verseText": "And there were set there six waterpots of stone, after the manner of the purifying of the Jews, containing two or three firkins apiece.", "freshTranslation": "Now six stone water jars were standing there for the Jewish ceremonial washing, each holding twenty to thirty gallons.", "historicalContext": "These stone jars were used for Jewish ritual purification (hand-washing before meals, washing of utensils, etc.) as prescribed by the oral traditions of the elders. Stone vessels were preferred because, unlike pottery, they were considered incapable of contracting ritual impurity under Jewish law. Six is one short of seven (the number of completeness/perfection) — perhaps symbolizing the inadequacy of the old purification system. The total capacity was 120-180 gallons, an enormous quantity — Jesus' provision is extravagant.", "crossRefs": [{"ref": "Mark 7:3-4", "explanation": "Describes the Jewish practice of ceremonial washing that these jars facilitated"}, {"ref": "Leviticus 11:33", "explanation": "Clay vessels that become impure must be broken — explaining the preference for stone"}], "words": [{"english": "six", "original": "ἕξ", "transliteration": "hex", "pronunciation": "hex", "strongs": "G1803", "partOfSpeech": "Indeclinable numeral", "literalMeaning": "six", "definition": "Hex is the cardinal number six. In Jewish numerology, six falls one short of seven (the number of divine perfection and completeness). Many commentators see symbolism here: the old system of Jewish purification is incomplete — it needs what Jesus provides to reach 'seven,' fullness. Whether John intends this symbolism or simply reports the number of jars present is debated, but given John's highly symbolic style, the former is likely. Six stone jars for purification that Jesus fills with the wine of the new covenant — the old gives way to the new.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "water jars", "original": "ὑδρίαι", "transliteration": "hydriai", "pronunciation": "hoo-DREE-ai", "strongs": "G5201", "partOfSpeech": "Noun, nominative feminine plural", "literalMeaning": "water vessels, water jars", "definition": "Hydria comes from hydōr ('water') and denotes a large vessel for storing or carrying water. These were substantial stone containers, not small pots — each holding 20-30 gallons. Archaeological discoveries in Israel have uncovered many such stone vessels from the first century, confirming their widespread use in Jewish households for maintaining ritual purity. They were hewn from soft limestone, which was abundant in the Judean and Galilean hills. The English prefix 'hydro-' derives from the same root.", "translationNote": "KJV's 'waterpots' is somewhat diminutive. These were massive stone jars — 'water jars' or 'stone vessels' better conveys their scale.", "twisted": false, "twistedExplanation": null}, {"english": "of stone", "original": "λίθιναι", "transliteration": "lithinai", "pronunciation": "LEE-thee-nai", "strongs": "G3035", "partOfSpeech": "Adjective, nominative feminine plural", "literalMeaning": "made of stone", "definition": "Lithinos means 'made of stone,' from lithos ('stone'). Stone vessels were specifically chosen for ritual purity purposes because the Mishnah (Kelim 10:1) teaches that stone does not contract ritual impurity (tumah), unlike pottery which must be destroyed if contaminated. This made stone vessels essential for observant Jewish households. The detail is not incidental — John emphasizes the material to underscore that these jars belonged to the Jewish purification system that Jesus is about to transform.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "for the purifying of the Jews", "original": "κατὰ τὸν καθαρισμὸν τῶν Ἰουδαίων", "transliteration": "kata ton katharismon tōn Ioudaiōn", "pronunciation": "kah-TAH tohn kah-thah-rees-MOHN tohn ee-oo-DYE-ohn", "strongs": "G2512", "partOfSpeech": "Preposition + Noun (accusative masculine singular) + Article + Noun (genitive masculine plural)", "literalMeaning": "according to the cleansing/purification of the Jews", "definition": "Katharismos means 'cleansing, purification' — from katharizō ('to make clean'), which gives us 'catharsis.' The phrase 'of the Jews' (tōn Ioudaiōn) is characteristic of John, who frequently adds explanatory notes for his non-Jewish audience ('as is the custom of the Jews'). The purification rituals involved washing hands before meals, washing after contact with anything potentially impure, and cleaning utensils. These were oral traditions (not Mosaic law) that the Pharisees elevated to great importance. Jesus will transform vessels of ritual obligation into vessels of celebration.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "containing two or three firkins apiece", "original": "χωροῦσαι ἀνὰ μετρητὰς δύο ἢ τρεῖς", "transliteration": "chōrousai ana metrētas dyo ē treis", "pronunciation": "kho-ROO-sai ah-NAH meh-tray-TAHS DOO-oh ay TRAYS", "strongs": "G3355", "partOfSpeech": "Participle (present active, nominative feminine plural) + preposition + noun (accusative masculine plural) + numerals + conjunction", "literalMeaning": "holding two or three measures each", "definition": "Metrētēs (plural: metrētas) was a liquid measure equivalent to about 9 gallons (approximately 39 liters), roughly the same as the Hebrew bath. Two or three metrētas per jar means each held 18-27 gallons. With six jars, the total was approximately 120-180 gallons of wine — a staggering quantity, far more than any wedding party could consume. This abundance is theologically loaded: when God provides, he provides in overwhelming excess. The KJV's 'firkins' translates metrētas with an archaic English unit that is now completely unfamiliar.", "translationNote": "KJV's 'firkins' is incomprehensible to modern readers. A firkin was an English unit of about 9 gallons — matching the metrētēs. Modern translations rightly convert to gallons or liters.", "twisted": true, "twistedExplanation": "No modern English reader knows what a 'firkin' is. The KJV's use of a now-obsolete unit of measurement obscures the astonishing scale of Jesus' provision — roughly 120-180 gallons of the finest wine."}]}, {"verseNumber": 7, "verseText": "Jesus saith unto them, Fill the waterpots with water. And they filled them up to the brim.", "freshTranslation": "Jesus said to them, 'Fill the jars with water.' And they filled them to the brim.", "historicalContext": "Jesus involves the servants in the miracle by giving them a concrete, obeyable command. The detail 'to the brim' (heōs anō — 'up to the top') serves as evidence that no wine was mixed in — there was no room for anything but water. This establishes the miracle's authenticity through eyewitness detail. The servants' immediate obedience, following Mary's instruction, makes them active participants in the sign. Filling six large stone jars to the brim would have required significant physical effort, hauling water from a well or cistern.", "crossRefs": [{"ref": "2 Kings 4:1-7", "explanation": "Elisha's miracle of multiplying oil — also involved filling vessels to the brim"}, {"ref": "John 2:5", "explanation": "The servants obey Jesus exactly as Mary instructed them to"}], "words": [{"english": "Fill", "original": "γεμίσατε", "transliteration": "gemisate", "pronunciation": "gheh-MEE-sah-teh", "strongs": "G1072", "partOfSpeech": "Verb, aorist active imperative, 2nd person plural", "literalMeaning": "fill, fill up", "definition": "Gemizō means 'to fill, to load.' The aorist imperative makes this a decisive command — 'fill them now.' Jesus gives simple, concrete instructions that require obedient action. He doesn't explain why, doesn't perform theatrical gestures, doesn't invoke divine names. The command is almost mundanely practical: fill the jars with water. God often works through ordinary obedience to extraordinary commands. The word appears in Mark 4:37 for the boat 'filling' with waves, conveying a sense of completeness.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the water jars", "original": "τὰς ὑδρίας", "transliteration": "tas hydrias", "pronunciation": "tahs hoo-DREE-ahs", "strongs": "G5201", "partOfSpeech": "Noun, accusative feminine plural, with definite article", "literalMeaning": "the water vessels", "definition": "The definite article 'tas' points back to the specific jars described in verse 6 — the stone jars for Jewish purification. Jesus deliberately chooses vessels associated with the old covenant's system of ritual cleansing as the containers for his new wine. The symbolism is unmistakable to John's readers: the water of purification becomes the wine of celebration; the old covenant gives way to the new.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "with water", "original": "ὕδατος", "transliteration": "hydatos", "pronunciation": "HOO-dah-tohs", "strongs": "G5204", "partOfSpeech": "Noun, genitive neuter singular", "literalMeaning": "of water", "definition": "Hydōr (genitive: hydatos) means 'water' and is the root of English words like 'hydrate,' 'hydraulic,' and 'hydroelectric.' Water is a central symbol throughout John's Gospel: Jesus offers 'living water' (4:10-14), walks on water (6:19), and water flows from his pierced side (19:34). Here, ordinary water becomes the raw material for divine transformation. The genitive indicates the substance with which the jars are to be filled.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "to the brim", "original": "ἕως ἄνω", "transliteration": "heōs anō", "pronunciation": "HEH-ohs AH-noh", "strongs": "G507", "partOfSpeech": "Preposition + Adverb", "literalMeaning": "up to the top", "definition": "Heōs means 'until, up to' and anō means 'above, upward, to the top.' Together they mean 'to the very top, to the brim.' This precise detail serves multiple purposes: it establishes the completeness of the servants' obedience, eliminates any possibility that wine was added to the water (there was no room), and emphasizes the scale of the miracle — every drop in those 120-180 gallons was transformed. John's eyewitness precision shines through in details like these.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 8, "verseText": "And he saith unto them, Draw out now, and bear unto the governor of the feast. And they bare it.", "freshTranslation": "Then he told them, 'Now draw some out and take it to the master of the feast.' So they took it.", "historicalContext": "The 'governor of the feast' (architriklinos) was a trusted friend or hired professional who managed the banquet — tasting food and wine, directing servants, and ensuring the celebration ran smoothly. Jesus' instruction requires enormous faith from the servants: they know the jars contain water, yet they are told to present it to the expert who will taste it. If it's still water, they will look foolish or be punished. Their obedience demonstrates the faith Mary called for in verse 5.", "crossRefs": [{"ref": "Sirach 32:1-2", "explanation": "Description of the master of a feast and his responsibilities in Jewish culture"}, {"ref": "John 2:5", "explanation": "'Whatever he tells you, do it' — the servants now embody Mary's instruction"}], "words": [{"english": "Draw out", "original": "ἀντλήσατε", "transliteration": "antlēsate", "pronunciation": "ahnt-LAY-sah-teh", "strongs": "G501", "partOfSpeech": "Verb, aorist active imperative, 2nd person plural", "literalMeaning": "draw out (liquid), scoop up", "definition": "Antleō means 'to draw water, to bail out, to scoop.' It's used in John 4:7,15 for drawing water from a well. The word implies using a ladle or smaller vessel to draw from the large stone jars. The aorist imperative again conveys a decisive command. The same verb connects this miracle to the Samaritan woman story in chapter 4, where Jesus offers water that becomes 'a spring of water welling up to eternal life' — both scenes involve the transformation of ordinary water into something life-giving.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "now", "original": "νῦν", "transliteration": "nyn", "pronunciation": "noon", "strongs": "G3568", "partOfSpeech": "Adverb", "literalMeaning": "now, at this moment", "definition": "Nyn means 'now, at the present time.' This small word carries theological weight throughout John's Gospel, marking the moment when God acts decisively in the present. Here it signals the critical transition: the preparation (filling the jars) is complete, and now comes the moment of revelation. Jesus' 'now' is the hinge between ordinary water and extraordinary wine, between the old system and the new.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the master of the feast", "original": "τῷ ἀρχιτρικλίνῳ", "transliteration": "tō architriklinō", "pronunciation": "toh ar-khee-tree-KLEE-noh", "strongs": "G755", "partOfSpeech": "Noun, dative masculine singular, with definite article", "literalMeaning": "ruler of the three-couch (dining room)", "definition": "Architriklinos is a compound of archi ('chief, ruler') and triklinos ('three-couch dining room,' from tri + klinē, 'three couches'). In Greco-Roman dining, guests reclined on couches arranged in a U-shape. The architriklinos was the head waiter, banquet manager, or master of ceremonies — responsible for the quality and flow of food and wine. This was either a trusted friend serving as an honor or a professional hire. His expertise is crucial to the story: when he tastes the water-become-wine without knowing its origin, his professional judgment authenticates the miracle.", "translationNote": "KJV's 'governor of the feast' is adequate but formal. 'Master of the feast' or 'banquet manager' better communicates the role.", "twisted": false, "twistedExplanation": null}, {"english": "they took it", "original": "ἤνεγκαν", "transliteration": "ēnenkan", "pronunciation": "AY-nen-kahn", "strongs": "G5342", "partOfSpeech": "Verb, aorist active indicative, 3rd person plural", "literalMeaning": "they carried, they brought", "definition": "Pherō (aorist: ēnenkan) means 'to carry, to bring, to bear.' The servants obeyed without argument or hesitation. They knew they had filled those jars with water, yet they carried the contents to the wine expert. This quiet, unremarked obedience is remarkable — no questions, no protest, no hedging. John's simple statement 'they brought it' contains an act of extraordinary trust. The transformation apparently happened somewhere between the drawing and the tasting — John doesn't specify the exact moment, keeping the focus on the result rather than the mechanism.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 9, "verseText": "When the ruler of the feast had tasted the water that was made wine, and knew not whence it was: (but the servants which drew the water knew;) the governor of the feast called the bridegroom,", "freshTranslation": "When the master of the feast tasted the water that had become wine — not knowing where it came from, though the servants who had drawn the water knew — he called the bridegroom", "historicalContext": "John creates a dramatic irony: the expert tastes and evaluates the wine without knowing its miraculous origin, while the lowly servants who did the manual labor possess the knowledge. This pattern recurs throughout John's Gospel — those with status and authority are often blind to what the humble and marginal perceive. The architriklinos's ignorance authenticates the miracle objectively: his judgment is unbiased because he has no idea what happened.", "crossRefs": [{"ref": "1 Corinthians 1:26-29", "explanation": "God chooses the lowly — the servants know what the master does not"}, {"ref": "John 9:39-41", "explanation": "Those who think they see are blind; those who know they're blind receive sight — same irony pattern"}], "words": [{"english": "had tasted", "original": "ἐγεύσατο", "transliteration": "egeusato", "pronunciation": "eh-GHYOO-sah-toh", "strongs": "G1089", "partOfSpeech": "Verb, aorist middle indicative, 3rd person singular", "literalMeaning": "tasted, experienced", "definition": "Geuomai means 'to taste, to partake of, to experience.' It gives us the English 'gustation' and 'gustatory.' In biblical usage it extends beyond literal taste to experiencing something deeply — 'taste and see that the LORD is good' (Psalm 34:8), 'taste death' (Hebrews 2:9). Here it refers to the professional evaluation of wine quality. The middle voice suggests personal, direct experience — he tasted it for himself. His expert palate confirms the water has genuinely become wine, and excellent wine at that.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the water that had become wine", "original": "τὸ ὕδωρ οἶνον γεγενημένον", "transliteration": "to hydōr oinon gegenēmenon", "pronunciation": "toh HOO-dohr OY-nohn gheh-gheh-nay-MEH-nohn", "strongs": "G1096", "partOfSpeech": "Article + Noun + Noun + Participle (perfect middle/passive, accusative neuter singular)", "literalMeaning": "the water wine having-become", "definition": "The perfect participle gegenēmenon (from ginomai, 'to become') indicates a completed transformation with ongoing results — the water has become wine and remains wine. John's phrasing is precise and startling: he doesn't say 'the wine that had been water' but 'the water that had become wine,' keeping the origin visible even as the transformation is complete. This is the verb from John 1:14 — 'the Word became flesh.' John uses the same vocabulary of divine transformation for both the incarnation and this first sign.", "translationNote": "KJV's 'water that was made wine' is accurate but passive; the Greek middle/passive participle can suggest the water itself underwent transformation.", "twisted": false, "twistedExplanation": null}, {"english": "knew not whence it was", "original": "οὐκ ᾔδει πόθεν ἐστίν", "transliteration": "ouk ēdei pothen estin", "pronunciation": "ook AY-day POH-then ehs-TEEN", "strongs": "G4159", "partOfSpeech": "Negative + Verb (pluperfect active, 3rd singular) + Adverb + Verb (present, 3rd singular)", "literalMeaning": "not he-knew from-where it-is", "definition": "Pothen means 'from where, whence' and is a key word in John's Gospel. The question of Jesus' origin ('where is he from?') recurs throughout (7:27-28, 8:14, 9:29-30, 19:9). The architriklinos doesn't know where the wine came from — but this ignorance about origin mirrors the larger question John's Gospel poses: do people recognize where Jesus comes from (the Father)? The servants, like the disciples, have insider knowledge that the powerful lack.", "translationNote": "KJV's 'whence' is archaic but accurately renders pothen.", "twisted": false, "twistedExplanation": null}, {"english": "but the servants who had drawn knew", "original": "οἱ δὲ διάκονοι ᾔδεισαν οἱ ἠντληκότες", "transliteration": "hoi de diakonoi ēdeisan hoi ēntlēkotes", "pronunciation": "hoy deh dee-AH-koh-noy AY-day-sahn hoy aynt-lay-KOH-tehs", "strongs": "G1249", "partOfSpeech": "Article + Conjunction + Noun (nominative plural) + Verb (pluperfect active, 3rd plural) + Article + Participle (perfect active, nominative masculine plural)", "literalMeaning": "but the servants knew, the ones having drawn", "definition": "John inserts this parenthetical to highlight the dramatic irony. The diakonoi — the lowest-ranking people at the feast — possess knowledge that the person of highest authority lacks. The perfect participle ēntlēkotes ('having drawn') emphasizes their direct involvement in the miracle's preparation. This pattern — God revealing truth to the humble while the powerful remain ignorant — is deeply Johannine and deeply biblical (cf. Matthew 11:25). The servants' knowledge makes them the first true witnesses to Jesus' glory.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "called the bridegroom", "original": "φωνεῖ τὸν νυμφίον", "transliteration": "phōnei ton nymphion", "pronunciation": "foh-NAY tohn noom-FEE-ohn", "strongs": "G3566", "partOfSpeech": "Verb (present active indicative, 3rd singular) + Article + Noun (accusative masculine singular)", "literalMeaning": "calls/summons the bridegroom", "definition": "Nymphios means 'bridegroom' — from nymphē ('bride'). In Jewish wedding customs, the groom bore primary responsibility for the celebration's provisions. The architriklinos calls the groom to commend what he assumes was a deliberate strategy of saving the best wine for last. Throughout the Gospels, Jesus is identified as the true Bridegroom (John 3:29, Matthew 9:15, Mark 2:19-20), making this scene work on two levels: the human bridegroom receives credit, but Jesus — the divine Bridegroom — is the actual provider.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 10, "verseText": "And saith unto him, Every man at the beginning doth set forth good wine; and when men have well drunk, then that which is worse: but thou hast kept the good wine until now.", "freshTranslation": "and said to him, 'Everyone serves the fine wine first, and then the cheaper wine after the guests have drunk freely. But you have saved the best wine until now.'", "historicalContext": "The architriklinos states a universal practice: serve the best wine first while palates are sharp, then switch to inferior wine once guests have drunk enough not to notice the difference. This was common sense and accepted social strategy. His astonishment that the groom apparently reversed this practice is the punchline of the miracle. Theologically, it declares that what God does in Jesus surpasses everything that came before — the new covenant wine is better than the old covenant water of purification.", "crossRefs": [{"ref": "Hebrews 8:6", "explanation": "Jesus mediates a 'better covenant' — the best saved for last"}, {"ref": "Song of Solomon 1:2", "explanation": "'Your love is better than wine' — the bridegroom's excellence"}], "words": [{"english": "every man", "original": "πᾶς ἄνθρωπος", "transliteration": "pas anthrōpos", "pronunciation": "pahs AHN-throh-pohs", "strongs": "G3956", "partOfSpeech": "Adjective (nominative masculine singular) + Noun (nominative masculine singular)", "literalMeaning": "every person/human", "definition": "Pas anthrōpos means 'every person, everyone.' The architriklinos appeals to universal custom — this is what everybody does. Anthrōpos (root of 'anthropology') means 'human being' without gender specificity, though KJV renders it 'man.' The universality of the statement makes the exception all the more striking: everyone follows this pattern, but you did the opposite. On the theological level, God's way always defies human convention — he saves the best for later.", "translationNote": "KJV's 'every man' reflects generic masculine usage; 'everyone' is more accurate to the inclusive sense of anthrōpos.", "twisted": false, "twistedExplanation": null}, {"english": "the good wine", "original": "τὸν καλὸν οἶνον", "transliteration": "ton kalon oinon", "pronunciation": "tohn kah-LOHN OY-nohn", "strongs": "G2570", "partOfSpeech": "Article + Adjective (accusative masculine singular) + Noun (accusative masculine singular)", "literalMeaning": "the fine/beautiful wine", "definition": "Kalos means 'beautiful, good, fine, excellent' — it describes quality that is both aesthetically pleasing and genuinely superior. Unlike agathos (morally good), kalos emphasizes outward excellence and attractiveness. The architriklinos is an expert — his use of kalos is a professional judgment about wine quality. Jesus doesn't just produce wine; he produces the finest wine the expert has ever tasted at a wedding. God's provision is not merely adequate but extravagant in both quantity (120-180 gallons) and quality (the best).", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "have well drunk / have drunk freely", "original": "μεθυσθῶσιν", "transliteration": "methysthōsin", "pronunciation": "meh-thoos-THOH-sin", "strongs": "G3184", "partOfSpeech": "Verb, aorist passive subjunctive, 3rd person plural", "literalMeaning": "become drunk/intoxicated", "definition": "Methyskō means 'to make drunk, to intoxicate.' In the passive, 'to become drunk.' This is a straightforward reference to the reality of alcohol consumption at ancient feasts. The architriklinos matter-of-factly acknowledges that guests drink heavily at weddings — once they're inebriated, they can't tell good wine from bad. Some translations soften this to 'have drunk freely' or 'have had much to drink,' but the Greek is candid. This verse has been central to debates about Jesus and alcohol: he knowingly provides a large quantity of real wine at a celebration where people are drinking freely.", "translationNote": "KJV's 'have well drunk' is a euphemism. The Greek verb specifically means 'become intoxicated.' Most modern translations soften it similarly, but the original is blunt.", "twisted": true, "twistedExplanation": "The KJV's 'have well drunk' obscures that the Greek verb methyskō specifically refers to intoxication. The architriklinos plainly says: once guests are drunk, you switch to cheap wine. This matters because it confirms the wine at the feast was genuinely alcoholic, not grape juice."}, {"english": "the worse / the cheaper", "original": "τὸν ἐλάσσω", "transliteration": "ton elassō", "pronunciation": "tohn eh-LAHS-soh", "strongs": "G1640", "partOfSpeech": "Adjective, accusative masculine singular (comparative)", "literalMeaning": "the lesser, the inferior", "definition": "Elassōn is the comparative form of an adjective meaning 'less, lesser, inferior.' It refers to wine of lower quality — not spoiled, but cheaper and less refined. The comparison is key: the normal progression is from better to worse, but Jesus reverses this pattern. Theologically, this reversal declares that God's best is still to come — the messianic age surpasses everything that preceded it. The old covenant was good; the new covenant is better.", "translationNote": "KJV's 'that which is worse' is slightly too negative; 'cheaper' or 'inferior' better captures the comparative sense.", "twisted": false, "twistedExplanation": null}, {"english": "you have kept", "original": "τετήρηκας", "transliteration": "tetērēkas", "pronunciation": "teh-TAY-ray-kahs", "strongs": "G5083", "partOfSpeech": "Verb, perfect active indicative, 2nd person singular", "literalMeaning": "you have kept, guarded, preserved", "definition": "Tēreō means 'to keep, to guard, to preserve, to hold in reserve.' The perfect tense indicates a completed action with present results — 'you have kept and it is still kept.' This is a theologically rich verb in John: Jesus 'keeps' his disciples (17:12), believers are told to 'keep' his commandments (14:15), and the Father 'keeps' Jesus' followers (17:11). Here the architriklinos unknowingly proclaims divine truth: God has indeed 'kept' — reserved, preserved — the best until the coming of Christ.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "until now", "original": "ἕως ἄρτι", "transliteration": "heōs arti", "pronunciation": "HEH-ohs AHR-tee", "strongs": "G737", "partOfSpeech": "Preposition + Adverb", "literalMeaning": "until just now, until this moment", "definition": "Arti means 'just now, at this very moment, right now.' Combined with heōs ('until'), it means 'up to this very moment.' The architriklinos speaks of wine timing, but John's readers hear a deeper declaration: God has been saving the best until now — until the arrival of the Messiah. The same expression appears in John 16:24 where Jesus tells his disciples they have not yet asked in his name 'until now.' The phrase marks a pivotal transition from waiting to fulfillment.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 11, "verseText": "This beginning of miracles did Jesus in Cana of Galilee, and manifested forth his glory; and his disciples believed on him.", "freshTranslation": "This, the first of his signs, Jesus performed in Cana of Galilee. He revealed his glory, and his disciples put their trust in him.", "historicalContext": "John explicitly labels this as the 'beginning of signs' — the first in a carefully selected series of seven signs that structure John's Gospel. John never uses the word 'miracle' (teras/dynamis); he consistently calls them 'signs' (sēmeia) because their purpose is not raw power but revelation — they point beyond themselves to Jesus' identity. The result is that Jesus' glory was 'manifested' (made visible) and the disciples believed. This is John's theology of signs in miniature: signs reveal glory, glory produces faith.", "crossRefs": [{"ref": "John 20:30-31", "explanation": "John's purpose statement — signs were written so that readers might believe"}, {"ref": "Exodus 7:3", "explanation": "Moses' signs in Egypt — Jesus' signs parallel and surpass Moses'"}, {"ref": "John 1:14", "explanation": "'We beheld his glory' — the Cana sign fulfills this promise"}], "words": [{"english": "This beginning of miracles / This first of signs", "original": "ταύτην ἀρχὴν τῶν σημείων", "transliteration": "tautēn archēn tōn sēmeiōn", "pronunciation": "TOW-tayn ar-KHAYN tohn say-MAY-ohn", "strongs": "G4592", "partOfSpeech": "Demonstrative pronoun + Noun (accusative feminine singular) + Article + Noun (genitive neuter plural)", "literalMeaning": "this beginning/first of the signs", "definition": "Sēmeion (plural: sēmeia) means 'sign, mark, token, indication.' It comes from sēma ('a mark, a signal'). John deliberately avoids the Synoptic terms for miracles — dynamis ('power, mighty work') and teras ('wonder, portent') — preferring sēmeion because it emphasizes meaning over spectacle. A sign points beyond itself to a deeper reality. John selects seven signs from Jesus' ministry (this, healing the official's son, the lame man, feeding 5000, walking on water, the blind man, and raising Lazarus), each revealing a different aspect of Jesus' divine identity. This is sign number one.", "translationNote": "KJV's 'miracles' is a significant mistranslation of sēmeion. 'Signs' is the correct and theologically important translation — these are revelatory acts, not mere displays of power.", "twisted": true, "twistedExplanation": "John's deliberate use of 'signs' (sēmeia) rather than 'miracles' or 'wonders' is a key theological choice. Signs point to something — they reveal Jesus' identity and glory. Translating sēmeion as 'miracle' shifts the focus from meaning to spectacle, undermining John's entire theological framework."}, {"english": "manifested / revealed", "original": "ἐφανέρωσεν", "transliteration": "ephanerōsen", "pronunciation": "eh-fah-NEH-roh-sen", "strongs": "G5319", "partOfSpeech": "Verb, aorist active indicative, 3rd person singular", "literalMeaning": "made visible, revealed, displayed", "definition": "Phaneroō means 'to make visible, to reveal, to manifest, to make known what was hidden.' It comes from phaneros ('visible, evident, known'). This verb is crucial in John's theology: Jesus' glory exists eternally (1:1-2, 17:5), but through signs it becomes visible to human eyes. The aorist tense marks this as a definitive revelatory moment — glory that was hidden broke through into visibility at Cana. The word appears throughout John and 1 John for God's self-disclosure in Christ (1 John 1:2, 3:5, 3:8).", "translationNote": "KJV's 'manifested forth' is slightly redundant but captures the Greek sense of making visible what was previously hidden.", "twisted": false, "twistedExplanation": null}, {"english": "his glory", "original": "τὴν δόξαν αὐτοῦ", "transliteration": "tēn doxan autou", "pronunciation": "tayn DOH-ksahn ow-TOO", "strongs": "G1391", "partOfSpeech": "Article + Noun (accusative feminine singular) + Pronoun (genitive masculine singular)", "literalMeaning": "the glory/splendor of him", "definition": "Doxa means 'glory, splendor, radiance, honor, reputation.' In classical Greek it meant 'opinion' or 'reputation,' but in the Septuagint it translates the Hebrew kavod — the weighty, luminous, overwhelming presence of God himself (Exodus 33:18-22, Isaiah 6:3). John 1:14 promised 'we saw his glory, glory as of the only Son from the Father.' Now at Cana, that promise is fulfilled. Jesus' glory is not raw power but generous abundance — transforming water into wine at a family celebration. God's glory looks like extravagant provision.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "believed on him / put their trust in him", "original": "ἐπίστευσαν εἰς αὐτόν", "transliteration": "episteusan eis auton", "pronunciation": "eh-PEES-tyoo-sahn ace ow-TOHN", "strongs": "G4100", "partOfSpeech": "Verb (aorist active indicative, 3rd person plural) + Preposition + Pronoun (accusative masculine singular)", "literalMeaning": "they believed into him", "definition": "Pisteuō means 'to believe, to trust, to have faith, to entrust oneself to.' John's distinctive construction pisteuō eis ('believe into') appears nearly 40 times in his Gospel and is rare elsewhere in Greek literature. It expresses not mere intellectual assent ('I believe that...') but personal trust and commitment — a movement of the whole self toward the object of faith. The preposition eis ('into') conveys directional, dynamic faith — entering into a trusting relationship with Jesus. This is the purpose of signs: to produce this kind of self-committing faith.", "translationNote": "KJV's 'believed on him' preserves the directional preposition better than 'believed in him,' but 'put their trust in him' best captures the active, relational nature of pisteuō eis.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 12, "verseText": "After this he went down to Capernaum, he, and his mother, and his brethren, and his disciples: and they continued there not many days.", "freshTranslation": "After this, he went down to Capernaum — he, his mother, his brothers, and his disciples — and they stayed there only a few days.", "historicalContext": "Capernaum sat on the northwest shore of the Sea of Galilee, about 700 feet below sea level — hence 'went down' from the Galilean hills where Cana sat. It became Jesus' home base for his Galilean ministry (Matthew 4:13 calls it 'his own city'). The mention of Jesus' 'brothers' (adelphoi) has sparked centuries of debate: were they biological siblings (the Protestant view), half-brothers through Joseph (the Eastern Orthodox view), or cousins (the Roman Catholic view)? The brief stay anticipates the move to Jerusalem for Passover in the next verse.", "crossRefs": [{"ref": "Matthew 4:13", "explanation": "Jesus settles in Capernaum — it becomes his base of operations"}, {"ref": "Mark 6:3", "explanation": "Names Jesus' brothers: James, Joses, Judas, and Simon"}], "words": [{"english": "went down", "original": "κατέβη", "transliteration": "katebē", "pronunciation": "kah-TEH-bay", "strongs": "G2597", "partOfSpeech": "Verb, aorist active indicative, 3rd person singular", "literalMeaning": "went down, descended", "definition": "Katabainō means 'to go down, to descend, to come down.' This is geographical precision: Cana sits in the hills of lower Galilee at approximately 800 feet above sea level, while Capernaum lies on the shore of the Sea of Galilee at about 700 feet below sea level — a descent of roughly 1,500 feet. John's topographical accuracy reflects firsthand knowledge of the terrain. The verb also carries theological resonance in John, where Jesus 'comes down' from heaven (3:13, 6:33, 6:38).", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "to Capernaum", "original": "εἰς Καφαρναούμ", "transliteration": "eis Kapharnaoum", "pronunciation": "ace kah-far-nah-OOM", "strongs": "G2584", "partOfSpeech": "Preposition + Proper noun, indeclinable", "literalMeaning": "village of Nahum / village of comfort", "definition": "Kapharnaoum (Hebrew: Kfar Nahum) means 'village of Nahum' or possibly 'village of comfort' (from the Hebrew root naham). It was a fishing village on the northwestern shore of the Sea of Galilee with a population of perhaps 1,500. Archaeological excavations have uncovered a first-century synagogue foundation, residential areas, and a structure traditionally identified as Peter's house. The town sat on a major trade route (the Via Maris) and had a customs station (where Matthew/Levi was called). Jesus made it his primary base after leaving Nazareth.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "his brothers", "original": "οἱ ἀδελφοὶ αὐτοῦ", "transliteration": "hoi adelphoi autou", "pronunciation": "hoy ah-del-FOY ow-TOO", "strongs": "G80", "partOfSpeech": "Noun, nominative masculine plural, with article and pronoun", "literalMeaning": "the brothers of him", "definition": "Adelphos (plural: adelphoi) literally means 'from the same womb' (a- 'same' + delphys 'womb'), and primarily denotes a biological brother. The NT mentions Jesus' brothers by name (James, Joses, Judas, Simon — Mark 6:3) and also refers to sisters. The natural reading of adelphoi is 'siblings,' and most Protestant scholars accept this, while Catholic tradition maintains they were cousins (based on the argument that adelphos can mean 'relative') and Orthodox tradition holds they were Joseph's children from a prior marriage. In John's narrative, Jesus' brothers are distinct from his disciples and initially skeptical of him (7:5).", "translationNote": "KJV's 'brethren' is accurate but archaic. 'Brothers' is the natural modern equivalent.", "twisted": false, "twistedExplanation": null}, {"english": "not many days", "original": "οὐ πολλὰς ἡμέρας", "transliteration": "ou pollas hēmeras", "pronunciation": "oo pohl-LAHS hay-MEH-rahs", "strongs": "G4183", "partOfSpeech": "Negative particle + Adjective (accusative feminine plural) + Noun (accusative feminine plural)", "literalMeaning": "not many days", "definition": "This temporal marker creates a transition — the family visit to Capernaum is brief because the Passover is approaching and Jesus will go up to Jerusalem. John's precision about time sequences throughout these early chapters (day one, next day, third day, not many days, then Passover) creates a careful chronological framework. The brevity of the stay suggests purpose and urgency: Jesus is moving toward Jerusalem and the confrontation that awaits there.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 13, "verseText": "And the Jews' passover was at hand, and Jesus went up to Jerusalem,", "freshTranslation": "The Jewish Passover was near, and Jesus went up to Jerusalem.", "historicalContext": "This is the first of three Passovers mentioned in John's Gospel (2:13, 6:4, 11:55), which is why scholars date Jesus' ministry at approximately three years. 'Went up' is both geographical (Jerusalem sits at 2,500 feet elevation) and theological — one always 'goes up' to Jerusalem in Jewish parlance because the Temple, God's dwelling place, is the highest spiritual point on earth. Passover commemorated the Exodus from Egypt and required pilgrimage to Jerusalem for all able-bodied Jewish males within a reasonable distance.", "crossRefs": [{"ref": "Exodus 12:1-14", "explanation": "The institution of Passover — the foundational event Jesus' actions will reinterpret"}, {"ref": "Deuteronomy 16:16", "explanation": "Three annual pilgrimage festivals requiring Jerusalem attendance"}], "words": [{"english": "the Passover", "original": "τὸ πάσχα", "transliteration": "to pascha", "pronunciation": "toh PAHS-khah", "strongs": "G3957", "partOfSpeech": "Noun, nominative neuter singular, with article", "literalMeaning": "Passover (from Hebrew pesach — to pass over, to spare)", "definition": "Pascha comes from the Hebrew pesach, recalling the night when the angel of death 'passed over' Israelite homes marked with lamb's blood during the tenth plague in Egypt (Exodus 12). Passover was the most important Jewish festival, celebrated on Nisan 14-15 (March/April), combining the sacrifice of the Passover lamb at the Temple with a family meal featuring unleavened bread, bitter herbs, and wine. Hundreds of thousands of pilgrims flooded Jerusalem for the week-long celebration. John's placement of the Temple cleansing at the first Passover (rather than the final one as in the Synoptics) frames Jesus' entire ministry between Passover bookends — he is the true Passover lamb.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "of the Jews", "original": "τῶν Ἰουδαίων", "transliteration": "tōn Ioudaiōn", "pronunciation": "tohn ee-oo-DYE-ohn", "strongs": "G2453", "partOfSpeech": "Noun, genitive masculine plural, with article", "literalMeaning": "of the Judeans/Jews", "definition": "Ioudaios (plural: Ioudaioi) means 'Judean' or 'Jew.' John's use of this term is complex and much debated. He uses it over 70 times — far more than the other Gospels. Sometimes it refers to the Jewish people generally, sometimes to the Judean authorities specifically (particularly the Temple leadership), and sometimes it serves as an explanatory note for Gentile readers ('the Passover of the Jews'). The phrase 'the Jews' Passover' is not hostile but explanatory — John clarifies Jewish customs for his predominantly Gentile audience in Asia Minor.", "translationNote": "The phrase 'the Jews' Passover' can sound othering to modern readers, as if John is distancing himself from Judaism. In context, it's an authorial explanation for non-Jewish readers, not a dismissal.", "twisted": false, "twistedExplanation": null}, {"english": "went up", "original": "ἀνέβη", "transliteration": "anebē", "pronunciation": "ah-NEH-bay", "strongs": "G305", "partOfSpeech": "Verb, aorist active indicative, 3rd person singular", "literalMeaning": "went up, ascended", "definition": "Anabainō means 'to go up, to ascend, to climb.' It is the opposite of katabainō (v.12, 'went down'). One always 'goes up' to Jerusalem in biblical language, regardless of starting point — this reflects both geography (Jerusalem sits atop the Judean hills) and theology (the Temple is the spiritual apex of the world). The Hebrew equivalent aliyah ('going up') still describes Jewish immigration to Israel today. Jesus' ascent to Jerusalem for Passover follows the Torah's requirement for pilgrimage but sets the stage for a confrontation that will redefine what the Temple means.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "to Jerusalem", "original": "εἰς Ἱεροσόλυμα", "transliteration": "eis Hierosolyma", "pronunciation": "ace hee-eh-ROH-soh-loo-mah", "strongs": "G2414", "partOfSpeech": "Preposition + Proper noun, neuter plural", "literalMeaning": "city of peace (from Hebrew Yerushalayim)", "definition": "Hierosolyma is the Hellenized form of the Hebrew Yerushalayim, traditionally understood to mean 'foundation of peace' or 'city of peace' (from yeru + shalom). By Jesus' time, Jerusalem was a bustling city of perhaps 30,000-40,000 residents that swelled to 200,000+ during pilgrimage festivals. The Temple dominated the city physically and spiritually — Herod the Great's massive renovation project had transformed it into one of the wonders of the ancient world. John uses two forms of the name: Hierosolyma (the Hellenized form, used here) and Hierousalēm (the more Hebraic form, used in Revelation).", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 14, "verseText": "And found in the temple those that sold oxen and sheep and doves, and the changers of money sitting:", "freshTranslation": "In the temple courts he found people selling cattle, sheep, and doves, and money changers seated at their tables.", "historicalContext": "The selling took place in the Court of the Gentiles — the outermost court of the Temple complex, the only area where non-Jews could come to pray. The animal sellers provided sacrificial animals for pilgrims who had traveled too far to bring their own. Money changers converted foreign currency into the Tyrian shekel (the only currency accepted for the Temple tax) since Roman coins bore the emperor's image, considered idolatrous. While these services were legitimate in principle, they had become exploitative — the high priestly family of Annas controlled the market, charging inflated prices and trapping pilgrims into a system of commercial religion.", "crossRefs": [{"ref": "Malachi 3:1-3", "explanation": "'The Lord whom you seek will suddenly come to his temple... he will purify the sons of Levi'"}, {"ref": "Matthew 21:12-13", "explanation": "Synoptic account of the Temple cleansing, placed during Passion Week"}, {"ref": "Zechariah 14:21", "explanation": "'There shall no longer be a trader in the house of the LORD' — messianic promise"}], "words": [{"english": "in the temple", "original": "ἐν τῷ ἱερῷ", "transliteration": "en tō hierō", "pronunciation": "en toh hee-eh-ROH", "strongs": "G2411", "partOfSpeech": "Preposition + Article + Noun, dative neuter singular", "literalMeaning": "in the sacred precinct", "definition": "Hieron refers to the entire Temple complex — all the courts, buildings, and grounds — as distinct from naos (v.19-21), which refers specifically to the inner sanctuary where God dwells. The hieron encompassed about 35 acres and included the Court of the Gentiles, the Court of Women, the Court of Israel, the Court of the Priests, and the sanctuary itself. Herod the Great began its massive renovation in 20 BC, and construction continued until 63 AD — only seven years before its destruction in 70 AD. The selling took place in the outermost court, the Court of the Gentiles.", "translationNote": "Accurate, though the distinction between hieron (temple complex) and naos (inner sanctuary) — crucial in verses 19-21 — is lost in English where both are translated 'temple.'", "twisted": false, "twistedExplanation": null}, {"english": "selling", "original": "πωλοῦντας", "transliteration": "pōlountas", "pronunciation": "poh-LOON-tahs", "strongs": "G4453", "partOfSpeech": "Verb, present active participle, accusative masculine plural", "literalMeaning": "selling, trading", "definition": "Pōleō means 'to sell, to trade, to deal in.' The present participle indicates ongoing, habitual activity — this was not a one-time occurrence but an established commercial operation in the Temple courts. The sellers were likely licensed by the Temple authorities (the high priestly family), creating a monopoly that exploited pilgrims. Animals brought from outside might be declared ritually unfit by Temple inspectors, forcing pilgrims to buy approved animals at inflated prices. This system turned worship into commerce.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "oxen", "original": "βόας", "transliteration": "boas", "pronunciation": "BOH-ahs", "strongs": "G1016", "partOfSpeech": "Noun, accusative masculine plural", "literalMeaning": "cattle, oxen", "definition": "Bous means 'ox, cow, cattle.' Cattle were the most expensive sacrificial animals, used for major offerings by the wealthy or for communal sacrifices. A single ox could represent weeks or months of income for an ordinary family. Their presence in the Temple court — large, noisy animals in a sacred space — highlights the degree to which commerce had overtaken worship. The bellowing of cattle, the bleating of sheep, and the cooing of doves would have filled the Court of the Gentiles with the sounds and smells of a livestock market.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "sheep", "original": "πρόβατα", "transliteration": "probata", "pronunciation": "PROH-bah-tah", "strongs": "G4263", "partOfSpeech": "Noun, accusative neuter plural", "literalMeaning": "sheep", "definition": "Probaton means 'sheep' — literally 'that which walks forward' (from pro + bainō). Sheep were the standard Passover sacrifice; each family needed a lamb for the Passover meal (Exodus 12:3-6). With hundreds of thousands of pilgrims needing lambs, the demand was enormous and the profit margins significant. The Passover lamb was to be 'without blemish' (Exodus 12:5), and Temple inspectors had the authority to reject animals — driving pilgrims to buy pre-approved (and overpriced) Temple stock. Jesus himself is called 'the Lamb of God' (John 1:29).", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "doves", "original": "περιστεράς", "transliteration": "peristeras", "pronunciation": "peh-rees-teh-RAHS", "strongs": "G4058", "partOfSpeech": "Noun, accusative feminine plural", "literalMeaning": "doves, pigeons", "definition": "Peristera means 'dove' or 'pigeon.' Doves were the offering of the poor — those who could not afford a sheep or ox could offer two doves instead (Leviticus 5:7, 12:8). Mary and Joseph offered doves at Jesus' own presentation (Luke 2:24), indicating their poverty. The exploitation of dove sellers was particularly cruel because it preyed on the poorest worshippers. The Mishnah records that Rabbi Simeon ben Gamaliel intervened when dove prices skyrocketed during a shortage, calling the price gouging a moral outrage.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "money changers", "original": "κερματιστάς", "transliteration": "kermatistas", "pronunciation": "ker-mah-tees-TAHS", "strongs": "G2773", "partOfSpeech": "Noun, accusative masculine plural", "literalMeaning": "coin dealers, small-change makers", "definition": "Kermatistēs means 'money changer, coin dealer' — from kerma ('small coin, small change'), itself from keirō ('to cut'). These were currency exchange agents who converted foreign coins into the Tyrian shekel, the only currency accepted for the annual Temple tax (half-shekel per adult male). Every Jewish man over 20 was required to pay this tax (Exodus 30:13-16). The exchange rate was not standardized, and money changers could charge whatever the market would bear. A different Greek word (kollybistēs — from kollybos, 'small coin/commission') is used in verse 15, suggesting multiple types of financial operators.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "sitting", "original": "καθημένους", "transliteration": "kathēmenous", "pronunciation": "kah-THAY-meh-noos", "strongs": "G2521", "partOfSpeech": "Verb, present middle/passive participle, accusative masculine plural", "literalMeaning": "sitting, seated", "definition": "Kathēmai means 'to sit, to be seated.' The money changers sat behind tables (trapezai — the origin of 'bank,' from Italian banca, 'bench/table'). Their seated posture suggests established, permanent operations — not itinerant traders but fixtures of the Temple economy. The detail adds to the picture of commercial entrenchment: these weren't temporary stalls but an institutionalized marketplace that had colonized sacred space.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 15, "verseText": "And when he had made a scourge of small cords, he drove them all out of the temple, and the sheep, and the oxen; and poured out the changers' money, and overthrew the tables;", "freshTranslation": "So he made a whip out of cords and drove them all out of the temple courts, both the sheep and the cattle. He scattered the coins of the money changers and overturned their tables.", "historicalContext": "Jesus takes deliberate, physical action — he doesn't act impulsively but takes time to braid a whip from cords (likely the rushes used to tether animals). This is controlled prophetic action, not a rage-driven tantrum. The whip was primarily for driving out the animals, but the action disrupted the entire commercial operation. Overturning the money changers' tables would have sent coins rolling across the stone pavement. This act echoes the prophets who performed dramatic symbolic actions to deliver God's message (Ezekiel lying on his side, Jeremiah breaking a pot). Jesus acts with the authority of the Temple's true owner.", "crossRefs": [{"ref": "Malachi 3:1-3", "explanation": "The Lord suddenly comes to his temple to purify — Jesus fulfills this prophecy"}, {"ref": "Jeremiah 7:11", "explanation": "'Has this house become a den of robbers?' — prophetic anger at Temple corruption"}, {"ref": "Isaiah 56:7", "explanation": "'My house shall be called a house of prayer for all peoples' — the Court of the Gentiles was being denied its purpose"}], "words": [{"english": "a whip", "original": "φραγέλλιον", "transliteration": "phragellion", "pronunciation": "frah-GHEL-lee-ohn", "strongs": "G5416", "partOfSpeech": "Noun, accusative neuter singular", "literalMeaning": "a whip, a scourge", "definition": "Phragellion is a Latin loanword in Greek (from Latin flagellum, 'whip'), appearing only here in the New Testament. It denotes a whip or scourge, though the addition 'of cords' (ek schoiniōn) suggests something improvised from rope or rushes rather than the brutal Roman flagellum with embedded metal and bone used for torture. Jesus fashions this deliberately — it takes time to braid a whip, showing this is calculated prophetic action, not an explosion of temper. The whip serves primarily to drive out the animals, though the human sellers clearly take the hint.", "translationNote": "KJV's 'scourge' may evoke the brutal Roman flagellation, which is misleading. This was an improvised cattle-driving whip, not a torture instrument.", "twisted": false, "twistedExplanation": null}, {"english": "of small cords", "original": "ἐκ σχοινίων", "transliteration": "ek schoiniōn", "pronunciation": "ek skhoy-NEE-ohn", "strongs": "G4979", "partOfSpeech": "Preposition + Noun, genitive neuter plural", "literalMeaning": "from/out of rushes/ropes", "definition": "Schoinion means 'a cord, a rope, a rush.' It derives from schoinos ('a rush,' the plant used to make rope). These were likely the cords or rushes lying around the Temple court, used to tether the animals being sold. Jesus repurposes the commercial infrastructure itself — the tools of the merchants become the instrument of their expulsion. The diminutive form and the material (plant fiber) reinforce that this was an improvised cattle prod, not a weapon designed to injure people.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "drove out", "original": "ἐξέβαλεν", "transliteration": "exebalen", "pronunciation": "ex-EH-bah-len", "strongs": "G1544", "partOfSpeech": "Verb, aorist active indicative, 3rd person singular", "literalMeaning": "threw out, cast out, drove out", "definition": "Ekballō means 'to throw out, to drive out, to expel' — a compound of ek ('out of') and ballō ('to throw'). This is a forceful verb used for casting out demons (Mark 1:34), expelling people from synagogues (John 9:34-35), and removing the worthless servant (Matthew 25:30). Jesus' action is decisive and authoritative — he single-handedly disrupts a massive commercial operation in the most heavily guarded public space in Jerusalem. That no one stops him suggests a momentary recognition of prophetic authority; the Temple police and Roman garrison in the Antonia Fortress overlook the court but do not intervene.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "all", "original": "πάντας", "transliteration": "pantas", "pronunciation": "PAHN-tahs", "strongs": "G3956", "partOfSpeech": "Adjective, accusative masculine plural", "literalMeaning": "all, every one", "definition": "Pas means 'all, every, the whole.' The scope of Jesus' action is total — he drives out everyone involved in the commercial activity, not selectively. The word emphasizes the comprehensiveness of the cleansing. Whether 'all' refers only to the animals (the sheep and oxen that follow) or includes the human sellers is grammatically ambiguous, but the overturning of tables in the same verse shows the human operators were expelled as well.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "poured out the coins", "original": "τὰ κέρματα ἐξέχεεν", "transliteration": "ta kermata execheen", "pronunciation": "tah KER-mah-tah ex-EH-kheh-en", "strongs": "G2772", "partOfSpeech": "Article + Noun (accusative neuter plural) + Verb (aorist active indicative, 3rd singular)", "literalMeaning": "the small coins he poured out", "definition": "Kerma (plural: kermata) means 'small coin, piece of money' — from keirō ('to cut'), referring to cut metal pieces used as currency. Ekcheō means 'to pour out, to spill.' Jesus literally upends the financial operations, sending coins scattering across the pavement. The image is vivid and chaotic: money changers scrambling after their coins in the dust. This is not just disruption but symbolic destruction of the commercial system that had corrupted worship. The verb ekcheō is also used for the 'pouring out' of the Holy Spirit (Acts 2:17-18) and Jesus' blood — overturning one economy to establish another.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "overturned the tables", "original": "τὰς τραπέζας ἀνέστρεψεν", "transliteration": "tas trapezas anestrepsen", "pronunciation": "tahs TRAH-peh-zahs ah-NEH-strep-sen", "strongs": "G5132", "partOfSpeech": "Article + Noun (accusative feminine plural) + Verb (aorist active indicative, 3rd singular)", "literalMeaning": "the tables he overturned/upset", "definition": "Trapeza means 'table' — literally 'four-footed' (from tetra + peza). In banking contexts, the table where money was exchanged gave us the word 'bank' (via Italian banco, 'bench/table'). Anastrephō means 'to turn upside down, to overturn.' Jesus physically flips the money changers' tables — the very infrastructure of Temple commerce. This is the most physically aggressive act recorded of Jesus in any Gospel. The overturned tables become an enduring image of divine judgment against the corruption of sacred institutions.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 16, "verseText": "And said unto them that sold doves, Take these things hence; make not my Father's house an house of merchandise.", "freshTranslation": "To the dove sellers he said, 'Take these things out of here! Stop making my Father's house a marketplace!'", "historicalContext": "Jesus singles out the dove sellers for a verbal command rather than physical action — perhaps because doves in cages couldn't be driven out with a whip; they had to be carried. The dove sellers represented the most vulnerable end of the economic spectrum, selling to the poorest worshippers. Jesus' words 'my Father's house' are an extraordinary claim to divine sonship — he doesn't say 'God's house' but 'my Father's house,' asserting a unique filial relationship. The accusation of making it an 'emporion' (marketplace/emporium) echoes Zechariah 14:21's promise that 'there shall no longer be a trader in the house of the LORD of hosts.'", "crossRefs": [{"ref": "Zechariah 14:21", "explanation": "'There shall no longer be a trader in the house of the LORD' — messianic promise fulfilled"}, {"ref": "Luke 2:49", "explanation": "The twelve-year-old Jesus: 'Did you not know I must be in my Father's house?' — same claim"}, {"ref": "Malachi 3:1", "explanation": "The Lord comes suddenly to his temple — Jesus acts as the Temple's owner"}], "words": [{"english": "those selling doves", "original": "τοῖς τὰς περιστερὰς πωλοῦσιν", "transliteration": "tois tas peristeras pōlousin", "pronunciation": "toys tahs peh-rees-teh-RAHS poh-LOO-sin", "strongs": "G4058", "partOfSpeech": "Article + Article + Noun (accusative feminine plural) + Verb (present active participle, dative masculine plural)", "literalMeaning": "to the ones selling the doves", "definition": "Jesus addresses the dove sellers specifically and separately from the cattle and sheep merchants. Doves were the sacrifice of the poor (Leviticus 5:7, 12:8) — those who couldn't afford larger animals. Mary and Joseph themselves offered doves at Jesus' dedication (Luke 2:24). That Jesus specifically confronts those exploiting the poorest worshippers shows particular concern for the marginalized. He uses words rather than the whip, but his command is absolute: take these things away.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Take these things hence / out of here", "original": "ἄρατε ταῦτα ἐντεῦθεν", "transliteration": "arate tauta enteuthen", "pronunciation": "AH-rah-teh TOW-tah en-TYOO-then", "strongs": "G142", "partOfSpeech": "Verb (aorist active imperative, 2nd plural) + Pronoun (accusative neuter plural) + Adverb", "literalMeaning": "lift up / carry away these things from here", "definition": "Airō means 'to lift up, to take away, to carry off, to remove.' The aorist imperative demands immediate action — not 'please consider removing' but 'take them away now.' Enteuthen means 'from this place, from here.' The command covers everything — the doves, the cages, the tables, the entire commercial apparatus. Jesus exercises absolute authority over the Temple space. John the Baptist used the same language for Jesus: 'the Lamb of God who takes away (airōn) the sin of the world' (1:29). The one who removes sin also removes corruption.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "my Father's house", "original": "τὸν οἶκον τοῦ πατρός μου", "transliteration": "ton oikon tou patros mou", "pronunciation": "tohn OY-kohn too pah-TROHS moo", "strongs": "G3624", "partOfSpeech": "Article + Noun (accusative masculine singular) + Article + Noun (genitive masculine singular) + Pronoun (genitive, 1st singular)", "literalMeaning": "the house of the Father of me", "definition": "Oikos means 'house, household, dwelling.' Patēr means 'father.' Jesus' claim that the Temple is 'my Father's house' is a stunning assertion of unique divine sonship. He does not say 'our Father' (as in the Lord's Prayer) or 'God's house' but 'my Father's house' — claiming a personal, exclusive filial relationship with the God who dwells in the Temple. This echoes the twelve-year-old Jesus' words in Luke 2:49. In John's theology, Jesus' entire identity is defined by his relationship to the Father (5:17-23, 10:30, 14:9). The claim implicitly positions Jesus as the heir — the son of the house's owner.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "a house of merchandise / a marketplace", "original": "οἶκον ἐμπορίου", "transliteration": "oikon emporiou", "pronunciation": "OY-kohn em-poh-REE-oo", "strongs": "G1712", "partOfSpeech": "Noun (accusative masculine singular) + Noun (genitive neuter singular)", "literalMeaning": "a house of commerce/trade", "definition": "Emporion means 'a place of trade, a marketplace, a commercial center.' It comes from emporos ('merchant, trader' — literally 'one who travels for trade,' from en + poros, 'in/on a journey'), which gives us the English 'emporium.' Jesus accuses the Temple establishment of turning God's dwelling into a shopping mall. The contrast between 'my Father's house' and 'house of merchandise' is sharp: the Temple should be defined by its owner (God) and purpose (worship, prayer), not by its commercial activity. John's version is slightly different from the Synoptics' 'den of robbers' (quoting Jeremiah 7:11) — John focuses on the commercial nature of the corruption rather than the thievery.", "translationNote": "KJV's 'house of merchandise' is accurate. Modern 'marketplace' captures the commercial bustling more vividly.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 17, "verseText": "And his disciples remembered that it was written, The zeal of thine house hath eaten me up.", "freshTranslation": "His disciples recalled that it is written: 'Zeal for your house will consume me.'", "historicalContext": "The disciples connect Jesus' action to Psalm 69:9, a messianic psalm of David. The original psalmist suffered because of his passionate devotion to God's house — his zeal 'ate him up' (consumed/destroyed him). The disciples see Jesus embodying this same consuming passion. Importantly, the future tense 'will consume me' (kataphagetai) — different from the Septuagint's aorist 'consumed me' — points forward to the cost Jesus will pay: his zeal for God's house will ultimately lead to his death. The Temple cleansing is the act that provokes the authorities' murderous opposition.", "crossRefs": [{"ref": "Psalm 69:9", "explanation": "The source quotation — a psalm of righteous suffering that the NT frequently applies to Jesus"}, {"ref": "Romans 15:3", "explanation": "Paul quotes the second half of Psalm 69:9 as applying to Christ"}], "words": [{"english": "remembered", "original": "ἐμνήσθησαν", "transliteration": "emnēsthēsan", "pronunciation": "em-NAYS-thay-sahn", "strongs": "G3415", "partOfSpeech": "Verb, aorist passive indicative, 3rd person plural", "literalMeaning": "they remembered, recalled", "definition": "Mimnēskomai means 'to remember, to recall, to call to mind.' In John's Gospel, 'remembering' is a significant theological act — the disciples often understand Jesus' words and actions only in retrospect, after the resurrection (2:22, 12:16). The passive voice may suggest divine enabling: they were 'reminded' by the Spirit. Memory in John is not mere recollection but a Spirit-guided process of understanding (14:26: 'the Holy Spirit will remind you of everything I have told you'). The disciples don't fully understand in the moment but begin connecting Jesus to Scripture.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the zeal", "original": "ὁ ζῆλος", "transliteration": "ho zēlos", "pronunciation": "hoh ZAY-lohs", "strongs": "G2205", "partOfSpeech": "Noun, nominative masculine singular, with article", "literalMeaning": "zeal, fervor, jealousy, passionate devotion", "definition": "Zēlos means 'zeal, fervor, burning passion, jealousy.' It can be positive (righteous passion) or negative (envious jealousy), depending on context. The English 'zeal' and 'jealous' both derive from this word. In biblical usage, zeal for God is a consuming devotion that tolerates no rival — God himself is called 'jealous' (zēlōtēs, Exodus 20:5). Phinehas was famous for his zeal (Numbers 25:11-13), and the Zealot party took their name from this concept. Jesus' Temple action demonstrates zeal in its purest form: passionate devotion to God's honor that compels decisive action regardless of personal cost.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "of your house", "original": "τοῦ οἴκου σου", "transliteration": "tou oikou sou", "pronunciation": "too OY-koo soo", "strongs": "G3624", "partOfSpeech": "Article + Noun (genitive masculine singular) + Pronoun (genitive, 2nd singular)", "literalMeaning": "of the house of you", "definition": "The 'house' (oikos) here refers to God's Temple — his dwelling place among his people. The possessive 'your' (sou) addresses God directly, following the psalm's prayer form. In the psalm, David speaks of zeal for 'your house' — God's house. When the disciples apply this to Jesus, they recognize him as someone whose devotion to God's dwelling is absolute. This connects to Jesus' own claim: the Temple is 'my Father's house' (v.16). The zeal is personal because the relationship is personal.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "will consume me", "original": "καταφάγεταί με", "transliteration": "kataphagetai me", "pronunciation": "kah-tah-FAH-gheh-tai meh", "strongs": "G2719", "partOfSpeech": "Verb, future middle indicative, 3rd person singular + Pronoun (accusative, 1st singular)", "literalMeaning": "will eat me up, will devour me", "definition": "Katesthiō (future: kataphagetai) means 'to eat up, to devour, to consume.' It's a compound of kata ('down, completely') and esthiō ('to eat'). The metaphor is visceral: zeal doesn't just motivate Jesus — it devours him. Crucially, John changes the Septuagint's past tense ('consumed me') to future ('will consume me'), transforming a reflection on past suffering into a prophecy of future suffering. Jesus' zeal for God's house will literally consume him — it will cost him his life. The Temple cleansing sets him on a collision course with the authorities that ends at the cross.", "translationNote": "KJV's 'hath eaten me up' uses the past tense, following some manuscripts. The better manuscripts read the future tense: 'will consume me' — making this a prophecy of Jesus' death.", "twisted": true, "twistedExplanation": "The tense matters enormously. The future tense ('will consume me') turns this from a statement about past experience into a prophecy of Jesus' death. His zeal for God's house will literally devour him — the Temple authorities will kill him for this very act of prophetic confrontation."}]}, {"verseNumber": 18, "verseText": "Then answered the Jews and said unto him, What sign shewest thou unto us, seeing that thou doest these things?", "freshTranslation": "So the Jewish leaders responded, 'What sign can you show us to justify doing these things?'", "historicalContext": "The 'Jews' here likely refers to the Temple authorities — priests, Levites, and possibly members of the Sanhedrin who managed Temple operations. Their question is not unreasonable by biblical standards: Moses and the prophets authenticated their authority through signs (Exodus 4:1-9, 1 Kings 18:36-38). They're asking: 'By what authority do you disrupt Temple commerce, and what miraculous proof can you offer?' The request for a sign becomes a recurring motif in John — the authorities consistently demand signs while missing the signs already given (6:30).", "crossRefs": [{"ref": "Matthew 12:38", "explanation": "The scribes and Pharisees also demand a sign — and receive the sign of Jonah (death and resurrection)"}, {"ref": "Exodus 4:1-9", "explanation": "Moses authenticated his divine commission through signs — the precedent the authorities invoke"}], "words": [{"english": "the Jews", "original": "οἱ Ἰουδαῖοι", "transliteration": "hoi Ioudaioi", "pronunciation": "hoy ee-oo-DYE-oy", "strongs": "G2453", "partOfSpeech": "Noun, nominative masculine plural, with article", "literalMeaning": "the Judeans/Jews", "definition": "In this context, hoi Ioudaioi almost certainly refers to the Jerusalem Temple authorities — the priestly aristocracy and their representatives who managed Temple operations and would be directly threatened by Jesus' disruption of the marketplace they controlled and profited from. John uses this term in various ways throughout his Gospel. Here it denotes the religious establishment that will become Jesus' primary antagonists. Reading 'the Jews' as an ethnic category would be anachronistic and harmful; John himself was Jewish, as were Jesus and all his disciples.", "translationNote": "Modern translations increasingly render this as 'the Jewish leaders' or 'the Judean authorities' to avoid the anti-Semitic readings that 'the Jews' has historically invited. The Greek is ambiguous, but context points to the Temple leadership, not the Jewish people as a whole.", "twisted": true, "twistedExplanation": "Translating hoi Ioudaioi flatly as 'the Jews' has contributed to centuries of anti-Jewish interpretation. In John's Gospel, the term most often refers to the religious authorities in Jerusalem, not the Jewish people collectively. Jesus, his mother, his disciples, and John himself were all Jewish. Context must determine meaning."}, {"english": "what sign", "original": "τί σημεῖον", "transliteration": "ti sēmeion", "pronunciation": "tee say-MAY-ohn", "strongs": "G4592", "partOfSpeech": "Interrogative pronoun + Noun, accusative neuter singular", "literalMeaning": "what sign/indication", "definition": "Sēmeion again — 'sign.' The authorities demand a validating sign because prophetic claims required authentication. The irony is thick: Jesus has just performed a dramatic prophetic action that is itself a sign, but they want something more. Throughout John, people who demand signs on their own terms miss the signs already being given (4:48, 6:30). The request is not inherently wrong — discernment is legitimate — but it becomes a strategy of evasion when the sign-seeker has already decided not to believe.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "do you show us", "original": "δεικνύεις ἡμῖν", "transliteration": "deiknueis hēmin", "pronunciation": "DIKE-noo-ace hay-MEEN", "strongs": "G1166", "partOfSpeech": "Verb, present active indicative, 2nd person singular + Pronoun, dative 1st person plural", "literalMeaning": "do you show/display to us", "definition": "Deiknymi means 'to show, to point out, to display, to prove.' The present tense asks: 'What sign are you showing us?' — demanding immediate proof. The word implies visual demonstration — they want something they can see and evaluate. In John, Jesus 'shows' the disciples greater things (1:50, 5:20, 14:8-9), but he shows them to those who have eyes to see. The authorities' demand for a sign they can evaluate on their terms becomes a barrier rather than a bridge to faith.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "seeing that / since", "original": "ὅτι", "transliteration": "hoti", "pronunciation": "HOH-tee", "strongs": "G3754", "partOfSpeech": "Conjunction", "literalMeaning": "that, because, since", "definition": "Hoti is a versatile conjunction meaning 'that' (introducing content clauses) or 'because/since' (introducing causal clauses). Here it's causal: 'since you are doing these things, what sign do you offer?' The conjunction links Jesus' prophetic action to their demand for authentication. They acknowledge that he has done something extraordinary but want proof of divine authorization. The logic is: extraordinary claims require extraordinary evidence.", "translationNote": "KJV's 'seeing that' is archaic for 'since' or 'because.'", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 19, "verseText": "Jesus answered and said unto them, Destroy this temple, and in three days I will raise it up.", "freshTranslation": "Jesus answered them, 'Tear down this temple, and in three days I will raise it up.'", "historicalContext": "This is one of Jesus' most provocative statements. Standing in the Temple courts — the center of Jewish worship, identity, and national pride — He challenges them to destroy it and claims He'll rebuild it in three days. They naturally assume He means Herod's Temple, which had been under construction for 46 years. But John will explain He meant His body. This statement was later used as evidence against Him at His trial (Mark 14:58).", "crossRefs": [{"ref": "Mark 14:58", "explanation": "At Jesus' trial, witnesses testified: 'We heard him say, I will destroy this temple made with hands, and in three days I will build another not made with hands.' They misquoted Him — He said 'destroy' (you do it), not 'I will destroy.'"}, {"ref": "Mark 15:29", "explanation": "Even on the cross, passersby mocked Him: 'You who would destroy the temple and rebuild it in three days, save yourself!' They never understood."}, {"ref": "1 Corinthians 6:19", "explanation": "Paul extends the metaphor: 'Your body is a temple of the Holy Spirit.' Jesus' body was the original temple — where God fully dwelt."}], "words": [{"english": "Destroy", "original": "Λύσατε", "transliteration": "Lysate", "pronunciation": "LOO-sah-teh", "strongs": "G3089", "partOfSpeech": "verb, aorist active imperative, 2nd person plural", "literalMeaning": "loose, dissolve, tear down, destroy", "definition": "Lyō means to loosen, untie, demolish. The imperative mood is crucial — Jesus says 'YOU destroy,' not 'I will destroy.' He's not threatening to destroy the Temple; He's prophesying what THEY will do to His body. It's a conditional challenge: if you destroy this, I will raise it. The distinction between 'you destroy' and 'I will raise' was ignored at His trial when witnesses twisted His words.", "translationNote": "Accurate. The imperative 'destroy' correctly shows Jesus telling them to do it, not volunteering to do it Himself.", "twisted": false, "twistedExplanation": null}, {"english": "this temple", "original": "τὸν ναὸν τοῦτον", "transliteration": "ton naon touton", "pronunciation": "ton nah-ON TOO-ton", "strongs": "G3485", "partOfSpeech": "noun, accusative masculine singular", "literalMeaning": "this inner sanctuary, this dwelling place of God", "definition": "There are two Greek words for temple: hieron (the entire temple complex, courts and all) and naos (the inner sanctuary where God's presence dwelt — the Holy of Holies). Jesus uses NAOS, not hieron. He's not talking about the building complex; He's talking about the dwelling place of God. His body is the true naos — the place where the fullness of God physically resides (Colossians 2:9). The listeners heard 'building.' John's readers hear 'God's dwelling place.'", "translationNote": "English 'temple' loses the distinction between hieron (complex) and naos (inner sanctuary/God's dwelling). This distinction is the whole point of the statement.", "twisted": true, "twistedExplanation": "By translating both hieron and naos as 'temple,' English Bibles obscure Jesus' deliberate word choice. He specifically said naos (where God dwells), pointing to His body as the true dwelling place of God — not the stone building. Most readers miss this entirely."}, {"english": "in three days I will raise it up", "original": "ἐν τρισὶν ἡμέραις ἐγερῶ αὐτόν", "transliteration": "en trisin hēmerais egerō auton", "pronunciation": "en tree-SEEN hay-MER-ais eh-ger-OH ow-TON", "strongs": "G1722, G5140, G2250, G1453", "partOfSpeech": "preposition + numeral + noun + verb, future active indicative", "literalMeaning": "in three days I will raise/awaken it", "definition": "Egeirō means to raise up, to awaken from sleep — the standard word for resurrection throughout the New Testament. Jesus claims HE will raise it — not 'God will raise me' but 'I will raise it.' This is a claim to self-resurrection, an authority that belongs only to God. John 10:18 confirms: 'No one takes my life from me. I lay it down of my own accord, and I have authority to take it up again.' The three days became the defining sign of Jesus' ministry (Matthew 12:40).", "translationNote": "Accurate. The 'I' is emphatic — egō (I myself) will raise it.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 20, "verseText": "Then said the Jews, Forty and six years was this temple in building, and wilt thou rear it up in three days?", "freshTranslation": "The Jewish leaders replied, 'This temple has been under construction for forty-six years, and you're going to raise it in three days?'", "historicalContext": "Herod the Great began his massive renovation of the Second Temple around 20-19 BC. Forty-six years of construction places this conversation around 27-28 AD, which aligns with the early period of Jesus' ministry. The project wouldn't be fully completed until 63 AD — only seven years before Rome destroyed it entirely in 70 AD. The irony is devastating: they spent 46 years building a stone temple that would be destroyed; Jesus would build an eternal temple in three days.", "crossRefs": [{"ref": "Ezra 6:15", "explanation": "The Second Temple (Zerubbabel's) was completed in about 4 years. Herod's renovation was far more ambitious — a project spanning generations."}, {"ref": "Matthew 24:2", "explanation": "Jesus later prophesied directly: 'Not one stone here will be left on another; every one will be thrown down.' Fulfilled in 70 AD by the Romans."}], "words": [{"english": "Forty and six years", "original": "Τεσσεράκοντα καὶ ἓξ ἔτεσιν", "transliteration": "Tesserakonta kai hex etesin", "pronunciation": "tes-sar-AH-kon-tah kai hex ET-eh-sin", "strongs": "G5062, G1803, G2094", "partOfSpeech": "numeral + noun, dative plural", "literalMeaning": "forty and six years", "definition": "This number is one of the few chronological markers in John's gospel that helps date Jesus' ministry. Josephus records that Herod began the Temple renovation in the 18th year of his reign (~20/19 BC). Forty-six years later brings us to approximately 27/28 AD. This accidental detail from hostile questioners becomes valuable historical evidence.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "wilt thou rear it up", "original": "σὺ ἐγερεῖς αὐτόν", "transliteration": "sy egereis auton", "pronunciation": "soo eh-ger-AYS ow-TON", "strongs": "G4771, G1453", "partOfSpeech": "pronoun, emphatic + verb, future active indicative", "literalMeaning": "YOU will raise it?", "definition": "The emphatic 'sy' (YOU) drips with contempt and disbelief. 'You — a wandering teacher from Galilee with no construction crews, no resources, no authority — YOU are going to rebuild what has taken our nation's greatest king nearly half a century?' They meant it as mockery. They couldn't imagine that the answer was yes, but in a way that would redefine everything they understood about where God dwells.", "translationNote": "The emphatic 'you' in Greek is stronger than English conveys. It's incredulous — 'YOU?!'", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 21, "verseText": "But he spake of the temple of his body.", "freshTranslation": "But He was speaking about the temple of His body.", "historicalContext": "This is John's editorial explanation, written decades after the event. He now understands what nobody understood at the time — Jesus meant His physical body was the true naos, the dwelling place of God. This verse is the interpretive key to the whole passage and represents the kind of post-resurrection insight that characterizes John's gospel. He writes with the benefit of hindsight, explaining what was incomprehensible in the moment.", "crossRefs": [{"ref": "Colossians 2:9", "explanation": "'For in Christ all the fullness of the Deity dwells in bodily form.' Paul's theological statement of exactly what John means — Jesus' body was where God fully, physically resided."}, {"ref": "Hebrews 10:20", "explanation": "The author of Hebrews calls Jesus' body 'the curtain' — the veil of the Temple through which we now have access to God."}], "words": [{"english": "the temple of his body", "original": "τοῦ ναοῦ τοῦ σώματος αὐτοῦ", "transliteration": "tou naou tou sōmatos autou", "pronunciation": "too nah-OO too SO-mah-tos ow-TOO", "strongs": "G3485, G4983", "partOfSpeech": "noun, genitive + noun, genitive", "literalMeaning": "the inner sanctuary of His body", "definition": "Again naos — the inner sanctuary where God dwells — not hieron. Jesus' physical body (sōma) is the new Holy of Holies. This is a revolutionary theological claim: God no longer dwells in a building made of stone but in a human body. And after the resurrection, this extends to all believers (1 Corinthians 6:19 — 'your body is a temple of the Holy Spirit'). The stone Temple was always a shadow; Jesus was always the substance.", "translationNote": "Accurate, though the naos/hieron distinction is again hidden in English.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 22, "verseText": "When therefore he was risen from the dead, his disciples remembered that he had said this unto them; and they believed the scripture, and the word which Jesus had said.", "freshTranslation": "After He was raised from the dead, His disciples remembered He had said this, and they believed both the Scripture and the word Jesus had spoken.", "historicalContext": "John honestly acknowledges that the disciples didn't understand this saying at the time. It was only after the resurrection — when they saw the 'temple' of His body destroyed and raised in three days — that the pieces clicked. This is a recurring pattern in John: events happen, they're misunderstood, and only later (often after the resurrection) does their meaning become clear. John writes for readers who have the benefit of knowing the end of the story.", "crossRefs": [{"ref": "John 12:16", "explanation": "Same pattern: 'At first his disciples did not understand all this. Only after Jesus was glorified did they realize...' Post-resurrection understanding is a major theme in John."}, {"ref": "Luke 24:8", "explanation": "After the resurrection, the women 'remembered his words' — the same awakening of memory that John describes here."}, {"ref": "Psalm 16:10", "explanation": "'You will not abandon me to the grave, nor will you let your faithful one see decay.' One of the 'scriptures' they would have connected to the resurrection."}], "words": [{"english": "he was risen from the dead", "original": "ἠγέρθη ἐκ νεκρῶν", "transliteration": "ēgerthē ek nekrōn", "pronunciation": "ay-GER-thay ek nek-ROHN", "strongs": "G1453, G3498", "partOfSpeech": "verb, aorist passive indicative + adjective, genitive plural", "literalMeaning": "he was raised out of dead ones", "definition": "Egeirō in the passive — 'was raised.' While Jesus claimed He would raise Himself (v.19), the passive voice here credits God the Father as the agent of resurrection. Both are true: Jesus had authority to lay down His life and take it up again (John 10:18), and the Father raised Him (Acts 2:24, Romans 8:11). This is Trinitarian theology in action — the resurrection was a cooperative act.", "translationNote": "KJV 'was risen' is slightly misleading as it sounds active/intransitive. The Greek is passive — 'was raised' (by God).", "twisted": false, "twistedExplanation": null}, {"english": "they believed the scripture", "original": "ἐπίστευσαν τῇ γραφῇ", "transliteration": "episteusan tē graphē", "pronunciation": "ep-IS-tyoo-san tay grah-FAY", "strongs": "G4100, G1124", "partOfSpeech": "verb, aorist active indicative + noun, dative", "literalMeaning": "they believed/trusted the writing", "definition": "Graphē (writing, scripture) refers to the Old Testament texts that predicted the Messiah's death and resurrection. The aorist tense marks a decisive moment — their faith crystallized. They didn't just believe intellectually; pisteuō with the dative means they put their trust IN the scripture. The resurrection was the key that unlocked the entire Old Testament for them, making sense of prophecies they had read their whole lives without fully comprehending.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 23, "verseText": "Now when he was in Jerusalem at the passover, in the feast day, many believed in his name, when they saw the miracles which he did.", "freshTranslation": "While Jesus was in Jerusalem during the Passover feast, many people put their trust in His name because they saw the signs He was performing.", "historicalContext": "John mentions signs (sēmeia) that he doesn't describe in detail — a reminder that John's gospel is selective, not exhaustive (see 21:25). These unnamed miracles during Passover drew crowd-level faith, but Jesus will show in the next verse that He distinguishes between genuine faith and sign-seeking enthusiasm. The Passover setting is significant — Jesus is in Jerusalem for the feast that commemorates God's deliverance from Egypt, and He is performing signs of a new deliverance.", "crossRefs": [{"ref": "John 20:30-31", "explanation": "John explicitly states: 'Jesus performed many other signs in the presence of His disciples, which are not recorded in this book.' This verse is an example of those unrecorded signs."}, {"ref": "John 6:26", "explanation": "Jesus later rebukes this kind of faith: 'You are looking for me, not because you saw the signs, but because you ate the loaves and had your fill.'"}], "words": [{"english": "believed in his name", "original": "ἐπίστευσαν εἰς τὸ ὄνομα αὐτοῦ", "transliteration": "episteusan eis to onoma autou", "pronunciation": "ep-IS-tyoo-san ays to ON-oh-mah ow-TOO", "strongs": "G4100, G3686", "partOfSpeech": "verb + preposition + noun", "literalMeaning": "they believed into his name", "definition": "Pisteuō eis (believe into) is John's characteristic phrase for saving faith — it implies movement, entering into, committing to. Onoma (name) in Hebrew thought represents the total person — their character, authority, and identity. So 'believed into his name' means they entrusted themselves to who Jesus is. However, Jesus' response in the next verse suggests this faith was superficial — based on spectacle rather than understanding.", "translationNote": "Most translations say 'believed in his name' which is adequate, but 'into' (eis) conveys deeper commitment than 'in' (en).", "twisted": false, "twistedExplanation": null}, {"english": "the miracles which he did", "original": "τὰ σημεῖα ἃ ἐποίει", "transliteration": "ta sēmeia ha epoiei", "pronunciation": "tah say-MAY-ah hah ep-OY-ay", "strongs": "G4592", "partOfSpeech": "noun, accusative neuter plural", "literalMeaning": "the signs which he was doing", "definition": "Sēmeion means sign — not just 'miracle' or 'wonder.' John never uses the word 'miracle' (dynamis/teras); he always says 'sign.' The difference matters: a miracle impresses; a sign POINTS to something beyond itself. Every sign in John's gospel reveals something about who Jesus is. The imperfect tense (epoiei — 'was doing') suggests ongoing, repeated sign-working during the feast.", "translationNote": "KJV 'miracles' is misleading. The Greek is sēmeia — 'signs.' John deliberately chose this word because the point isn't the spectacle but what it reveals about Jesus. Modern translations correctly use 'signs.'", "twisted": true, "twistedExplanation": "Translating sēmeia as 'miracles' shifts focus from revelation to spectacle. John's theology of signs is central to his gospel — each sign points to Jesus' identity and glory. 'Miracles' makes them about power; 'signs' makes them about meaning."}]}, {"verseNumber": 24, "verseText": "But Jesus did not commit himself unto them, because he knew all men,", "freshTranslation": "But Jesus did not entrust Himself to them, because He knew all people —", "historicalContext": "A stunning reversal: many 'believed into' Jesus (v.23), but Jesus did not 'believe into' them. The same verb (pisteuō) is used for both — they entrusted themselves to Him, but He did not entrust Himself to them. He saw through their enthusiasm to its shallow roots. This is the first clear statement of Jesus' supernatural knowledge of human hearts, a theme that will recur throughout John (4:29, 6:64, 13:11).", "crossRefs": [{"ref": "Jeremiah 17:9-10", "explanation": "'The heart is deceitful above all things... I the LORD search the heart.' Jesus exercises the divine prerogative of knowing hearts."}, {"ref": "1 Samuel 16:7", "explanation": "'The LORD does not look at the things people look at. People look at the outward appearance, but the LORD looks at the heart.' Jesus sees as God sees."}], "words": [{"english": "did not commit himself", "original": "οὐκ ἐπίστευεν αὐτὸν", "transliteration": "ouk episteuen auton", "pronunciation": "ook ep-IS-tyoo-en ow-TON", "strongs": "G4100", "partOfSpeech": "verb, imperfect active indicative", "literalMeaning": "was not entrusting himself", "definition": "Same verb as v.23 — pisteuō. They pisteuō'd into Him; He did not pisteuō Himself to them. The imperfect tense means this was His ongoing posture — He consistently, repeatedly withheld Himself from crowd-level faith that was based only on signs. Jesus distinguished between genuine disciples and spectacle-seekers. He accepted their interest but didn't hand them His mission, His inner circle, or His full self-revelation.", "translationNote": "KJV 'commit' is adequate but obscures the wordplay. The same Greek word is used in v.23 and v.24 — they 'believed' in Him, but He didn't 'believe' in them. Modern translations using 'entrust' capture this better.", "twisted": false, "twistedExplanation": null}, {"english": "he knew all men", "original": "αὐτὸν γινώσκειν πάντας", "transliteration": "auton ginōskein pantas", "pronunciation": "ow-TON ghee-NO-skane PAN-tas", "strongs": "G1097, G3956", "partOfSpeech": "verb, present active infinitive + adjective", "literalMeaning": "him to know all (people)", "definition": "Ginōskō — personal, experiential knowledge. Jesus didn't just observe people; He KNEW them at the deepest level. Pantas (all) is universal — not some people, all people. This is a divine attribute: only God searches hearts and knows all humanity (1 Chronicles 28:9, Psalm 139:1-4). John is making a quiet but enormous theological claim: Jesus possesses the omniscience that belongs to God alone.", "translationNote": "Accurate. The claim is as radical as anything in John 1:1 — Jesus knows every human heart.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 25, "verseText": "And needed not that any should testify of man: for he knew what was in man.", "freshTranslation": "He didn't need anyone to tell Him about human nature, because He Himself knew what was inside a person.", "historicalContext": "This verse closes chapter 2 and sets up chapter 3 perfectly. Jesus knows what's in humanity — the next verse introduces Nicodemus, a specific man, and Jesus will demonstrate this knowledge by cutting straight to what Nicodemus needs: rebirth. The chapter ends with a universal claim (He knows ALL people) and the next chapter opens with a particular case study. John is a masterful storyteller.", "crossRefs": [{"ref": "John 3:1-2", "explanation": "The very next verse introduces Nicodemus — and Jesus will demonstrate His knowledge of what's 'in man' by telling Nicodemus exactly what he needs before Nicodemus even asks."}, {"ref": "Hebrews 4:13", "explanation": "'Nothing in all creation is hidden from God's sight. Everything is uncovered and laid bare before the eyes of him to whom we must give account.'"}, {"ref": "Revelation 2:23", "explanation": "Jesus says: 'I am he who searches hearts and minds.' The same claim made narratively in John 2:25 is stated explicitly in Revelation."}], "words": [{"english": "he knew what was in man", "original": "αὐτὸς γὰρ ἐγίνωσκεν τί ἦν ἐν τῷ ἀνθρώπῳ", "transliteration": "autos gar eginōsken ti ēn en tō anthrōpō", "pronunciation": "ow-TOS gar eh-GHEE-no-sken tee ayn en to an-THRO-po", "strongs": "G846, G1097, G444", "partOfSpeech": "pronoun + verb, imperfect active indicative + noun", "literalMeaning": "he himself for/because was knowing what was in the human", "definition": "Autos (He Himself — emphatic) eginōsken (was continually knowing — imperfect, ongoing) what was en tō anthrōpō (in the human being). This isn't occasional insight; it's continuous, comprehensive knowledge of human nature. Anthrōpos (human) is generic — not 'a man' but 'humanity.' Jesus understood human nature at its depths: its capacity for shallow faith (v.23), its tendency toward deception, its need for rebirth (chapter 3). This is both comforting and terrifying — comforting because He knows our real struggles, terrifying because nothing is hidden.", "translationNote": "KJV 'what was in man' sounds like it refers to one person. The Greek anthrōpos is generic — 'what was in humanity.' Better: 'what was inside a person' or 'the human condition.'", "twisted": false, "twistedExplanation": null}]}]}