{"book": "John", "bookGreek": "Κατὰ Ἰωάννην", "chapter": 3, "author": "John (Ἰωάννης), apostle, ~85-95 AD from Ephesus.", "audience": "Greek-speaking believers and seekers in Asia Minor.", "historicalContext": "This chapter contains arguably the most famous conversation in the Bible. Nicodemus — a Pharisee and member of the Sanhedrin (the Jewish supreme court) — comes to Jesus at night. The darkness is both literal and symbolic in John's theology. What follows is Jesus' teaching on spiritual rebirth, the famous John 3:16, and the Baptist's final testimony about Jesus.", "verses": [{"verseNumber": 1, "verseText": "There was a man of the Pharisees, named Nicodemus, a ruler of the Jews:", "freshTranslation": "Now there was a man among the Pharisees named Nicodemus, a member of the Jewish ruling council.", "historicalContext": "Nicodemus (Nikodēmos — 'victory of the people') was a member of the Sanhedrin, the 70-member supreme council that governed Jewish religious and civil life under Roman oversight. As a Pharisee, he was devoted to Torah observance and oral tradition.", "crossRefs": [{"ref": "John 7:50-51", "explanation": "Nicodemus later defends Jesus before the Sanhedrin: 'Does our law condemn a man without first hearing him?'"}, {"ref": "John 19:39", "explanation": "After the crucifixion, Nicodemus brings 75 pounds of burial spices — a royal amount — showing his faith grew over time."}], "words": [{"english": "Pharisees", "original": "Φαρισαίων", "transliteration": "Pharisaiōn", "pronunciation": "far-is-EYE-own", "strongs": "G5330", "partOfSpeech": "noun, genitive plural", "literalMeaning": "separated ones", "definition": "From Hebrew parash (to separate). The Pharisees were the strictest sect of Judaism, devoted to meticulous Torah observance including oral traditions. They believed in resurrection, angels, and the coming Messiah — unlike the Sadducees.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Nicodemus", "original": "Νικόδημος", "transliteration": "Nikodēmos", "pronunciation": "nik-OH-day-mos", "strongs": "G3530", "partOfSpeech": "proper noun", "literalMeaning": "victory of the people", "definition": "A Greek name (nikē = victory + dēmos = people), suggesting a Hellenized Jewish family of high standing. He appears only in John's gospel, always in a progression: coming in secret (ch3), defending Jesus publicly (ch7), burying Jesus openly (ch19).", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "a ruler of the Jews", "original": "ἄρχων τῶν Ἰουδαίων", "transliteration": "archōn tōn Ioudaiōn", "pronunciation": "AR-khone tone ee-oo-DYE-own", "strongs": "G758", "partOfSpeech": "noun, nominative", "literalMeaning": "ruler, leader, chief", "definition": "Archōn means ruler or chief — from archē (beginning, authority). This identifies Nicodemus as a member of the Sanhedrin, the highest Jewish governing body. He risked everything by coming to Jesus.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 2, "verseText": "The same came to Jesus by night, and said unto him, Rabbi, we know that thou art a teacher come from God: for no man can do these miracles that thou doest, except God be with him.", "freshTranslation": "He came to Jesus at night and said, 'Rabbi, we know you are a teacher who has come from God, because no one could perform the signs you are doing unless God were with him.'", "historicalContext": "Coming 'at night' is both practical (avoiding being seen by fellow Sanhedrin members) and deeply symbolic in John's gospel, where darkness represents spiritual blindness and separation from the light (1:5). Nicodemus acknowledges the signs but hasn't yet grasped who Jesus truly is — he sees a teacher, not the Messiah.", "crossRefs": [{"ref": "John 13:30", "explanation": "Judas also goes out 'into the night' — John uses darkness as a theological marker throughout."}], "words": [{"english": "by night", "original": "νυκτός", "transliteration": "nyktos", "pronunciation": "nook-TOS", "strongs": "G3571", "partOfSpeech": "noun, genitive", "literalMeaning": "of night, during the night", "definition": "Nyx (night) carries heavy symbolic weight in John. Nicodemus comes from darkness toward the Light of the World. His journey from night to day mirrors his spiritual journey across the gospel — from secret seeker to public disciple.", "translationNote": "Accurate. The symbolic layer is invisible without knowing John's light/darkness theology.", "twisted": false, "twistedExplanation": null}, {"english": "Rabbi", "original": "Ῥαββί", "transliteration": "Rhabbi", "pronunciation": "hrab-BEE", "strongs": "G4461", "partOfSpeech": "noun", "literalMeaning": "my great one, my teacher", "definition": "A title of deep respect from one rabbi to another. Nicodemus — a supreme court member — addresses Jesus as an equal, which is extraordinary given Jesus had no formal rabbinic training (7:15).", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "these miracles/signs", "original": "τὰ σημεῖα", "transliteration": "ta sēmeia", "pronunciation": "tah say-MAY-ah", "strongs": "G4592", "partOfSpeech": "noun, accusative plural", "literalMeaning": "signs, indicators", "definition": "Again John's characteristic word — sēmeia (signs), not miracles. Nicodemus correctly reads the signs as evidence of divine backing, but hasn't yet understood what they point to: not just a teacher FROM God, but God Himself in human form.", "translationNote": "KJV 'miracles' should be 'signs.' Same issue throughout John.", "twisted": true, "twistedExplanation": "Translating sēmeia as 'miracles' obscures John's theology of signs — each one points to Jesus' divine identity, not just His power."}]}, {"verseNumber": 3, "verseText": "Jesus answered and said unto him, Verily, verily, I say unto thee, Except a man be born again, he cannot see the kingdom of God.", "freshTranslation": "Jesus replied, 'Truly, truly, I tell you — unless a person is born from above, they cannot even see the kingdom of God.'", "historicalContext": "Jesus ignores Nicodemus's compliment and cuts to the heart of the matter. The word anōthen is deliberately ambiguous — it means both 'again' (a second time) and 'from above' (from God). Nicodemus hears 'again'; Jesus means 'from above.' This double meaning drives the entire conversation.", "crossRefs": [{"ref": "1 Peter 1:23", "explanation": "'You have been born again, not of perishable seed, but of imperishable, through the living and enduring word of God.'"}, {"ref": "James 1:17", "explanation": "'Every good gift is from above (anōthen), coming down from the Father of lights.' Same word — the rebirth comes from God, not human effort."}], "words": [{"english": "born again / from above", "original": "γεννηθῇ ἄνωθεν", "transliteration": "gennēthē anōthen", "pronunciation": "gen-nay-THAY AH-no-then", "strongs": "G1080, G509", "partOfSpeech": "verb, aorist passive subjunctive + adverb", "literalMeaning": "be born/begotten from above/again", "definition": "Anōthen has two meanings: 'from above' (its primary meaning in John — used in 3:31, 19:11, 19:23) and 'again/anew.' Jesus means 'born from above' — a divine rebirth initiated by God. Nicodemus hears 'born a second time' and is confused. The passive voice (gennēthē — 'be born') indicates this is something done TO you by God, not something you do yourself.", "translationNote": "'Born again' captures the secondary meaning but misses the primary one: 'from above.' This is arguably the most consequential translation choice in the New Testament — an entire theological movement ('born again Christianity') is built on the secondary meaning of anōthen.", "twisted": true, "twistedExplanation": "Translating anōthen as only 'again' loses Jesus' main point: this birth originates FROM ABOVE — from God's initiative, not human decision. 'Born from above' emphasizes God's action; 'born again' can sound like a human choice to restart. Both meanings are present, but 'from above' is primary in John's usage."}, {"english": "the kingdom of God", "original": "τὴν βασιλείαν τοῦ θεοῦ", "transliteration": "tēn basileian tou theou", "pronunciation": "tayn bah-sil-AY-ahn too theh-OO", "strongs": "G932, G2316", "partOfSpeech": "noun, accusative + genitive", "literalMeaning": "the reign/rule of God", "definition": "Basileia means kingdom, reign, or royal rule. This phrase appears only twice in John (here and v.5) — it's much more common in the Synoptic Gospels. For John, the concept is expressed differently: 'eternal life.' Seeing the kingdom means perceiving God's active reign — you can't even recognize it without spiritual rebirth.", "translationNote": "Accurate, though 'kingdom' can sound like a place. It's primarily God's active RULE, not a location.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 4, "verseText": "Nicodemus saith unto him, How can a man be born when he is old? can he enter the second time into his mother's womb, and be born?", "freshTranslation": "Nicodemus asked, 'How can someone be born when they're old? They can't enter their mother's womb a second time and be born, can they?'", "historicalContext": "Nicodemus takes anōthen literally as 'again' — picturing physical re-entry into the womb. His confusion is genuine but also represents the inability of the natural mind to grasp spiritual truth (1 Cor 2:14). He's a brilliant scholar who can't see what Jesus is saying because he's thinking entirely in physical categories.", "crossRefs": [{"ref": "1 Corinthians 2:14", "explanation": "'The natural person does not accept the things of the Spirit of God, for they are folly to him.' Nicodemus embodies this."}], "words": [{"english": "when he is old", "original": "γέρων ὤν", "transliteration": "gerōn ōn", "pronunciation": "GER-own own", "strongs": "G1088", "partOfSpeech": "noun + participle", "literalMeaning": "being an old man", "definition": "Gerōn means old man, elder (root of 'geriatric'). Nicodemus may be speaking personally — he's likely elderly, and the idea of starting over feels impossible. His question reveals the human dilemma: we know we need transformation but feel trapped by our history and habits.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "his mother's womb", "original": "τὴν κοιλίαν τῆς μητρός", "transliteration": "tēn koilian tēs mētros", "pronunciation": "tayn koy-LEE-ahn tays may-TROS", "strongs": "G2836, G3384", "partOfSpeech": "noun + noun, genitive", "literalMeaning": "the belly/womb of the mother", "definition": "Koilia literally means belly, stomach, or womb. Nicodemus is being absurdly literal — but his confusion serves John's narrative purpose. The impossibility of physical rebirth highlights that spiritual rebirth must be entirely God's work.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 5, "verseText": "Jesus answered, Verily, verily, I say unto thee, Except a man be born of water and of the Spirit, he cannot enter into the kingdom of God.", "freshTranslation": "Jesus answered, 'Truly, truly, I tell you — unless a person is born of water and the Spirit, they cannot enter the kingdom of God.'", "historicalContext": "This is one of the most debated verses in the Bible. 'Born of water' has been interpreted as: (1) natural birth (amniotic fluid), (2) baptism, (3) the Word of God (Eph 5:26), or (4) a reference to Ezekiel 36:25-27 where God promises to 'sprinkle clean water on you' and give a 'new spirit.' The Ezekiel connection is strongest — Nicodemus as a teacher of Israel should have known this prophecy.", "crossRefs": [{"ref": "Ezekiel 36:25-27", "explanation": "'I will sprinkle clean water on you, and you will be clean... I will give you a new heart and put a new spirit in you.' The Old Testament prophecy Jesus expects Nicodemus to recognize."}, {"ref": "Titus 3:5", "explanation": "'He saved us through the washing of rebirth and renewal by the Holy Spirit.' Paul connects water and Spirit in regeneration."}], "words": [{"english": "born of water and of the Spirit", "original": "γεννηθῇ ἐξ ὕδατος καὶ πνεύματος", "transliteration": "gennēthē ex hydatos kai pneumatos", "pronunciation": "gen-nay-THAY ex HOO-dah-tos kai PNYOO-mah-tos", "strongs": "G1080, G5204, G4151", "partOfSpeech": "verb + preposition + nouns, genitive", "literalMeaning": "be born out of water and spirit/breath", "definition": "The pairing of hydōr (water) and pneuma (spirit/wind/breath) echoes Ezekiel 36:25-27 where God promises cleansing water AND a new spirit. Pneuma is the key word — it means wind, breath, and spirit simultaneously, which Jesus will exploit in verse 8. The passive 'be born' again emphasizes divine initiative.", "translationNote": "Accurate. The debate over 'water' (baptism vs. natural birth vs. Ezekiel) is unresolvable from the Greek alone — context must decide.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 6, "verseText": "That which is born of the flesh is flesh; and that which is born of the Spirit is spirit.", "freshTranslation": "What is born from the flesh is flesh, and what is born from the Spirit is spirit.", "historicalContext": "Jesus draws a sharp line between two orders of existence: flesh (sarx — the natural, human realm) and spirit (pneuma — the divine realm). Physical birth produces physical life; only spiritual birth produces spiritual life. You can't upgrade flesh into spirit through effort, education, or religion — you need an entirely new birth from a different source.", "crossRefs": [{"ref": "Romans 8:5-8", "explanation": "Paul develops this flesh/spirit distinction extensively: 'Those who live according to the flesh have their minds set on what the flesh desires.'"}, {"ref": "Galatians 5:17", "explanation": "'The flesh desires what is contrary to the Spirit, and the Spirit what is contrary to the flesh.'"}], "words": [{"english": "the flesh", "original": "τῆς σαρκός", "transliteration": "tēs sarkos", "pronunciation": "tays sar-KOS", "strongs": "G4561", "partOfSpeech": "noun, genitive", "literalMeaning": "flesh, human nature, physical existence", "definition": "Sarx in John means the entire realm of natural, unaided human existence — not just the body but the whole person apart from God's Spirit. It's not inherently evil (the Word became sarx in 1:14), but it's insufficient. Flesh can't produce spirit any more than water can produce fire.", "translationNote": "Accurate, though English 'flesh' sounds more negative than John intends. He means 'the human realm' — limited, not necessarily sinful.", "twisted": false, "twistedExplanation": null}, {"english": "the Spirit", "original": "τοῦ πνεύματος", "transliteration": "tou pneumatos", "pronunciation": "too PNYOO-mah-tos", "strongs": "G4151", "partOfSpeech": "noun, genitive", "literalMeaning": "the spirit/wind/breath", "definition": "Pneuma — God's Spirit, the divine breath that gives spiritual life. Capital-S Spirit here because Jesus is talking about God's Spirit as the agent of rebirth. The Spirit does what flesh cannot: create new spiritual life from above.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 7, "verseText": "Marvel not that I said unto thee, Ye must be born again.", "freshTranslation": "Don't be amazed that I told you, 'You must be born from above.'", "historicalContext": "Jesus tells Nicodemus not to be shocked — this shouldn't surprise a teacher of Israel who knows Ezekiel 36. The 'you' in 'you must' is plural (hymas) — this applies to everyone, not just Nicodemus. Even a Pharisee, a Sanhedrin member, a lifelong Torah scholar MUST be born from above. Credentials don't exempt anyone.", "crossRefs": [{"ref": "Ezekiel 36:26", "explanation": "'I will give you a new heart and put a new spirit in you.' Nicodemus should have known this prophecy about spiritual renewal."}], "words": [{"english": "Marvel not", "original": "μὴ θαυμάσῃς", "transliteration": "mē thaumasēs", "pronunciation": "may thow-MAH-says", "strongs": "G2296", "partOfSpeech": "verb, aorist active subjunctive", "literalMeaning": "do not wonder/be amazed", "definition": "Thaumazō means to wonder, to marvel, to be astonished. Jesus sees the confusion on Nicodemus's face and addresses it directly. The prohibition (mē + subjunctive) means 'stop being amazed' — Nicodemus is visibly stunned.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Ye must", "original": "δεῖ ὑμᾶς", "transliteration": "dei hymas", "pronunciation": "day hoo-MAS", "strongs": "G1163", "partOfSpeech": "verb, impersonal + pronoun, accusative plural", "literalMeaning": "it is necessary for you (all)", "definition": "Dei expresses divine necessity — 'it is absolutely necessary.' This isn't a suggestion or recommendation. And hymas is PLURAL — all of you, everyone, must be born from above. No exceptions for the religious, educated, or morally upright.", "translationNote": "'Must' captures the necessity but loses the plural — Jesus is talking to all humanity through Nicodemus, not just him personally.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 8, "verseText": "The wind bloweth where it listeth, and thou hearest the sound thereof, but canst not tell whence it cometh, and whither it goeth: so is every one that is born of the Spirit.", "freshTranslation": "The wind blows wherever it wants — you hear its sound but can't tell where it comes from or where it's going. So it is with everyone born of the Spirit.", "historicalContext": "Jesus makes a wordplay impossible to capture in English: pneuma means BOTH 'wind' and 'Spirit.' He's saying: 'The pneuma blows where it wants... so is everyone born of the pneuma.' The Spirit, like wind, is invisible, powerful, unpredictable, and beyond human control. You can't manufacture spiritual rebirth any more than you can control the wind.", "crossRefs": [{"ref": "Ecclesiastes 11:5", "explanation": "'As you do not know the path of the wind... so you cannot understand the work of God.' Same analogy — God's work is beyond human comprehension."}, {"ref": "Acts 2:2", "explanation": "At Pentecost, 'a sound like the blowing of a violent wind came from heaven.' The Spirit literally arrived as wind."}], "words": [{"english": "The wind / The Spirit", "original": "τὸ πνεῦμα", "transliteration": "to pneuma", "pronunciation": "to PNYOO-mah", "strongs": "G4151", "partOfSpeech": "noun, nominative neuter", "literalMeaning": "wind, breath, spirit", "definition": "This is the crux: pneuma means wind AND spirit simultaneously. Jesus is exploiting this double meaning — everything He says about wind is equally true about the Spirit. The Spirit is sovereign ('blows where it wants'), perceptible in effects ('you hear the sound') but invisible in origin ('can't tell where it comes from'). You can't control, predict, or manufacture the Spirit's work.", "translationNote": "English forces a choice between 'wind' and 'Spirit' that Greek doesn't require. Most translations choose 'wind' but lose the theological double meaning. 'The Spirit blows where it wants' is equally valid.", "twisted": true, "twistedExplanation": "By translating pneuma as only 'wind,' translators create a simile (the Spirit is LIKE wind). But in Greek, it's not a simile — it's the same word. Jesus is saying the Spirit IS the divine wind/breath. The double meaning is the whole point, and translation destroys it."}]}, {"verseNumber": 9, "verseText": "Nicodemus answered and said unto him, How can these things be?", "freshTranslation": "Nicodemus responded, 'How is this possible?'", "historicalContext": "Nicodemus is still lost. He's moved from physical confusion (v.4) to existential confusion — he can't grasp HOW God's Spirit works to regenerate a person. His question is honest and universal: we all want to control and understand the process of spiritual transformation, but it's like trying to control the wind.", "crossRefs": [], "words": [{"english": "How can these things be?", "original": "Πῶς δύναται ταῦτα γενέσθαι;", "transliteration": "Pōs dynatai tauta genesthai?", "pronunciation": "POHS DOO-nah-tai TOW-tah gen-ES-thai", "strongs": "G4459, G1410", "partOfSpeech": "adverb + verb + pronoun + verb", "literalMeaning": "How is it possible for these things to happen?", "definition": "Pōs (how?) combined with dynatai (is it possible) — Nicodemus isn't denying it, he's asking for the mechanism. He's a scholar who wants to understand the process. But the wind analogy just told him: you CAN'T fully understand the process. Faith means trusting what you can't control or fully comprehend.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 10, "verseText": "Jesus answered and said unto him, Art thou a master of Israel, and knowest not these things?", "freshTranslation": "Jesus replied, 'You are Israel's teacher and you don't understand this?'", "historicalContext": "A pointed rebuke. 'THE teacher of Israel' (ho didaskalos — with the definite article) suggests Nicodemus was one of the premier Torah scholars of his generation. Jesus is saying: Ezekiel 36 promised spiritual renewal. The prophets wrote about God's Spirit transforming hearts. You've been teaching Israel for decades and you don't recognize what I'm describing? The Old Testament already taught this.", "crossRefs": [{"ref": "Ezekiel 37:1-14", "explanation": "The valley of dry bones — God's Spirit (ruach) breathes life into dead bones. Nicodemus should have known this vision of spiritual renewal."}], "words": [{"english": "a master/the teacher of Israel", "original": "ὁ διδάσκαλος τοῦ Ἰσραήλ", "transliteration": "ho didaskalos tou Israēl", "pronunciation": "ho did-AS-kah-los too is-rah-AYL", "strongs": "G1320", "partOfSpeech": "noun with definite article", "literalMeaning": "THE teacher of Israel", "definition": "The definite article ho (THE) is significant — not 'a teacher' but 'THE teacher.' This implies Nicodemus held a preeminent position among Israel's scholars. Jesus' rebuke is proportional: the more you should know, the more accountable you are for not knowing it.", "translationNote": "KJV 'a master' misses the definite article. It should be 'THE teacher of Israel' — a specific, prominent position.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 11, "verseText": "Verily, verily, I say unto thee, We speak that we do know, and testify that we have seen; and ye receive not our witness.", "freshTranslation": "Truly, truly, I tell you — we speak about what we know and testify to what we have seen, but you people do not accept our testimony.", "historicalContext": "Jesus shifts from singular 'you' to plural — both 'we' and 'you' are plural. Some scholars think 'we' refers to Jesus and His disciples, or Jesus and the Spirit, or even the Trinity. The 'you' (plural) broadens the rebuke beyond Nicodemus to Israel's religious establishment as a whole.", "crossRefs": [{"ref": "John 1:11", "explanation": "'He came to his own, and his own people did not receive him.' The same rejection theme."}], "words": [{"english": "we do know... we have seen", "original": "οἴδαμεν... ἑωράκαμεν", "transliteration": "oidamen... heōrakamen", "pronunciation": "OY-dah-men... heh-oh-RAH-kah-men", "strongs": "G1492, G3708", "partOfSpeech": "verb, perfect active indicative (both)", "literalMeaning": "we know with certainty... we have seen/perceived", "definition": "Two perfect tenses — settled, established knowledge. Oida is intuitive, certain knowledge; horaō is experiential, perceptual knowledge. Jesus claims both: He knows heavenly realities intuitively (because He came from there) and has seen them experientially. This isn't speculation — it's eyewitness testimony from someone who was there.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 12, "verseText": "If I have told you earthly things, and ye believe not, how shall ye believe, if I tell you of heavenly things?", "freshTranslation": "If I've told you about earthly things and you don't believe, how will you believe when I tell you about heavenly things?", "historicalContext": "Jesus distinguishes between 'earthly things' (the wind analogy, birth metaphor — spiritual realities explained through physical illustrations) and 'heavenly things' (the deeper mysteries of God's plan He's about to reveal). If Nicodemus can't grasp the illustration, how will he handle the reality?", "crossRefs": [{"ref": "1 Corinthians 15:40", "explanation": "Paul similarly distinguishes earthly and heavenly realities — different orders of existence requiring different eyes to see."}], "words": [{"english": "earthly things", "original": "τὰ ἐπίγεια", "transliteration": "ta epigeia", "pronunciation": "tah ep-IG-ay-ah", "strongs": "G1919", "partOfSpeech": "adjective, accusative neuter plural", "literalMeaning": "the upon-earth things", "definition": "Epigeios means earthly, terrestrial — things that occur on earth or can be illustrated through earthly analogies. The wind, birth, water — these are earthly pictures of spiritual realities. Jesus used them to make heavenly truth accessible, and Nicodemus still couldn't grasp it.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "heavenly things", "original": "τὰ ἐπουράνια", "transliteration": "ta epourania", "pronunciation": "tah ep-oo-RAH-nee-ah", "strongs": "G2032", "partOfSpeech": "adjective, accusative neuter plural", "literalMeaning": "the upon-heaven things, the celestial", "definition": "Epouranios means heavenly, celestial — the deep mysteries of God's redemptive plan that Jesus is about to reveal: the Son of Man descending from heaven, the bronze serpent typology, God's love sending His Son. These are direct revelations from heaven, not earthly analogies.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 13, "verseText": "And no man hath ascended up to heaven, but he that came down from heaven, even the Son of man which is in heaven.", "freshTranslation": "No one has gone up into heaven except the one who came down from heaven — the Son of Man.", "historicalContext": "A staggering claim. Jesus says He alone has access to heavenly realities because He came FROM there. This is a claim to pre-existence — He didn't originate on earth and ascend; He descended from heaven. This echoes John 1:1-14: the Logos who was with God came down and became flesh.", "crossRefs": [{"ref": "Proverbs 30:4", "explanation": "'Who has gone up to heaven and come down? Who has gathered the wind in his hands?... What is his name, and what is the name of his son?'"}, {"ref": "Ephesians 4:9-10", "explanation": "'He who descended is the very one who ascended higher than all the heavens, in order to fill the whole universe.'"}], "words": [{"english": "came down from heaven", "original": "ὁ ἐκ τοῦ οὐρανοῦ καταβάς", "transliteration": "ho ek tou ouranou katabas", "pronunciation": "ho ek too oo-rah-NOO kah-tah-BAS", "strongs": "G2597, G3772", "partOfSpeech": "participle, aorist active + noun", "literalMeaning": "the one having come down out of heaven", "definition": "Katabainō (to come down, descend) from ouranos (heaven). The aorist participle indicates a completed, definitive descent — Jesus came down from heaven at a specific point in time (the incarnation). This is one of John's clearest statements of Christ's pre-existence and divine origin.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the Son of man", "original": "ὁ υἱὸς τοῦ ἀνθρώπου", "transliteration": "ho huios tou anthrōpou", "pronunciation": "ho hwee-OS too an-THRO-poo", "strongs": "G5207, G444", "partOfSpeech": "noun phrase", "literalMeaning": "the Son of the Man/humanity", "definition": "Jesus' favorite self-designation from Daniel 7:13-14. The one who descends from heaven and will ascend again is the divine-human figure who receives everlasting dominion. He bridges heaven and earth — the same claim made in 1:51 with Jacob's ladder.", "translationNote": "Accurate. See note at 1:51 about the common misunderstanding of this title.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 14, "verseText": "And as Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up:", "freshTranslation": "Just as Moses lifted up the bronze serpent in the wilderness, so the Son of Man must be lifted up —", "historicalContext": "Jesus references Numbers 21:4-9 where Israelites were bitten by venomous snakes. God told Moses to make a bronze serpent and put it on a pole — anyone who looked at it would live. The parallel is precise: Israel was dying from snake venom (sin), God provided a remedy on a pole (the cross), and looking in faith brings life. 'Lifted up' (hypsoō) has a double meaning in John: physically lifted on the cross AND exalted in glory.", "crossRefs": [{"ref": "Numbers 21:8-9", "explanation": "'Make a fiery serpent and set it on a pole. Everyone who is bitten, when he looks at it, shall live.' The Old Testament type that Jesus fulfills."}, {"ref": "John 12:32-33", "explanation": "'When I am lifted up from the earth, I will draw all people to myself.' He said this to indicate the kind of death he was going to die."}], "words": [{"english": "lifted up", "original": "ὑψωθῆναι", "transliteration": "hypsōthēnai", "pronunciation": "hoop-so-THAY-nai", "strongs": "G5312", "partOfSpeech": "verb, aorist passive infinitive", "literalMeaning": "to be lifted up, to be exalted", "definition": "Hypsoō means both to physically lift up and to exalt in honor. John uses this double meaning three times (3:14, 8:28, 12:32). The cross is simultaneously the lowest point of humiliation and the highest point of glory — Jesus is 'lifted up' in both senses at once. The passive voice indicates God's sovereignty over the crucifixion.", "translationNote": "'Lifted up' captures the physical sense but readers often miss the exaltation meaning. In John, the cross IS the throne.", "twisted": false, "twistedExplanation": null}, {"english": "must", "original": "δεῖ", "transliteration": "dei", "pronunciation": "day", "strongs": "G1163", "partOfSpeech": "verb, impersonal", "literalMeaning": "it is necessary, it is divinely ordained", "definition": "Divine necessity again — the crucifixion isn't an accident or tragedy but a divine must. God's plan requires the Son to be lifted up, just as the bronze serpent had to be lifted on a pole. No cross, no salvation.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 15, "verseText": "That whosoever believeth in him should not perish, but have eternal life.", "freshTranslation": "— so that everyone who believes in him may have eternal life.", "historicalContext": "The purpose of the lifting up: eternal life for all who believe. This parallels the bronze serpent — anyone bitten who LOOKED at it was healed. The remedy was universal in availability but personal in application: you had to look. Similarly, salvation is offered to all but received through individual faith.", "crossRefs": [{"ref": "John 5:24", "explanation": "'Whoever hears my word and believes him who sent me has eternal life.' The promise of eternal life through belief is repeated throughout John."}], "words": [{"english": "eternal life", "original": "ζωὴν αἰώνιον", "transliteration": "zōēn aiōnion", "pronunciation": "zo-AYN ai-OH-nee-on", "strongs": "G2222, G166", "partOfSpeech": "noun + adjective", "literalMeaning": "life of the age, life of the coming era", "definition": "Zōē aiōnios — not just 'life that lasts forever' but 'the life of the coming age.' Aiōnios comes from aiōn (age/era). It describes the quality of life belonging to God's eternal kingdom — life that begins NOW for the believer, not just after death (see 17:3). It's God's own kind of life shared with humanity.", "translationNote": "'Eternal life' captures the duration but misses the quality. It's not just endless existence — it's a completely different KIND of life. The life of the age to come, experienced now.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 16, "verseText": "For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.", "freshTranslation": "For this is how much God loved the world: He gave His one and only Son, so that everyone who trusts in Him would not be destroyed but would have the life of the coming age.", "historicalContext": "The most famous verse in the Bible. Every word carries weight: 'God' (the initiator), 'so loved' (the motive — not anger but love), 'the world' (the scope — not just Israel but all humanity), 'gave' (the cost — not loaned or sent but GAVE), 'His only Son' (the sacrifice — the most precious thing in existence), 'whosoever' (the universality), 'believes' (the condition — faith, not works), 'not perish' (the deliverance), 'everlasting life' (the gift).", "crossRefs": [{"ref": "Romans 5:8", "explanation": "'God demonstrates his own love for us in this: while we were still sinners, Christ died for us.' Same theology — love initiated while we were enemies."}, {"ref": "1 John 4:9-10", "explanation": "'This is love: not that we loved God, but that he loved us and sent his Son as an atoning sacrifice.' John restates John 3:16 in his epistle."}, {"ref": "Genesis 22:2", "explanation": "'Take your son, your only son Isaac, whom you love.' God asked Abraham to sacrifice his only son on a mountain — then provided a substitute. At Golgotha, God provided no substitute for His own Son."}], "words": [{"english": "so loved", "original": "οὕτως ἠγάπησεν", "transliteration": "houtōs ēgapēsen", "pronunciation": "HOO-tohs ay-GAH-pay-sen", "strongs": "G3779, G25", "partOfSpeech": "adverb + verb, aorist active indicative", "literalMeaning": "in this way/to this degree loved", "definition": "Houtōs means 'in this manner' or 'to this degree' — it points forward to the giving. Agapaō is self-sacrificial love, the highest form in Greek. The aorist tense marks a decisive, historical act of love — not an ongoing feeling but a completed action expressed in the giving of the Son. God's love isn't sentiment; it's sacrifice.", "translationNote": "'So' in English sounds like 'very much' (God loved the world SO MUCH). The Greek houtōs means 'in this way' — God loved the world IN THIS MANNER: by giving His Son. It's about the method of love, not just the degree.", "twisted": false, "twistedExplanation": null}, {"english": "the world", "original": "τὸν κόσμον", "transliteration": "ton kosmon", "pronunciation": "ton KOS-mon", "strongs": "G2889", "partOfSpeech": "noun, accusative", "literalMeaning": "the ordered world, the realm of humanity", "definition": "Kosmos in John has a complex range — it can mean the created order, the realm of humanity, or humanity in its rebellion against God. Here it means all of fallen humanity — the world that is in darkness (1:5), that didn't recognize its Creator (1:10). God loves the very world that rejects Him. This is radical — most ancient religions assumed the gods were indifferent or hostile to humanity.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "his only begotten Son", "original": "τὸν υἱὸν τὸν μονογενῆ", "transliteration": "ton huion ton monogenē", "pronunciation": "ton hwee-ON ton mon-og-en-AY", "strongs": "G5207, G3439", "partOfSpeech": "noun + adjective", "literalMeaning": "the son, the only-of-its-kind, the unique one", "definition": "Monogenēs does NOT mean 'only begotten' (as if the Son were created/begotten). It comes from monos (only) + genos (kind/type), meaning 'one of a kind, unique, the only one of its class.' The Latin Vulgate mistranslated it as unigenitus (only-begotten), and that error persisted for centuries. Jesus is the unique, one-of-a-kind Son — not a created being who was 'begotten' at some point.", "translationNote": "'Only begotten' is a mistranslation that has caused centuries of theological confusion. Monogenēs means 'one and only' or 'unique' — not 'begotten/created.' The NIV correctly translates it 'one and only Son.'", "twisted": true, "twistedExplanation": "The KJV 'only begotten' comes from Jerome's Latin unigenitus, which emphasizes begetting/generation. But the Greek monogenēs emphasizes uniqueness, not origin. Arius used 'begotten' to argue the Son was created; the church fathers insisted monogenēs means unique. This translation error fueled the biggest heresy in church history."}, {"english": "believeth", "original": "πιστεύων", "transliteration": "pisteuōn", "pronunciation": "pis-TYOO-own", "strongs": "G4100", "partOfSpeech": "verb, present active participle", "literalMeaning": "the one believing, the one trusting", "definition": "Present participle — ongoing, continuous faith. Not a one-time decision but a lifestyle of trusting. Pisteuō in John means personal trust and commitment — putting your weight on something, not just intellectual agreement. The condition for eternal life is not performance but trust.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "perish", "original": "ἀπόληται", "transliteration": "apolētai", "pronunciation": "ah-POL-ay-tai", "strongs": "G622", "partOfSpeech": "verb, aorist middle subjunctive", "literalMeaning": "be destroyed, be ruined, be lost", "definition": "Apollymi means to destroy, to ruin utterly, to lose. It doesn't necessarily mean 'cease to exist' (annihilation) nor 'suffer forever' (eternal torment) — the word itself means destruction/ruin. The alternative to eternal life isn't specified further than 'perishing' — being ruined, wasted, lost. The emphasis is on what you gain (life), not the details of what you escape.", "translationNote": "'Perish' is accurate. The word carries finality — complete ruin, the opposite of abundant life.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 17, "verseText": "For God sent not his Son into the world to condemn the world; but that the world through him might be saved.", "freshTranslation": "For God did not send His Son into the world to condemn it, but to save the world through Him.", "historicalContext": "This corrects a common assumption: that God's primary posture toward humanity is judgment. Many first-century Jews expected the Messiah to come as a judge — condemning Gentiles and sinful Jews. Jesus reverses this: the Son came to SAVE, not condemn. The world was already condemned (v.18); Jesus came to rescue, not to add more judgment.", "crossRefs": [{"ref": "Luke 19:10", "explanation": "'The Son of Man came to seek and to save the lost.' Same mission statement."}, {"ref": "John 12:47", "explanation": "Jesus repeats: 'I did not come to judge the world, but to save the world.'"}], "words": [{"english": "to condemn", "original": "κρίνῃ", "transliteration": "krinē", "pronunciation": "KREE-nay", "strongs": "G2919", "partOfSpeech": "verb, aorist active subjunctive", "literalMeaning": "to judge, to condemn, to separate", "definition": "Krinō means to judge, to pass sentence, to separate. It's where we get 'crisis' and 'criterion.' God didn't send Jesus to pronounce judgment on an already-broken world — that would be redundant. He sent Him to rescue it. Judgment is a consequence of rejecting the rescue (v.18), not the purpose of the mission.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "might be saved", "original": "σωθῇ", "transliteration": "sōthē", "pronunciation": "so-THAY", "strongs": "G4982", "partOfSpeech": "verb, aorist passive subjunctive", "literalMeaning": "might be saved, rescued, delivered, made whole", "definition": "Sōzō means to save, rescue, deliver, heal, make whole. It's comprehensive — physical healing, spiritual salvation, and ultimate deliverance are all included. The passive voice (be saved) emphasizes that salvation is something done TO us by God, not something we achieve ourselves.", "translationNote": "Accurate. Sōzō is richer than English 'saved' — it encompasses rescue, healing, and wholeness.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 18, "verseText": "He that believeth on him is not condemned: but he that believeth not is condemned already, because he hath not believed in the name of the only begotten Son of God.", "freshTranslation": "Whoever trusts in Him is not condemned. But whoever does not trust is condemned already, because they have not trusted in the name of God's one and only Son.", "historicalContext": "The judgment isn't future — it's present tense. Those who reject Jesus are 'condemned already' (ēdē kekritai — perfect tense, settled state). The condemnation isn't a sentence God imposes from outside; it's the natural consequence of refusing the only rescue available. Like a drowning person who refuses a life preserver — they aren't being punished; they're choosing the water.", "crossRefs": [{"ref": "John 5:24", "explanation": "'Whoever hears my word and believes... has crossed over from death to life.' The transition happens now, not at future judgment."}], "words": [{"english": "is condemned already", "original": "ἤδη κέκριται", "transliteration": "ēdē kekritai", "pronunciation": "AY-day KEK-ree-tai", "strongs": "G2235, G2919", "partOfSpeech": "adverb + verb, perfect passive indicative", "literalMeaning": "already has been judged", "definition": "Ēdē (already) + kekritai (perfect tense — has been judged and remains in that state). The judgment isn't pending or future — it's the current, settled condition of everyone who refuses to trust. The perfect tense means this isn't a momentary status but an ongoing state that began when they rejected the Son.", "translationNote": "Accurate. The present reality of judgment is clear in the Greek — 'condemned already,' not 'will be condemned later.'", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 19, "verseText": "And this is the condemnation, that light is come into the world, and men loved darkness rather than light, because their deeds were evil.", "freshTranslation": "And this is the basis for the judgment: the light has come into the world, but people loved the darkness more than the light because their actions were evil.", "historicalContext": "The condemnation isn't arbitrary — it's based on a choice. Light arrived; people chose darkness. They weren't condemned for ignorance but for preference — they loved (ēgapēsan, the same word used for God's love in 3:16) the darkness. The same capacity for love that could respond to God is redirected toward darkness.", "crossRefs": [{"ref": "John 1:5", "explanation": "'The light shines in the darkness, and the darkness has not overcome it.' The opening theme of the gospel — light vs. darkness."}, {"ref": "John 1:9-11", "explanation": "'The true light that gives light to everyone was coming into the world... He came to his own, and his own did not receive him.'"}], "words": [{"english": "loved darkness rather than light", "original": "ἠγάπησαν οἱ ἄνθρωποι μᾶλλον τὸ σκότος ἢ τὸ φῶς", "transliteration": "ēgapēsan hoi anthrōpoi mallon to skotos ē to phōs", "pronunciation": "ay-GAH-pay-san hoy AN-thro-poy MAL-lon to SKO-tos ay to FOHS", "strongs": "G25, G4655, G5457", "partOfSpeech": "verb + nouns", "literalMeaning": "people loved the darkness more than the light", "definition": "Agapaō again — the same self-giving love God has for the world (v.16), humans direct toward darkness. Skotos (darkness) and phōs (light) are John's primary theological metaphors. The tragedy: people don't just tolerate darkness — they love it. They prefer it. They choose it over the light that could save them.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 20, "verseText": "For every one that doeth evil hateth the light, neither cometh to the light, lest his deeds should be reproved.", "freshTranslation": "Everyone who practices evil hates the light and avoids it, so that their deeds won't be exposed.", "historicalContext": "The reason people avoid the light: it exposes what they want to keep hidden. Like a criminal avoiding surveillance cameras, people who practice evil instinctively avoid Jesus because His presence reveals the truth about them. This explains why Nicodemus came at NIGHT — even as a seeker, he was cautious about exposure.", "crossRefs": [{"ref": "Ephesians 5:11-13", "explanation": "'Have nothing to do with the fruitless deeds of darkness, but rather expose them... everything exposed by the light becomes visible.'"}], "words": [{"english": "hateth the light", "original": "μισεῖ τὸ φῶς", "transliteration": "misei to phōs", "pronunciation": "mis-AY to FOHS", "strongs": "G3404, G5457", "partOfSpeech": "verb + noun", "literalMeaning": "hates/detests the light", "definition": "Miseō means to hate, detest, reject. This is visceral — evildoers don't just avoid the light; they hate it because it threatens their self-deception. The light doesn't just illuminate — it judges, exposes, and demands response. That's why it provokes hatred rather than mere discomfort.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 21, "verseText": "But he that doeth truth cometh to the light, that his deeds may be made manifest, that they are wrought in God.", "freshTranslation": "But whoever lives by the truth comes toward the light, so that it may be plainly seen that their actions have been done through God.", "historicalContext": "The contrast: those who live honestly WELCOME exposure because their actions were empowered by God and can withstand scrutiny. 'Doing truth' is a Hebrew idiom (found in the Dead Sea Scrolls) meaning living with integrity. These people come to the light because they have nothing to hide — and because they want God to receive credit for the good in their lives.", "crossRefs": [{"ref": "1 John 1:7", "explanation": "'If we walk in the light, as he is in the light, we have fellowship with one another.' Walking in light produces community and transparency."}], "words": [{"english": "doeth truth", "original": "ποιῶν τὴν ἀλήθειαν", "transliteration": "poiōn tēn alētheian", "pronunciation": "poy-OHN tayn ah-LAY-thay-ahn", "strongs": "G4160, G225", "partOfSpeech": "verb, participle + noun", "literalMeaning": "doing/practicing the truth", "definition": "Poieō tēn alētheian — 'doing the truth.' This is a Hebrew idiom (עשה אמת / asah emet) meaning living with integrity, practicing what is genuine. Truth in John isn't just intellectual accuracy — it's lived reality. You don't just believe truth; you DO it.", "translationNote": "'Doeth truth' sounds strange in English because we think of truth as something you KNOW, not something you DO. The Hebrew concept is richer — truth is a way of living, not just a set of facts.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 22, "verseText": "After these things came Jesus and his disciples into the land of Judaea; and there he tarried with them, and baptized.", "freshTranslation": "After this, Jesus and His disciples went into the Judean countryside, where He spent time with them and was baptizing.", "historicalContext": "The scene shifts from the private nighttime conversation to public ministry. Jesus and His disciples are baptizing in Judea — the same region where John the Baptist is operating. This sets up the tension in the next verses: two baptizing ministries in overlapping territory.", "crossRefs": [{"ref": "John 4:2", "explanation": "John later clarifies: 'Jesus himself did not baptize, but only his disciples.' The disciples performed the baptisms under Jesus' authority."}], "words": [{"english": "baptized", "original": "ἐβάπτιζεν", "transliteration": "ebaptizen", "pronunciation": "eh-BAP-tid-zen", "strongs": "G907", "partOfSpeech": "verb, imperfect active indicative", "literalMeaning": "was immersing, was dipping", "definition": "Baptizō means to immerse, to dip, to submerge. The imperfect tense indicates ongoing, repeated action — they were conducting an ongoing baptismal ministry. John 4:2 clarifies that the disciples did the actual baptizing, but it was under Jesus' authority and direction.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 23, "verseText": "And John also was baptizing in Aenon near to Salim, because there was much water there: and they came, and were baptized.", "freshTranslation": "John was also baptizing at Aenon near Salim, because there was plenty of water there, and people kept coming to be baptized.", "historicalContext": "Aenon (from Hebrew 'ayin — springs/fountains) near Salim was chosen for its abundant water supply — necessary for baptism by immersion. John and Jesus were operating parallel ministries, which inevitably led to comparisons and competition (from the disciples' perspective, not John's).", "crossRefs": [], "words": [{"english": "much water", "original": "ὕδατα πολλά", "transliteration": "hydata polla", "pronunciation": "HOO-dah-tah pol-LAH", "strongs": "G5204, G4183", "partOfSpeech": "noun + adjective", "literalMeaning": "many waters, abundant water", "definition": "The practical note about 'much water' confirms that baptism required full immersion — you can't sprinkle with 'much water.' The detail also shows John as a careful historian recording geographic specifics that could be verified by his readers.", "translationNote": "Accurate. The implication for baptismal practice (immersion vs. sprinkling) is significant.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 24, "verseText": "For John was not yet cast into prison.", "freshTranslation": "(This was before John had been thrown into prison.)", "historicalContext": "A chronological note placing this before Herod Antipas arrested John for denouncing his marriage to Herodias (Mark 6:17-18). John's gospel covers a period the other gospels skip — the overlapping ministries of Jesus and John the Baptist before John's imprisonment.", "crossRefs": [{"ref": "Mark 6:17", "explanation": "'Herod himself had given orders to have John arrested, and he had him bound and put in prison.'"}], "words": [{"english": "cast into prison", "original": "βεβλημένος εἰς τὴν φυλακήν", "transliteration": "beblēmenos eis tēn phylakēn", "pronunciation": "beh-blay-MEN-os ays tayn foo-lak-AYN", "strongs": "G906, G5438", "partOfSpeech": "verb, perfect passive participle + noun", "literalMeaning": "having been thrown into the prison/guard", "definition": "Ballō (to throw, cast) in the perfect passive — 'having been thrown.' Phylakē means prison or guard (from phylassō — to guard/watch). John's imprisonment and execution are recorded in Mark 6. John's gospel provides pre-imprisonment context the Synoptics lack.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 25, "verseText": "Then there arose a question between some of John's disciples and the Jews about purifying.", "freshTranslation": "A dispute arose between John's disciples and a Jewish man about ceremonial washing.", "historicalContext": "The dispute about 'purifying' (katharismos — ritual cleansing) likely concerned whose baptism was more valid — John's or Jesus'. Jewish ritual purification had strict rules, and both Jesus and John were offering an alternative cleansing. This controversy drives John's disciples to bring their complaint to their master.", "crossRefs": [], "words": [{"english": "purifying", "original": "καθαρισμοῦ", "transliteration": "katharismou", "pronunciation": "kah-thar-is-MOO", "strongs": "G2512", "partOfSpeech": "noun, genitive", "literalMeaning": "cleansing, purification", "definition": "Katharismos means ritual cleansing or purification — the same word used for Jewish ceremonial washings. The dispute was about which baptism truly purifies: John's, Jesus', or the traditional Jewish mikvahs. This is the same tension that surrounded Jesus' first sign at Cana, where He turned purification water into wine (2:6).", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 26, "verseText": "And they came unto John, and said unto him, Rabbi, he that was with thee beyond Jordan, to whom thou barest witness, behold, the same baptizeth, and all men come to him.", "freshTranslation": "They went to John and said, 'Rabbi, the man who was with you across the Jordan — the one you testified about — look, He is baptizing and everyone is going to Him!'", "historicalContext": "John's disciples are jealous. Their rabbi endorsed Jesus, and now Jesus is drawing bigger crowds. They don't use Jesus' name — 'that man who was with you' — showing disdain. 'All men come to him' is hyperbole born of anxiety. They see Jesus as a competitor; John sees Him as the purpose.", "crossRefs": [], "words": [{"english": "all men come to him", "original": "πάντες ἔρχονται πρὸς αὐτόν", "transliteration": "pantes erchontai pros auton", "pronunciation": "PAN-tes ER-khon-tai pros ow-TON", "strongs": "G3956, G2064", "partOfSpeech": "adjective + verb, present middle indicative", "literalMeaning": "all are coming toward him", "definition": "Pantes (all, everyone) is hyperbolic — not literally everyone, but the crowds are clearly shifting from John to Jesus. The present tense erchontai (are coming) indicates an ongoing trend that's accelerating. John's disciples see a crisis; John sees God's plan unfolding exactly as it should.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 27, "verseText": "John answered and said, A man can receive nothing, except it be given him from heaven.", "freshTranslation": "John replied, 'A person can only receive what is given to them from heaven.'", "historicalContext": "John's response is stunning in its humility. Instead of jealousy, he states a principle: all ministry, all fruitfulness, all success comes from God — it's given, not earned or stolen. If Jesus is drawing larger crowds, it's because heaven wills it. John can no more compete with Jesus than a servant can compete with the master.", "crossRefs": [{"ref": "James 1:17", "explanation": "'Every good and perfect gift is from above, coming down from the Father of lights.'"}, {"ref": "1 Corinthians 4:7", "explanation": "'What do you have that you did not receive? And if you did receive it, why do you boast as though you did not?'"}], "words": [{"english": "receive", "original": "λαμβάνειν", "transliteration": "lambanein", "pronunciation": "lam-BAN-ayn", "strongs": "G2983", "partOfSpeech": "verb, present active infinitive", "literalMeaning": "to take, to receive, to grasp", "definition": "Lambanō means to receive or take hold of. John uses it broadly — a person can only receive (ministry, calling, authority, success) what heaven gives. This applies to both John and Jesus: each has received exactly what God intended for them.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "from heaven", "original": "ἐκ τοῦ οὐρανοῦ", "transliteration": "ek tou ouranou", "pronunciation": "ek too oo-rah-NOO", "strongs": "G3772", "partOfSpeech": "preposition + noun", "literalMeaning": "out of the heaven/sky", "definition": "Ek (out of, from) tou ouranou (heaven) — meaning from God. 'Heaven' is a Jewish circumlocution for God Himself. John's principle: everything comes from God's hand. If Jesus' ministry is growing, God is the one growing it.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 28, "verseText": "Ye yourselves bear me witness, that I said, I am not the Christ, but that I am sent before him.", "freshTranslation": "You yourselves can testify that I said, 'I am not the Messiah — I was sent ahead of Him.'", "historicalContext": "John reminds his disciples of what he already told them: he was never the main event. He was the forerunner, the opening act, the voice in the wilderness. His entire identity was 'the one who goes before.' If his disciples understood his mission, they wouldn't be jealous — they'd be celebrating.", "crossRefs": [{"ref": "John 1:20", "explanation": "John had publicly declared: 'I am not the Christ.' He's been consistent from the beginning."}, {"ref": "Malachi 3:1", "explanation": "'I will send my messenger, who will prepare the way before me.' John IS this messenger."}], "words": [{"english": "the Christ", "original": "ὁ Χριστός", "transliteration": "ho Christos", "pronunciation": "ho khris-TOS", "strongs": "G5547", "partOfSpeech": "noun with definite article", "literalMeaning": "the Anointed One, the Messiah", "definition": "Christos is the Greek translation of Hebrew Mashiach (Messiah) — the Anointed One. Kings, priests, and prophets were anointed with oil to mark God's commissioning. THE Christ was the ultimate anointed figure who would fulfill all three roles. John firmly denies being this figure.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 29, "verseText": "He that hath the bride is the bridegroom: but the friend of the bridegroom, which standeth and heareth him, rejoiceth greatly because of the bridegroom's voice: this my joy therefore is fulfilled.", "freshTranslation": "The one who has the bride is the bridegroom. But the bridegroom's friend, who stands nearby and listens for him, is overjoyed when he hears the bridegroom's voice. That is my joy, and it is now complete.", "historicalContext": "John uses a wedding metaphor. In Jewish weddings, the 'friend of the bridegroom' (shoshbin) had the honor of arranging the wedding, standing guard outside the bridal chamber, and announcing when the bridegroom arrived. His joy was complete when he heard the groom's voice — mission accomplished. John casts himself as the shoshbin and Jesus as the bridegroom. His joy isn't diminished by Jesus' success — it's FULFILLED by it.", "crossRefs": [{"ref": "Ephesians 5:25-27", "explanation": "'Christ loved the church and gave himself up for her.' The church as Christ's bride — the metaphor John introduces here."}, {"ref": "Revelation 19:7", "explanation": "'The wedding of the Lamb has come, and his bride has made herself ready.' The ultimate fulfillment of the bridegroom imagery."}], "words": [{"english": "the bridegroom", "original": "ὁ νυμφίος", "transliteration": "ho nymphios", "pronunciation": "ho noom-FEE-os", "strongs": "G3566", "partOfSpeech": "noun, nominative", "literalMeaning": "the bridegroom, the groom", "definition": "Nymphios means bridegroom — used throughout Scripture for God's/Christ's relationship with His people. In the OT, God is Israel's husband (Isaiah 54:5, Hosea 2:16). John the Baptist casts Jesus in this role, making a profound theological claim: Jesus is the divine bridegroom that the prophets foretold.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the friend of the bridegroom", "original": "ὁ φίλος τοῦ νυμφίου", "transliteration": "ho philos tou nymphiou", "pronunciation": "ho FEE-los too noom-FEE-oo", "strongs": "G5384, G3566", "partOfSpeech": "noun + noun, genitive", "literalMeaning": "the friend/beloved of the bridegroom", "definition": "Philos (friend, loved one) of the nymphios (bridegroom). The shoshbin in Jewish weddings had an honored but subordinate role. He facilitated the wedding but was not the groom. John perfectly defines his own role: essential but secondary. His entire existence points to someone else.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 30, "verseText": "He must increase, but I must decrease.", "freshTranslation": "He must become greater, and I must become less.", "historicalContext": "One of the most quoted verses in Scripture and the perfect summary of John the Baptist's theology. The 'must' (dei) is divine necessity — this isn't reluctant resignation but joyful submission to God's plan. John sees his own diminishing not as loss but as the fulfillment of his purpose. The greatest compliment to a forerunner is that he's no longer needed.", "crossRefs": [{"ref": "Philippians 1:21", "explanation": "Paul echoes the same self-emptying: 'For to me, to live is Christ and to die is gain.'"}], "words": [{"english": "must increase", "original": "δεῖ αὐξάνειν", "transliteration": "dei auxanein", "pronunciation": "day owx-AH-nayn", "strongs": "G1163, G837", "partOfSpeech": "verb + verb, present active infinitive", "literalMeaning": "it is necessary to grow, to increase", "definition": "Dei (divine necessity) plus auxanō (to grow, increase). The present infinitive indicates ongoing growth — Jesus' influence will keep expanding. This isn't a temporary shift but a permanent trajectory: Jesus' name will be known in every nation; John's will be known only in connection to Jesus.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "must decrease", "original": "δεῖ ἐλαττοῦσθαι", "transliteration": "dei elattousthai", "pronunciation": "day el-at-TOO-sthai", "strongs": "G1163, G1642", "partOfSpeech": "verb + verb, present passive infinitive", "literalMeaning": "it is necessary to become less, to diminish", "definition": "Elattoomai means to become less, to diminish, to decrease. The passive voice suggests this diminishing is done TO John by God — it's part of the divine plan, not a personal failure. John's decrease is as much God's work as Jesus' increase. Both are necessary for salvation history.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 31, "verseText": "He that cometh from above is above all: he that is of the earth is earthly, and speaketh of the earth: he that cometh from heaven is above all.", "freshTranslation": "The one who comes from above is above everything. The one who is from the earth belongs to the earth and speaks from an earthly perspective. The one who comes from heaven is above all.", "historicalContext": "It's debated whether verses 31-36 are still John the Baptist speaking or John the author's commentary. Either way, the theology is clear: Jesus' authority is absolute because His origin is heavenly. Earthly teachers (including the Baptist) speak from limited, earthly perspective. Jesus speaks from direct heavenly experience.", "crossRefs": [{"ref": "John 3:13", "explanation": "'No one has ascended to heaven except he who came down from heaven.' Same principle — only Jesus has heavenly access."}], "words": [{"english": "from above", "original": "ἄνωθεν", "transliteration": "anōthen", "pronunciation": "AH-no-then", "strongs": "G509", "partOfSpeech": "adverb", "literalMeaning": "from above, from a higher place", "definition": "The same anōthen from verse 3 — but here unmistakably meaning 'from above' (not 'again'). Jesus' origin is heaven, which gives Him absolute authority over all earthly teachers, prophets, and systems. Position determines authority, and Jesus' position is the highest possible.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 32, "verseText": "And what he hath seen and heard, that he testifieth; and no man receiveth his testimony.", "freshTranslation": "He testifies to what He has seen and heard, yet no one accepts His testimony.", "historicalContext": "The tragedy repeats: Jesus speaks from firsthand heavenly knowledge, and humanity rejects it. 'No one' (oudeis) is hyperbolic — some DO receive it (v.33). But the general pattern is rejection, which John has established from 1:10-11: 'He was in the world... and the world did not know him.'", "crossRefs": [{"ref": "John 1:11", "explanation": "'He came to his own, and his own people did not receive him.' The rejection theme runs throughout John."}], "words": [{"english": "seen and heard", "original": "ἑώρακεν καὶ ἤκουσεν", "transliteration": "heōraken kai ēkousen", "pronunciation": "heh-OH-rah-ken kai AY-koo-sen", "strongs": "G3708, G191", "partOfSpeech": "verb, perfect active + verb, aorist active", "literalMeaning": "has seen (and continues to see) and heard", "definition": "Two different tenses: heōraken (perfect — has seen with lasting effect) and ēkousen (aorist — heard at a point in time). Jesus' testimony is based on direct, personal, ongoing perception of heavenly realities — not secondhand reports, not theological speculation, but eyewitness experience.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 33, "verseText": "He that hath received his testimony hath set to his seal that God is true.", "freshTranslation": "Whoever has accepted His testimony has certified that God is truthful.", "historicalContext": "The flip side: those who DO receive Jesus' testimony are essentially putting their seal of authentication on God Himself. In the ancient world, sealing a document meant authenticating it as genuine. By believing Jesus, you're declaring God trustworthy — because Jesus speaks God's words.", "crossRefs": [{"ref": "1 John 5:10", "explanation": "'Whoever believes in the Son of God accepts this testimony. Whoever does not believe God has made him out to be a liar.'"}], "words": [{"english": "set to his seal", "original": "ἐσφράγισεν", "transliteration": "esphragisen", "pronunciation": "es-FRAH-gis-en", "strongs": "G4972", "partOfSpeech": "verb, aorist active indicative", "literalMeaning": "sealed, certified, authenticated", "definition": "Sphragizō means to seal — pressing a signet ring into wax to authenticate a document. By accepting Jesus' testimony, a person certifies that God is true. Conversely, rejecting Jesus is calling God a liar (1 John 5:10). Faith in Jesus is simultaneously a verdict on God's character.", "translationNote": "'Set to his seal' is archaic but captures the legal/authentication sense. Modern: 'has certified' or 'has authenticated.'", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 34, "verseText": "For he whom God hath sent speaketh the words of God: for God giveth not the Spirit by measure unto him.", "freshTranslation": "For the one God sent speaks God's own words, because God gives the Spirit without limit.", "historicalContext": "This explains WHY Jesus' words are God's words: He has the Spirit without measure. Old Testament prophets received the Spirit in limited portions for specific tasks. Jesus has the Spirit in unlimited fullness — every word He speaks is a word of God because the Spirit's presence in Him is total and unrestrained.", "crossRefs": [{"ref": "Colossians 1:19", "explanation": "'God was pleased to have all his fullness dwell in him.' The unlimited Spirit corresponds to the fullness of deity."}, {"ref": "Isaiah 11:2", "explanation": "'The Spirit of the LORD will rest on him — the Spirit of wisdom and of understanding, the Spirit of counsel and of might.' Isaiah prophesied the unlimited anointing."}], "words": [{"english": "not the Spirit by measure", "original": "οὐ ἐκ μέτρου δίδωσιν τὸ πνεῦμα", "transliteration": "ou ek metrou didōsin to pneuma", "pronunciation": "oo ek MET-roo DID-oh-sin to PNYOO-mah", "strongs": "G3358, G4151", "partOfSpeech": "preposition + noun + verb + noun", "literalMeaning": "not from/by measure gives the spirit", "definition": "Metron means measure, portion, allotment. God gives the Spirit to Jesus not by metron — not in measured, limited portions — but in unlimited fullness. Prophets got drops; Jesus got the ocean. This unmeasured anointing is what makes His words absolutely identical to God's words. There's no gap between what God thinks and what Jesus says.", "translationNote": "Accurate, though modern readers may miss the contrast with OT prophets who received measured portions of the Spirit.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 35, "verseText": "The Father loveth the Son, and hath given all things into his hand.", "freshTranslation": "The Father loves the Son and has placed everything in His hands.", "historicalContext": "The deepest motivation behind everything: the Father's love for the Son. This isn't just functional delegation — it's relational. The Father gives ALL things to the Son because of love. 'All things' includes authority over creation, judgment, salvation, and the Spirit. Nothing is held back.", "crossRefs": [{"ref": "Matthew 28:18", "explanation": "'All authority in heaven and on earth has been given to me.' Jesus confirms this after the resurrection."}, {"ref": "John 13:3", "explanation": "'Jesus knew that the Father had put all things under his power.' Same principle stated before the Last Supper."}], "words": [{"english": "all things into his hand", "original": "πάντα δέδωκεν ἐν τῇ χειρὶ αὐτοῦ", "transliteration": "panta dedōken en tē cheiri autou", "pronunciation": "PAN-tah DEH-do-ken en tay KHAY-ree ow-TOO", "strongs": "G3956, G1325, G5495", "partOfSpeech": "adjective + verb, perfect active + noun", "literalMeaning": "all things has given in his hand", "definition": "Dedōken (perfect tense of didōmi — to give) means 'has given and it remains given.' Panta (all things, everything) is comprehensive — nothing excluded. Cheir (hand) represents authority and control. The Father's gift to the Son is total and permanent authority over everything that exists.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 36, "verseText": "He that believeth on the Son hath everlasting life: and he that believeth not the Son shall not see life; but the wrath of God abideth on him.", "freshTranslation": "Whoever trusts in the Son has eternal life. But whoever rejects the Son will not see life — instead, God's wrath remains on them.", "historicalContext": "The chapter ends with the starkest possible contrast: eternal life or divine wrath. There's no middle ground. Note 'has' (present tense) — eternal life is a current possession for the believer, not just a future hope. And 'remains' (menei) for wrath — it's not a new punishment added but a pre-existing condition that hasn't been removed because the person refused the remedy.", "crossRefs": [{"ref": "1 John 5:12", "explanation": "'Whoever has the Son has life; whoever does not have the Son of God does not have life.' John restates this binary in his epistle."}, {"ref": "Romans 1:18", "explanation": "'The wrath of God is being revealed from heaven against all the godlessness and wickedness of people.' Paul describes the same abiding wrath."}], "words": [{"english": "hath everlasting life", "original": "ἔχει ζωὴν αἰώνιον", "transliteration": "echei zōēn aiōnion", "pronunciation": "EKH-ay zo-AYN ai-OH-nee-on", "strongs": "G2192, G2222, G166", "partOfSpeech": "verb, present active + noun + adjective", "literalMeaning": "has/possesses life of the age", "definition": "Echō (to have, possess) in the present tense — the believer CURRENTLY possesses eternal life. It's not a future reward but a present reality. Zōē aiōnios (life of the coming age) begins the moment someone trusts in the Son. You don't wait for death to start living eternally.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "believeth not / rejecteth", "original": "ἀπειθῶν", "transliteration": "apeithōn", "pronunciation": "ah-pay-THONE", "strongs": "G544", "partOfSpeech": "verb, present active participle", "literalMeaning": "disobeying, refusing to believe, rejecting", "definition": "Apeitheō means to disobey, to refuse to be persuaded, to reject. This is a different word than 'not believing' (ou pisteuōn). It's active rejection, willful disobedience — not passive ignorance. The person who apeithei has heard and deliberately refused. This makes the wrath not arbitrary punishment but a consequence of conscious choice.", "translationNote": "KJV 'believeth not' is too passive. The Greek apeithōn means active REJECTION or disobedience — choosing to refuse, not merely failing to believe. This distinction matters enormously.", "twisted": true, "twistedExplanation": "Translating apeithōn as simply 'believeth not' softens it dramatically. The Greek word means willful disobedience/rejection — these are people who have been presented with the truth and actively refuse it. It's not about people who never heard; it's about people who heard and said no."}, {"english": "the wrath of God abideth on him", "original": "ἡ ὀργὴ τοῦ θεοῦ μένει ἐπ' αὐτόν", "transliteration": "hē orgē tou theou menei ep' auton", "pronunciation": "hay or-GAY too theh-OO MEN-ay ep ow-TON", "strongs": "G3709, G3306", "partOfSpeech": "noun + verb, present active indicative", "literalMeaning": "the wrath/anger of God remains/abides upon him", "definition": "Orgē (wrath — settled, principled opposition to evil, not emotional rage) menei (remains, abides, stays — the same word used for Jesus 'abiding' in John 15). The wrath doesn't COME upon the rejecter as something new — it REMAINS. It was already there. Apart from Christ, wrath is humanity's default condition. Faith removes it; rejection leaves it in place.", "translationNote": "'Abideth' perfectly captures menei — remains, stays, doesn't leave. The wrath isn't imposed as punishment; it simply isn't removed because the person refused the only remedy.", "twisted": false, "twistedExplanation": null}]}]}