{"book": "John", "bookGreek": "Κατὰ Ἰωάννην", "chapter": 4, "author": "John (Ἰωάννης / Yohanan — 'God is gracious'), son of Zebedee, one of the twelve apostles. Called 'the disciple whom Jesus loved.' Wrote late in life from Ephesus around 85-95 AD.", "audience": "Greek-speaking believers and seekers in Asia Minor (modern Turkey).", "historicalContext": "John 4 records Jesus' journey through Samaria, a region Jews typically avoided by crossing the Jordan and traveling through Perea. The deep hostility between Jews and Samaritans dated back to the Assyrian deportation of 722 BC and was intensified when the Samaritans built a rival temple on Mount Gerizim around 400 BC, which the Jewish leader John Hyrcanus destroyed in 128 BC. Jesus' deliberate choice to pass through Samaria and engage a Samaritan woman — doubly scandalous given her gender and ethnic identity — signals the universal scope of His mission. The chapter also features a royal official (basilikos) from Capernaum, likely connected to Herod Antipas' court, showing Jesus' reach across social boundaries.", "verses": [{"verseNumber": 1, "verseText": "When therefore the Lord knew how the Pharisees had heard that Jesus made and baptized more disciples than John,", "freshTranslation": "So when Jesus learned that the Pharisees had heard He was making and baptizing more disciples than John,", "historicalContext": "The Pharisees were monitoring the growing movements of both John the Baptist and Jesus. Their attention likely signaled potential opposition, prompting Jesus to withdraw northward rather than provoke an early confrontation.", "crossRefs": [{"ref": "John 3:22-26", "explanation": "The preceding context of Jesus and John both baptizing in Judea."}, {"ref": "Matthew 4:12", "explanation": "Matthew notes Jesus withdrew to Galilee after John's arrest, a parallel movement northward."}], "words": [{"english": "When therefore", "original": "Ὡς οὖν", "transliteration": "Hōs oun", "pronunciation": "hoce oon", "strongs": "G5613/G3767", "partOfSpeech": "conjunction + conjunction (inferential)", "literalMeaning": "as/when + therefore/so", "definition": "Ὡς is a versatile conjunction meaning 'when,' 'as,' or 'how,' depending on context. Combined with οὖν ('therefore'), it creates a temporal-logical bridge linking what follows to the preceding narrative — 'so when' or 'when therefore.'", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the Lord", "original": "ὁ Κύριος", "transliteration": "ho Kyrios", "pronunciation": "ho KOO-ree-oss", "strongs": "G2962", "partOfSpeech": "noun, nominative singular masculine with article", "literalMeaning": "lord, master, one with authority", "definition": "Κύριος denotes one who exercises supreme authority. In secular Greek it meant 'master' or 'owner,' but in the Septuagint it translates the divine name YHWH over 6,000 times. John's use of Κύριος here rather than simply 'Jesus' carries theological weight — acknowledging His divine authority even in a narrative transition.", "translationNote": "Some manuscripts read 'Jesus' instead of 'the Lord.' The title Kyrios carries divine overtones that 'Jesus' alone does not.", "twisted": false, "twistedExplanation": null}, {"english": "knew", "original": "ἔγνω", "transliteration": "egnō", "pronunciation": "EG-noh", "strongs": "G1097", "partOfSpeech": "verb, aorist active indicative, 3rd person singular", "literalMeaning": "to know by experience, to come to know", "definition": "Γινώσκω means to know through experience, observation, or perception — a knowledge gained through engagement rather than mere intellectual awareness. The aorist tense here marks a specific point when Jesus became aware of the Pharisees' intelligence. This is experiential knowledge, distinct from οἶδα (intuitive/complete knowledge).", "translationNote": "English 'knew' doesn't capture the distinction between ginōskō (experiential knowing) and oida (inherent knowing). Here it means 'came to learn' or 'became aware.'", "twisted": false, "twistedExplanation": null}, {"english": "the Pharisees", "original": "οἱ Φαρισαῖοι", "transliteration": "hoi Pharisaioi", "pronunciation": "hoy far-ih-SAY-oy", "strongs": "G5330", "partOfSpeech": "noun, nominative plural masculine with article", "literalMeaning": "separated ones (from Hebrew parash, to separate)", "definition": "The Pharisees were a religious party devoted to meticulous observance of the Torah and oral traditions. Numbering around 6,000 in Jesus' day according to Josephus, they held significant influence over synagogue worship and popular piety. Their name likely derives from their self-understanding as 'set apart' for holiness, though their opponents may have used it derisively.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "had heard", "original": "ἤκουσαν", "transliteration": "ēkousan", "pronunciation": "AY-koo-san", "strongs": "G191", "partOfSpeech": "verb, aorist active indicative, 3rd person plural", "literalMeaning": "to hear, to listen, to receive a report", "definition": "Ἀκούω means to hear, listen to, or receive a report. It implies not just the physical act of hearing but comprehending and responding to what is heard. In this context, it indicates the Pharisees received intelligence reports about Jesus' growing influence.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Jesus", "original": "Ἰησοῦς", "transliteration": "Iēsous", "pronunciation": "ee-ay-SOOS", "strongs": "G2424", "partOfSpeech": "noun, nominative singular masculine (proper)", "literalMeaning": "YHWH saves (from Hebrew Yehoshua/Yeshua)", "definition": "The Greek form of the Hebrew name Yeshua (Joshua), meaning 'YHWH is salvation.' This was a common Jewish name in the first century. The angel specified this name because 'He will save His people from their sins' (Matt 1:21), making the name itself a prophecy of His mission.", "translationNote": "The English 'Jesus' passes through Greek Iēsous from Hebrew Yeshua. The salvific meaning of the name ('God saves') is invisible in English.", "twisted": false, "twistedExplanation": null}, {"english": "made and baptized", "original": "ποιεῖ καὶ βαπτίζει", "transliteration": "poiei kai baptizei", "pronunciation": "poy-AY kai bap-TID-zay", "strongs": "G4160/G2532/G907", "partOfSpeech": "verb present active indicative + conjunction + verb present active indicative", "literalMeaning": "makes/does + and + immerses/dips", "definition": "Ποιέω means to make, do, or produce — here meaning to gain or recruit disciples. Βαπτίζω literally means to dip, immerse, or submerge. Originally used of dipping cloth in dye or drawing water by dipping a vessel, it took on ritual significance in Jewish purification practices. The present tense of both verbs suggests ongoing, habitual activity.", "translationNote": "Βαπτίζω literally means 'to immerse/submerge,' not merely 'to sprinkle.' The full physical imagery of immersion is lost in the English 'baptize,' which is a transliteration rather than a translation.", "twisted": false, "twistedExplanation": null}, {"english": "more disciples", "original": "πλείονας μαθητὰς", "transliteration": "pleionas mathētas", "pronunciation": "PLAY-oh-nas mah-thay-TAHS", "strongs": "G4119/G3101", "partOfSpeech": "adjective comparative + noun accusative plural masculine", "literalMeaning": "more/greater + learners/pupils", "definition": "Μαθητής means a learner, pupil, or apprentice — one who attaches themselves to a teacher to learn both doctrine and way of life. In the ancient world, discipleship was total life commitment, not mere intellectual study. Πλείων is the comparative of πολύς (many), indicating Jesus' movement was outpacing the Baptist's.", "translationNote": "English 'disciple' has become a religious term. The Greek carries the earthy sense of 'apprentice' or 'student who follows a master.'", "twisted": false, "twistedExplanation": null}, {"english": "than John", "original": "ἢ Ἰωάννης", "transliteration": "ē Iōannēs", "pronunciation": "ay ee-oh-AHN-nace", "strongs": "G2228/G2491", "partOfSpeech": "conjunction (comparative) + noun nominative singular masculine (proper)", "literalMeaning": "than + God is gracious (Hebrew Yohanan)", "definition": "Ἰωάννης is the Greek form of Hebrew Yohanan, meaning 'YHWH is gracious.' Here it refers to John the Baptist, the forerunner of Jesus. The comparison between their movements was inevitable and would have alarmed the Pharisees who already viewed John with suspicion.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 2, "verseText": "(Though Jesus himself baptized not, but his disciples,)", "freshTranslation": "(although Jesus Himself was not doing the baptizing — His disciples were)", "historicalContext": "This parenthetical clarification, likely added by John or a later editor, distinguishes Jesus' role as the authorizer of baptism from the physical act performed by His disciples. Jesus directed the ministry; others carried out the ritual washing.", "crossRefs": [{"ref": "John 3:22", "explanation": "States Jesus was baptizing, which this verse now clarifies as baptism done under His authority by disciples."}, {"ref": "1 Corinthians 1:14-17", "explanation": "Paul similarly distinguishes his preaching mission from the act of baptizing."}], "words": [{"english": "Though", "original": "καίτοιγε", "transliteration": "kaitoige", "pronunciation": "KAI-toy-geh", "strongs": "G2544", "partOfSpeech": "conjunction (concessive)", "literalMeaning": "and yet, although indeed", "definition": "A rare intensive concessive conjunction appearing only here in the New Testament. It combines καί (and), τοι (indeed), and γε (at least), creating a strong corrective parenthetical — 'and yet in fact.' Its rarity suggests a deliberate editorial insertion to correct a potential misunderstanding.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Jesus himself", "original": "Ἰησοῦς αὐτὸς", "transliteration": "Iēsous autos", "pronunciation": "ee-ay-SOOS ow-TOSS", "strongs": "G2424/G846", "partOfSpeech": "proper noun + pronoun intensive nominative masculine singular", "literalMeaning": "YHWH saves + he himself", "definition": "Αὐτός in the nominative with a noun functions as an intensive pronoun — 'He Himself' — emphasizing the personal distinction. Jesus Himself did not perform the physical act; His disciples did under His direction and authority.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "baptized not", "original": "οὐκ ἐβάπτιζεν", "transliteration": "ouk ebaptizen", "pronunciation": "ook eh-BAP-tid-zen", "strongs": "G3756/G907", "partOfSpeech": "adverb (negative) + verb imperfect active indicative 3rd singular", "literalMeaning": "not + was immersing", "definition": "The imperfect tense of βαπτίζω with the negation οὐκ indicates that Jesus was not in the habit of baptizing — it was not His ongoing practice. The imperfect captures habitual or continuous action in past time, clarifying that this was a consistent pattern, not a single exception.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "but his disciples", "original": "ἀλλ᾽ οἱ μαθηταὶ αὐτοῦ", "transliteration": "all' hoi mathētai autou", "pronunciation": "all hoy mah-thay-TIE ow-TOO", "strongs": "G235/G3588/G3101/G846", "partOfSpeech": "conjunction (adversative) + article + noun nominative plural masculine + pronoun genitive singular masculine", "literalMeaning": "but/rather + the + learners + of him", "definition": "Ἀλλά is a strong adversative conjunction meaning 'but' or 'on the contrary,' drawing a sharp contrast. The disciples were doing the actual immersing while Jesus focused on teaching and making disciples. This delegation pattern would continue throughout the early church.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 3, "verseText": "He left Judaea, and departed again into Galilee.", "freshTranslation": "He left Judea and headed back toward Galilee.", "historicalContext": "Jesus strategically withdrew from Judea to avoid premature confrontation with the Pharisees. His hour had not yet come. The journey from Judea to Galilee typically took about three days on foot.", "crossRefs": [{"ref": "John 2:1-11", "explanation": "Jesus' earlier time in Galilee at Cana, where He performed His first sign."}, {"ref": "Matthew 4:12", "explanation": "Matthew connects the withdrawal to Galilee with John the Baptist's imprisonment."}], "words": [{"english": "He left", "original": "ἀφῆκεν", "transliteration": "aphēken", "pronunciation": "ah-FAY-ken", "strongs": "G863", "partOfSpeech": "verb, aorist active indicative, 3rd person singular", "literalMeaning": "to send away, to leave, to let go", "definition": "Ἀφίημι means to send away, leave, release, or forgive. It combines ἀπό (from) and ἵημι (to send). Used widely in the NT for forgiveness of sins, here it simply means 'left' or 'departed from' — He released Himself from that region. The aorist tense presents this as a decisive action.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Judaea", "original": "Ἰουδαίαν", "transliteration": "Ioudaian", "pronunciation": "ee-oo-DIE-ahn", "strongs": "G2449", "partOfSpeech": "noun, accusative singular feminine (proper)", "literalMeaning": "land of Judah (praise)", "definition": "The southern region of Israel centered on Jerusalem, named after the tribe of Judah. In the first century, Judea was under direct Roman governance through a prefect (Pontius Pilate at this time). It was the heartland of Jewish religious authority, where the temple, Sanhedrin, and major Pharisaic schools were located.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "departed again", "original": "ἀπῆλθεν πάλιν", "transliteration": "apēlthen palin", "pronunciation": "ah-PEEL-then PAH-lin", "strongs": "G565/G3825", "partOfSpeech": "verb aorist active indicative 3rd singular + adverb", "literalMeaning": "went away + again/back", "definition": "Ἀπέρχομαι means to go away or depart, emphasizing movement away from one's current location. Πάλιν (again) indicates this was a return journey — Jesus had been in Galilee before (John 2:1-12) and was now going back. The word 'again' anchors this in John's ongoing geographical narrative.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "into Galilee", "original": "εἰς τὴν Γαλιλαίαν", "transliteration": "eis tēn Galilaian", "pronunciation": "ace tane gal-ih-LIE-ahn", "strongs": "G1519/G1056", "partOfSpeech": "preposition + article + noun accusative singular feminine (proper)", "literalMeaning": "into + the + circle/region (from Hebrew galil, circle/district)", "definition": "Galilee was the northern region of Israel, a fertile area around the Sea of Galilee. Its name derives from the Hebrew galil meaning 'circle' or 'district,' specifically 'Galilee of the nations' (Isa 9:1), reflecting its mixed Jewish-Gentile population. Under Herod Antipas' rule, it was more religiously diverse and less scrutinized by Jerusalem's religious establishment.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 4, "verseText": "And he must needs go through Samaria.", "freshTranslation": "And it was necessary for Him to pass through Samaria.", "historicalContext": "While the most direct route from Judea to Galilee passed through Samaria, many Jews took a longer route through Perea to avoid Samaritan territory. John's use of 'must' (edei) suggests divine necessity, not merely geographical convenience — Jesus had a God-appointed meeting at the well.", "crossRefs": [{"ref": "Luke 9:51-53", "explanation": "Another passage about Jesus passing through Samaria, where He was rejected by a Samaritan village."}, {"ref": "Acts 1:8", "explanation": "Jesus later commands His disciples to be witnesses in Samaria — this chapter previews that mission."}], "words": [{"english": "And", "original": "δὲ", "transliteration": "de", "pronunciation": "deh", "strongs": "G1161", "partOfSpeech": "conjunction (transitional)", "literalMeaning": "but, and, now", "definition": "Δέ is a mild transitional conjunction that can mean 'but,' 'and,' or 'now,' depending on context. It moves the narrative forward with a slight contrast or addition. Less strong than ἀλλά, it gently connects thoughts in a flowing narrative.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "he must needs", "original": "ἔδει αὐτὸν", "transliteration": "edei auton", "pronunciation": "EH-day ow-TON", "strongs": "G1163/G846", "partOfSpeech": "verb imperfect active indicative 3rd singular (impersonal) + pronoun accusative masculine singular", "literalMeaning": "it was necessary/binding + him", "definition": "Ἔδει is the imperfect of δεῖ, an impersonal verb expressing divine necessity or moral compulsion — 'it was necessary.' Throughout John's Gospel, this word signals God's sovereign purpose at work. This was not just the shortest route; it was a divinely ordained appointment. Jesus 'had to' pass through Samaria because the Father's will directed Him there.", "translationNote": "The word 'must' in English can sound like mere obligation. The Greek ἔδει carries the weight of divine necessity — God's plan required this journey through Samaria.", "twisted": false, "twistedExplanation": null}, {"english": "go through", "original": "διέρχεσθαι", "transliteration": "dierchesthai", "pronunciation": "dee-ER-khes-thigh", "strongs": "G1330", "partOfSpeech": "verb, present middle/passive infinitive", "literalMeaning": "to go through, to pass through", "definition": "Διέρχομαι combines διά (through) and ἔρχομαι (to come/go), meaning to travel through a region. The present infinitive suggests the ongoing nature of the journey — not a quick bypass but a deliberate passage through the territory.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Samaria", "original": "τῆς Σαμαρείας", "transliteration": "tēs Samareias", "pronunciation": "tace sam-ah-RAY-ahs", "strongs": "G4540", "partOfSpeech": "noun, genitive singular feminine (proper) with article", "literalMeaning": "watch-mountain (from Hebrew Shomron)", "definition": "Samaria was both a city and a region in central Israel, between Judea and Galilee. Named after the hill Shemer (1 Kings 16:24), it became the capital of the northern kingdom of Israel. After the Assyrian conquest in 722 BC, foreign settlers intermarried with remaining Israelites, creating a mixed population that Jews considered religiously impure. The Samaritans accepted only the Pentateuch and worshiped on Mount Gerizim rather than in Jerusalem.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 5, "verseText": "Then cometh he to a city of Samaria, which is called Sychar, near to the parcel of ground that Jacob gave to his son Joseph.", "freshTranslation": "So He came to a Samaritan town called Sychar, near the plot of land Jacob had given to his son Joseph.", "historicalContext": "Sychar is likely modern Askar, near ancient Shechem, at the foot of Mount Ebal. This area was rich with patriarchal history — Jacob purchased land here (Gen 33:19), and Joseph's bones were buried here (Josh 24:32). For the Samaritan woman, this was sacred ancestral ground.", "crossRefs": [{"ref": "Genesis 33:18-19", "explanation": "Jacob purchased this field from the sons of Hamor near Shechem."}, {"ref": "Genesis 48:22", "explanation": "Jacob gave Joseph a portion (Shechem) above his brothers."}, {"ref": "Joshua 24:32", "explanation": "Joseph's bones were buried in this plot at Shechem."}], "words": [{"english": "Then cometh he", "original": "ἔρχεται οὖν", "transliteration": "erchetai oun", "pronunciation": "ER-kheh-tie oon", "strongs": "G2064/G3767", "partOfSpeech": "verb present middle/passive indicative 3rd singular + conjunction", "literalMeaning": "comes/arrives + therefore", "definition": "Ἔρχομαι is one of the most common Greek verbs, meaning to come or arrive. The historical present tense (present tense for past events) creates vivid, eyewitness-style narration — a hallmark of John's storytelling. Οὖν ('therefore') links the arrival logically to the necessity stated in verse 4.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "to a city of Samaria", "original": "εἰς πόλιν τῆς Σαμαρείας", "transliteration": "eis polin tēs Samareias", "pronunciation": "ace POH-lin tace sam-ah-RAY-ahs", "strongs": "G1519/G4172/G4540", "partOfSpeech": "preposition + noun accusative singular feminine + noun genitive singular feminine", "literalMeaning": "into + city/town + of Samaria", "definition": "Πόλις means a city or town — any organized settlement with some civic structure. In first-century Palestine, even small towns could be called a πόλις. The genitive τῆς Σαμαρείας identifies the town as belonging to the Samaritan region.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "which is called Sychar", "original": "λεγομένην Συχάρ", "transliteration": "legomenēn Sychar", "pronunciation": "leg-OM-en-ane soo-KHAR", "strongs": "G3004/G4965", "partOfSpeech": "participle present passive accusative feminine singular + noun (indeclinable proper)", "literalMeaning": "being called + Sychar (possibly 'drunken' or 'falsehood' in Hebrew)", "definition": "Sychar is mentioned only here in the New Testament. Its identification is debated — some scholars link it to modern Askar, others to ancient Shechem itself. If the name derives from Hebrew shakhar ('drunken') or sheqer ('falsehood'), it may have been a Jewish nickname mocking the Samaritan town. Others connect it to the Hebrew sakhar ('reward').", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "near to the parcel of ground", "original": "πλησίον τοῦ χωρίου", "transliteration": "plēsion tou chōriou", "pronunciation": "play-SEE-on too kho-REE-oo", "strongs": "G4139/G5564", "partOfSpeech": "adverb (used as preposition) + noun genitive singular neuter with article", "literalMeaning": "near/close to + place/field/piece of land", "definition": "Χωρίον means a place, piece of land, or small field. It's a diminutive of χώρα (region/country), suggesting a specific, bounded plot of land. John's geographical precision here connects the narrative to patriarchal history and demonstrates intimate knowledge of the region.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "that Jacob gave", "original": "ὃ ἔδωκεν Ἰακὼβ", "transliteration": "ho edōken Iakōb", "pronunciation": "ho EH-doe-ken ee-ah-KOBE", "strongs": "G3739/G1325/G2384", "partOfSpeech": "relative pronoun + verb aorist active indicative 3rd singular + proper noun", "literalMeaning": "which + gave + heel-grasper/supplanter", "definition": "Ἰακώβ is the Greek form of Hebrew Ya'aqov (Jacob), meaning 'heel-grabber' or 'supplanter.' Jacob was the patriarch who wrestled with God and was renamed Israel. His gift of land to Joseph connected this specific location to centuries of covenant history, making it theologically significant ground for Jesus' self-revelation.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "to his son Joseph", "original": "τῷ υἱῷ αὐτοῦ Ἰωσήφ", "transliteration": "tō huiō autou Iōsēph", "pronunciation": "toe hwee-OH ow-TOO ee-oh-SAFE", "strongs": "G3588/G5207/G846/G2501", "partOfSpeech": "article dative + noun dative singular masculine + pronoun genitive + proper noun", "literalMeaning": "to the + son + of him + he will add (Hebrew Yosef)", "definition": "Ἰωσήφ is the Greek form of Hebrew Yosef, meaning 'he will add' or 'may God add.' Joseph was Jacob's favored son through Rachel. His burial site at Shechem (Josh 24:32) made this land doubly significant — both gift and grave. The mention grounds Jesus' encounter in patriarchal covenant geography.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 6, "verseText": "Now Jacob's well was there. Jesus therefore, being wearied with his journey, sat thus on the well: and it was about the sixth hour.", "freshTranslation": "Jacob's well was there, and Jesus, exhausted from the journey, sat down right by the well. It was about noon.", "historicalContext": "Jacob's well still exists today, about 135 feet deep, in the crypt of an Orthodox church near Nablus. The 'sixth hour' by Jewish reckoning was noon — the hottest part of the day and an unusual time for women to draw water. Jesus' physical exhaustion underscores His full humanity.", "crossRefs": [{"ref": "Hebrews 4:15", "explanation": "Jesus was tempted and tested in every way as we are — including physical weariness."}, {"ref": "Isaiah 40:28-31", "explanation": "The Creator who does not faint or grow weary took on flesh that does grow weary."}], "words": [{"english": "Jacob's well", "original": "πηγὴ τοῦ Ἰακώβ", "transliteration": "pēgē tou Iakōb", "pronunciation": "pay-GAY too ee-ah-KOBE", "strongs": "G4077/G2384", "partOfSpeech": "noun nominative singular feminine + proper noun genitive", "literalMeaning": "spring/fountain + of Jacob", "definition": "Πηγή means a spring, fountain, or source of water — flowing water, not stagnant. Interestingly, John calls it a πηγή (spring) here, but in verse 11-12 the woman calls it a φρέαρ (dug well). Jacob's well was actually a dug well fed by an underground spring, making both terms accurate. The word πηγή would become richly symbolic as Jesus offers 'living water.'", "translationNote": "English 'well' doesn't distinguish between a natural spring (πηγή) and a dug cistern (φρέαρ). John deliberately uses the 'spring' word, foreshadowing Jesus' offer of living water.", "twisted": false, "twistedExplanation": null}, {"english": "being wearied", "original": "κεκοπιακὼς", "transliteration": "kekopiakōs", "pronunciation": "keh-kop-ee-ah-KOCE", "strongs": "G2872", "partOfSpeech": "participle perfect active nominative masculine singular", "literalMeaning": "having labored to exhaustion, having grown weary", "definition": "Κοπιάω means to labor to the point of exhaustion, to grow weary from hard work. The perfect tense indicates a completed action with ongoing effects — Jesus had been worn out by the journey and was still in that state of exhaustion. This is one of the Gospel's most vivid portraits of Jesus' genuine humanity. The God who created the universe sat down tired and thirsty.", "translationNote": "English 'wearied' is mild. The Greek carries the force of physical exhaustion from hard labor — bone-tired, not just a little fatigued.", "twisted": false, "twistedExplanation": null}, {"english": "with his journey", "original": "ἐκ τῆς ὁδοιπορίας", "transliteration": "ek tēs hodoiporias", "pronunciation": "ek tace hod-oy-por-EE-ahs", "strongs": "G1537/G3597", "partOfSpeech": "preposition + noun genitive singular feminine with article", "literalMeaning": "from/out of + road-traveling/journeying", "definition": "Ὁδοιπορία combines ὁδός (road) and πορεύομαι (to travel), meaning the weariness of travel on foot. This word appears only here and in 2 Corinthians 11:26 in the NT. Walking from Judea to Samaria in the Palestinian heat along unpaved roads was genuinely grueling physical labor.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "sat thus", "original": "ἐκαθέζετο οὕτως", "transliteration": "ekathezeto houtōs", "pronunciation": "eh-kah-THED-zeh-toe HOO-toce", "strongs": "G2516/G3779", "partOfSpeech": "verb imperfect middle indicative 3rd singular + adverb", "literalMeaning": "was sitting down + thus/in this way", "definition": "Καθέζομαι means to sit down, to take a seat. The imperfect tense suggests He sat down and remained sitting. Οὕτως (thus, in this manner) likely means 'just as He was' — He plopped down unceremoniously, without preparation, just as a weary traveler would collapse at a resting spot.", "translationNote": "The 'thus' is often overlooked but paints a vivid picture — He sat down 'just like that,' exhausted, without ceremony.", "twisted": false, "twistedExplanation": null}, {"english": "on the well", "original": "ἐπὶ τῇ πηγῇ", "transliteration": "epi tē pēgē", "pronunciation": "ep-EE tay pay-GAY", "strongs": "G1909/G4077", "partOfSpeech": "preposition + noun dative singular feminine with article", "literalMeaning": "upon/beside + the spring/fountain", "definition": "Ἐπί with the dative means 'upon,' 'at,' or 'beside.' Jesus sat on or beside the well structure — likely on the stone rim or curb that surrounded the well opening. This casual posture set the stage for an intimate conversation.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "about the sixth hour", "original": "ὡς ἕκτη ὥρα", "transliteration": "hōs hektē hōra", "pronunciation": "hoce HEK-tay HO-rah", "strongs": "G5613/G1623/G5610", "partOfSpeech": "adverb + adjective nominative singular feminine + noun nominative singular feminine", "literalMeaning": "about/approximately + sixth + hour", "definition": "Ὥρα means an hour or a set time. By Jewish reckoning (counting from sunrise around 6 AM), the sixth hour was noon — the hottest part of the day. Some scholars argue John uses Roman reckoning (from midnight), making it 6 AM, but the Jewish calculation fits the narrative better: a woman drawing water at noon was unusual, suggesting she was avoiding other women.", "translationNote": "The timing is crucial to the story. Noon was not the normal water-drawing time (early morning or evening was standard). This woman came alone at the heat of the day, likely to avoid social stigma.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 7, "verseText": "There cometh a woman of Samaria to draw water: Jesus saith unto her, Give me to drink.", "freshTranslation": "A Samaritan woman came to draw water. Jesus said to her, 'Give me a drink.'", "historicalContext": "A Jewish rabbi speaking to an unknown woman in public was extraordinary — rabbis were warned against public conversation with women, even their own wives. That this woman was also a Samaritan made the request doubly shocking. Jesus broke social, religious, and gender barriers with four simple words.", "crossRefs": [{"ref": "Genesis 24:17", "explanation": "Abraham's servant met Rebekah at a well and asked for water — a betrothal type-scene in Hebrew narrative."}, {"ref": "Genesis 29:1-12", "explanation": "Jacob met Rachel at a well — another betrothal type-scene."}, {"ref": "Exodus 2:15-21", "explanation": "Moses met Zipporah at a well — continuing the pattern of significant meetings at wells."}], "words": [{"english": "There cometh a woman", "original": "ἔρχεται γυνὴ", "transliteration": "erchetai gynē", "pronunciation": "ER-kheh-tie goo-NAY", "strongs": "G2064/G1135", "partOfSpeech": "verb present middle indicative 3rd singular + noun nominative singular feminine", "literalMeaning": "comes + woman/wife", "definition": "Γυνή means woman or wife. It's used respectfully — the same word Jesus used to address His mother at Cana (John 2:4). The historical present tense (ἔρχεται) again creates vivid, cinematic narration. She arrives unnamed — her identity will be defined not by her past but by her encounter with Jesus.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "of Samaria", "original": "ἐκ τῆς Σαμαρείας", "transliteration": "ek tēs Samareias", "pronunciation": "ek tace sam-ah-RAY-ahs", "strongs": "G1537/G4540", "partOfSpeech": "preposition + noun genitive singular feminine with article", "literalMeaning": "out of/from + Samaria", "definition": "Ἐκ with the genitive means 'out of' or 'from,' indicating origin. This identifies the woman's ethnic and religious identity as Samaritan — a critical detail that frames the entire conversation. She is an outsider to Jewish covenant community, yet Jesus deliberately seeks her out.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "to draw water", "original": "ἀντλῆσαι ὕδωρ", "transliteration": "antlēsai hydōr", "pronunciation": "ant-LAY-sigh HOO-dore", "strongs": "G501/G5204", "partOfSpeech": "verb aorist active infinitive + noun accusative singular neuter", "literalMeaning": "to draw out/bail out + water", "definition": "Ἀντλέω means to draw water, originally referring to bailing water from the bilge of a ship. It implies the use of a container lowered on a rope into a deep well. Ὕδωρ is the common word for water, which will become theologically loaded in this conversation as Jesus contrasts physical water with 'living water.'", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Give me to drink", "original": "Δός μοι πεῖν", "transliteration": "Dos moi pein", "pronunciation": "DOSE moy pine", "strongs": "G1325/G3427/G4095", "partOfSpeech": "verb aorist active imperative 2nd singular + pronoun dative 1st singular + verb aorist active infinitive", "literalMeaning": "give + to me + to drink", "definition": "Δίδωμι in the aorist imperative is a direct, urgent request — 'Give!' Πίνω means to drink. Jesus' request is shockingly direct. By asking a Samaritan woman for a drink, He made Himself vulnerable and dependent on her, reversing the expected power dynamic. The Creator of water asked a social outcast for a cup of water.", "translationNote": "The directness of the Greek imperative is stronger than English 'give me a drink.' It's a bold, unhedged request that broke every social convention simultaneously.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 8, "verseText": "(For his disciples were gone away unto the city to buy meat.)", "freshTranslation": "(His disciples had gone into the town to buy food.)", "historicalContext": "The disciples' absence was necessary for this intimate conversation. That they would buy food in a Samaritan town shows they were not as strict as some Jews about avoiding Samaritan goods, though the practice was debated among rabbis.", "crossRefs": [{"ref": "John 4:31", "explanation": "The disciples return later and urge Jesus to eat, picking up this parenthetical thread."}], "words": [{"english": "his disciples", "original": "οἱ μαθηταὶ αὐτοῦ", "transliteration": "hoi mathētai autou", "pronunciation": "hoy mah-thay-TIE ow-TOO", "strongs": "G3101/G846", "partOfSpeech": "noun nominative plural masculine with article + pronoun genitive singular masculine", "literalMeaning": "the learners/apprentices + of him", "definition": "Μαθητής denotes a learner who follows a teacher in both doctrine and life. Jesus' disciples had left Him alone — an unusual circumstance that John explains parenthetically. Their absence at this precise moment was providential, allowing the conversation to unfold without the social pressure of multiple Jewish men present.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "were gone away", "original": "ἀπεληλύθεισαν", "transliteration": "apelēlytheisan", "pronunciation": "ah-peh-lay-LOO-thay-san", "strongs": "G565", "partOfSpeech": "verb pluperfect active indicative 3rd plural", "literalMeaning": "had gone away", "definition": "The pluperfect tense of ἀπέρχομαι indicates they had already departed before the woman arrived — the timing was set up in advance. This grammatical detail shows John's careful narrative construction.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "unto the city", "original": "εἰς τὴν πόλιν", "transliteration": "eis tēn polin", "pronunciation": "ace tane POH-lin", "strongs": "G1519/G4172", "partOfSpeech": "preposition + noun accusative singular feminine with article", "literalMeaning": "into + the city/town", "definition": "They went into the town of Sychar itself to purchase provisions. The article τήν points back to the specific town mentioned in verse 5.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "to buy meat", "original": "ἵνα τροφὰς ἀγοράσωσιν", "transliteration": "hina trophas agorasōsin", "pronunciation": "HEE-nah tro-FAHS ah-gor-AH-so-sin", "strongs": "G2443/G5160/G59", "partOfSpeech": "conjunction (purpose) + noun accusative plural feminine + verb aorist active subjunctive 3rd plural", "literalMeaning": "in order that + nourishments/foods + they might buy in the marketplace", "definition": "Τροφή means food or nourishment in general, not specifically meat. Ἀγοράζω means to buy in the marketplace (ἀγορά). The KJV's 'meat' reflects older English where 'meat' meant food generally. The disciples went shopping for provisions — bread, dried goods, whatever was available in a Samaritan market.", "translationNote": "KJV 'meat' is misleading to modern readers — τροφή means food/nourishment broadly, not flesh/meat specifically.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 9, "verseText": "Then saith the woman of Samaria unto him, How is it that thou, being a Jew, askest drink of me, which am a woman of Samaria? for the Jews have no dealings with the Samaritans.", "freshTranslation": "The Samaritan woman said to Him, 'How can you, a Jew, ask me, a Samaritan woman, for a drink?' (For Jews do not share vessels with Samaritans.)", "historicalContext": "The woman's surprise had multiple layers: gender (rabbi speaking to a woman), ethnicity (Jew speaking to a Samaritan), and ritual purity (sharing a drinking vessel would render a Jew ceremonially unclean by Pharisaic standards). The phrase 'have no dealings with' may more precisely mean 'do not use vessels in common with.'", "crossRefs": [{"ref": "Ezra 4:1-5", "explanation": "Historical roots of the Jewish-Samaritan hostility, when Samaritans were excluded from rebuilding the temple."}, {"ref": "Luke 10:33", "explanation": "Jesus' parable of the Good Samaritan also challenges Jewish-Samaritan prejudice."}], "words": [{"english": "the woman of Samaria", "original": "ἡ γυνὴ ἡ Σαμαρῖτις", "transliteration": "hē gynē hē Samaritis", "pronunciation": "hay goo-NAY hay sam-ah-REE-tis", "strongs": "G1135/G4541", "partOfSpeech": "noun nominative singular feminine + noun nominative singular feminine (gentile adjective)", "literalMeaning": "the woman + the Samaritan (feminine)", "definition": "Σαμαρῖτις is the feminine form of Σαμαρίτης (Samaritan). This double identification — woman and Samaritan — emphasizes both barriers that Jesus was crossing. In Jewish society, she represented a double outsider.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "How is it that thou", "original": "Πῶς σὺ", "transliteration": "Pōs sy", "pronunciation": "POCE soo", "strongs": "G4459/G4771", "partOfSpeech": "adverb (interrogative) + pronoun nominative 2nd singular", "literalMeaning": "how/in what way + you (emphatic)", "definition": "Πῶς is an interrogative adverb expressing astonishment — 'how is it possible?' The emphatic σύ ('you yourself') highlights the shocking nature of His request. She's not just asking for information; she's expressing genuine disbelief.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "being a Jew", "original": "Ἰουδαῖος ὢν", "transliteration": "Ioudaios ōn", "pronunciation": "ee-oo-DIE-oss own", "strongs": "G2453/G5607", "partOfSpeech": "adjective/noun nominative singular masculine + participle present active nominative masculine singular", "literalMeaning": "a Judean/Jew + being", "definition": "Ἰουδαῖος identifies someone as Jewish, either ethnically or religiously. The woman recognized Jesus as Jewish — likely from His clothing (tzitzit/fringes), dialect, or appearance. The participial construction ὤν ('being') implies this was self-evident — 'you, who are obviously a Jew.'", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "askest drink of me", "original": "παρ᾽ ἐμοῦ πεῖν αἰτεῖς", "transliteration": "par' emou pein aiteis", "pronunciation": "par eh-MOO pine eye-TACE", "strongs": "G3844/G1700/G4095/G154", "partOfSpeech": "preposition + pronoun genitive 1st singular + verb infinitive + verb present active indicative 2nd singular", "literalMeaning": "from beside + me + to drink + you are asking", "definition": "Αἰτέω means to ask or request, often implying asking from a position of need. Combined with παρά (from beside/from), it emphasizes that Jesus was asking her specifically, personally. The word order puts the shocking elements first: 'from me you ask to drink?' — the emphasis falls on the outrageous nature of the request.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "have no dealings with", "original": "οὐ συγχρῶνται", "transliteration": "ou synchrōntai", "pronunciation": "oo soong-KHRON-tie", "strongs": "G3756/G4798", "partOfSpeech": "adverb (negative) + verb present middle/passive indicative 3rd plural", "literalMeaning": "not + use together with/have dealings with", "definition": "Συγχράομαι means to use together with, to have dealings with, or to associate with. Some scholars translate it more specifically as 'do not share vessels with' — meaning the issue was ritual purity around shared cups and utensils, not a total social boycott. If Jesus drank from her vessel, He would be ceremonially contaminated by Pharisaic standards.", "translationNote": "The precise meaning is debated. 'Have no dealings with' may be too broad — 'do not share utensils with' better captures the specific purity concern at play in this water-drawing scene.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 10, "verseText": "Jesus answered and said unto her, If thou knewest the gift of God, and who it is that saith to thee, Give me to drink; thou wouldest have asked of him, and he would have given thee living water.", "freshTranslation": "Jesus answered her, 'If you knew the gift of God, and who it is asking you for a drink, you would have asked Him, and He would have given you living water.'", "historicalContext": "Jesus masterfully turns the conversation from physical water to spiritual reality. 'Living water' (hydōr zōn) had a double meaning: in everyday Greek it meant fresh, flowing spring water (as opposed to stagnant cistern water); in theological language it pointed to the life-giving Spirit of God. The Old Testament frequently used water imagery for God's provision and the coming messianic age.", "crossRefs": [{"ref": "Jeremiah 2:13", "explanation": "God calls Himself 'the fountain of living waters' and laments that His people dug broken cisterns."}, {"ref": "Isaiah 55:1", "explanation": "'Come, everyone who thirsts, come to the waters' — a messianic invitation."}, {"ref": "John 7:37-39", "explanation": "Jesus later cries out 'If anyone thirsts, let him come to me and drink,' explicitly linking living water to the Spirit."}], "words": [{"english": "the gift", "original": "τὴν δωρεὰν", "transliteration": "tēn dōrean", "pronunciation": "tane doe-reh-AHN", "strongs": "G1431", "partOfSpeech": "noun accusative singular feminine with article", "literalMeaning": "free gift, present", "definition": "Δωρεά means a free gift, an unearned present — emphasizing that it cannot be purchased or merited. It comes from δίδωμι (to give). This is not a reward for good behavior; it is sheer generosity from God. The 'gift of God' here likely refers to Jesus Himself, or the living water He offers, or both — they are inseparable.", "translationNote": "English 'gift' can imply something earned ('a gift for good grades'). The Greek δωρεά stresses absolute gratuity — no strings attached, no merit required.", "twisted": false, "twistedExplanation": null}, {"english": "of God", "original": "τοῦ Θεοῦ", "transliteration": "tou Theou", "pronunciation": "too theh-OO", "strongs": "G2316", "partOfSpeech": "noun genitive singular masculine with article", "literalMeaning": "of God", "definition": "Θεός is the standard Greek word for God. In the Septuagint, it translates both Elohim and YHWH. The genitive 'of God' identifies the source of the gift — it originates from God Himself. This is God's initiative, not a human achievement.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "living water", "original": "ὕδωρ ζῶν", "transliteration": "hydōr zōn", "pronunciation": "HOO-dore ZONE", "strongs": "G5204/G2198", "partOfSpeech": "noun accusative singular neuter + participle present active accusative neuter singular", "literalMeaning": "water + living/flowing", "definition": "Ὕδωρ ζῶν is a brilliantly layered expression. On the surface, 'living water' meant fresh, flowing spring water as opposed to stagnant cistern water — the woman would have understood it this way initially. But ζάω (to live) carries the full weight of divine, eternal life throughout John's Gospel. Jesus is offering water that is itself alive, that imparts life, that flows from the very source of existence. Jeremiah 2:13 calls God 'the fountain of living waters,' making this a veiled claim to divinity.", "translationNote": "The double meaning is impossible to capture in translation. In Greek, 'living water' simultaneously means 'fresh spring water' (practical) and 'life-giving water' (spiritual). The woman hears one; Jesus means both.", "twisted": false, "twistedExplanation": null}, {"english": "thou wouldest have asked", "original": "σὺ ἂν ᾔτησας", "transliteration": "sy an ētēsas", "pronunciation": "soo ahn AY-tay-sahs", "strongs": "G4771/G302/G154", "partOfSpeech": "pronoun nominative 2nd singular + particle (conditional) + verb aorist active indicative 2nd singular", "literalMeaning": "you + (would) + asked/requested", "definition": "This is a contrary-to-fact conditional — 'you would have asked (but you didn't because you don't know).' The ἄν particle with the aorist indicative creates an unreal past condition. Jesus gently reveals that the woman's ignorance, not His need, is the real issue. If she understood who He was, the roles would reverse — she would be the one asking.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 11, "verseText": "The woman saith unto him, Sir, thou hast nothing to draw with, and the well is deep: from whence then hast thou that living water?", "freshTranslation": "She said to Him, 'Sir, you don't even have a bucket, and this well is deep. Where would you get this living water?'", "historicalContext": "The woman responds on a purely practical level — she sees a traveler without a bucket at a well over 100 feet deep. Her use of 'Sir' (Kyrie) shows respect but not yet recognition. She shifts from πηγή (spring) to φρέαρ (dug well), using the more common, practical term.", "crossRefs": [{"ref": "John 3:4", "explanation": "Nicodemus similarly misunderstood Jesus' spiritual meaning, asking how one can be born a second time."}, {"ref": "John 6:34", "explanation": "The crowd later says 'Lord, give us this bread always' — another literal misunderstanding of spiritual truth."}], "words": [{"english": "Sir", "original": "Κύριε", "transliteration": "Kyrie", "pronunciation": "KOO-ree-eh", "strongs": "G2962", "partOfSpeech": "noun vocative singular masculine", "literalMeaning": "lord, sir, master", "definition": "Κύριος in the vocative case (direct address) can range from a polite 'sir' to a reverent 'Lord,' depending on the speaker's understanding. At this point, the woman uses it as a respectful form of address for a stranger — equivalent to 'sir.' As the conversation progresses, her understanding of who she's speaking to will deepen dramatically.", "translationNote": "The word's range from 'sir' to 'Lord' tracks the woman's growing recognition of Jesus throughout the chapter.", "twisted": false, "twistedExplanation": null}, {"english": "nothing to draw with", "original": "οὔτε ἄντλημα ἔχεις", "transliteration": "oute antlēma echeis", "pronunciation": "OO-teh ANT-lay-mah EH-khace", "strongs": "G3777/G502/G2192", "partOfSpeech": "conjunction (negative) + noun accusative singular neuter + verb present active indicative 2nd singular", "literalMeaning": "not even + a bucket/vessel for drawing + you have", "definition": "Ἄντλημα is the instrument used for drawing water — a bucket or vessel on a rope. This word appears only here in the NT. The woman's observation is practical and pointed: you have no equipment, and this well is deep. How exactly do you plan to produce any water, let alone 'living' water?", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the well is deep", "original": "τὸ φρέαρ ἐστὶν βαθύ", "transliteration": "to phrear estin bathy", "pronunciation": "toe FREH-ar es-TIN bah-THOO", "strongs": "G5421/G2076/G901", "partOfSpeech": "noun nominative singular neuter with article + verb present indicative 3rd singular + adjective nominative singular neuter", "literalMeaning": "the well/cistern + is + deep", "definition": "Φρέαρ means a dug well or cistern — distinct from πηγή (natural spring) used in verse 6. The woman uses the practical term for what she sees: a deep hole in the ground requiring a bucket and rope. Βαθύ means deep, both literally and metaphorically. Jacob's well is approximately 135 feet deep — genuinely impressive ancient engineering.", "translationNote": "John's switch between πηγή (v.6) and φρέαρ (here) is intentional. The narrator sees a spring (source of living water); the woman sees a well (deep hole needing a bucket).", "twisted": false, "twistedExplanation": null}, {"english": "from whence", "original": "πόθεν", "transliteration": "pothen", "pronunciation": "POH-then", "strongs": "G4159", "partOfSpeech": "adverb (interrogative)", "literalMeaning": "from where? from what source?", "definition": "Πόθεν asks about origin or source — 'from where?' In John's Gospel, questions about origin carry deep theological significance (cf. John 7:27, 8:14, 19:9). The woman asks practically, but the reader knows the answer is cosmic: the living water comes from God Himself.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 12, "verseText": "Art thou greater than our father Jacob, which gave us the well, and drank thereof himself, and his children, and his cattle?", "freshTranslation": "You're not greater than our ancestor Jacob, are you? He gave us this well and drank from it himself, along with his sons and his livestock.", "historicalContext": "The woman invokes Jacob's patriarchal authority — the well was a sign of his provision and blessing. Her claim to Jacob as 'our father' reflects the Samaritans' insistence that they too were descendants of the patriarchs, specifically through Joseph's sons Ephraim and Manasseh. The question expects a negative answer but ironically, the answer is yes.", "crossRefs": [{"ref": "John 8:53", "explanation": "'Are you greater than our father Abraham?' — the Jews ask the same type of question later."}, {"ref": "Matthew 12:6", "explanation": "Jesus declares 'something greater than the temple is here' — He consistently surpasses Israel's greatest figures and institutions."}], "words": [{"english": "Art thou greater", "original": "μὴ σὺ μείζων εἶ", "transliteration": "mē sy meizōn ei", "pronunciation": "may soo MIDE-zone ay", "strongs": "G3361/G4771/G3187/G1488", "partOfSpeech": "particle (negative, expecting 'no') + pronoun nominative 2nd singular + adjective comparative nominative masculine singular + verb present indicative 2nd singular", "literalMeaning": "surely not + you + greater + are", "definition": "Μή at the beginning of a question expects a negative answer — 'You're not greater than Jacob, are you?' (expecting 'no'). Μείζων is the comparative of μέγας (great), meaning 'greater.' The irony is profound: the woman expects a 'no,' but the answer is an emphatic 'yes' — Jesus is infinitely greater than Jacob. John uses this literary device repeatedly to create dramatic irony.", "translationNote": "The Greek particle μή signals the expected answer is 'no.' This dramatic irony — asking a question whose true answer is the opposite of what's expected — is a hallmark of John's Gospel.", "twisted": false, "twistedExplanation": null}, {"english": "our father Jacob", "original": "τοῦ πατρὸς ἡμῶν Ἰακώβ", "transliteration": "tou patros hēmōn Iakōb", "pronunciation": "too pah-TROSS hay-MONE ee-ah-KOBE", "strongs": "G3962/G2257/G2384", "partOfSpeech": "noun genitive singular masculine + pronoun genitive 1st plural + proper noun", "literalMeaning": "of the father + of us + Jacob", "definition": "Πατήρ (father) here means ancestor or patriarch. The woman's use of ἡμῶν ('our') is theologically loaded — Samaritans claimed patriarchal descent through Joseph, while Jews often denied this. By saying 'our father Jacob,' she asserts Samaritan legitimacy in the covenant line.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "gave us the well", "original": "ἔδωκεν ἡμῖν τὸ φρέαρ", "transliteration": "edōken hēmin to phrear", "pronunciation": "EH-doe-ken hay-MEEN toe FREH-ar", "strongs": "G1325/G2254/G5421", "partOfSpeech": "verb aorist active indicative 3rd singular + pronoun dative 1st plural + noun accusative singular neuter with article", "literalMeaning": "gave + to us + the well", "definition": "Δίδωμι (to give) in the aorist captures Jacob's gift as a historical, completed act — he gave this well as an inheritance. The claim that Jacob 'gave us the well' reflects local Samaritan tradition that this specific well was Jacob's personal legacy to the people of this land.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "drank thereof himself", "original": "αὐτὸς ἐξ αὐτοῦ ἔπιεν", "transliteration": "autos ex autou epien", "pronunciation": "ow-TOSS ex ow-TOO EH-pee-en", "strongs": "G846/G1537/G846/G4095", "partOfSpeech": "pronoun nominative masculine singular (intensive) + preposition + pronoun genitive + verb aorist active indicative 3rd singular", "literalMeaning": "he himself + out of + it + drank", "definition": "The intensive αὐτός ('he himself') emphasizes Jacob's personal use of the well — it was good enough for the patriarch himself. The woman's argument: if this water satisfied Jacob, his sons, and even his livestock, what more could anyone offer? The implied challenge: surely you can't improve on Jacob's provision.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 13, "verseText": "Jesus answered and said unto her, Whosoever drinketh of this water shall thirst again:", "freshTranslation": "Jesus answered, 'Everyone who drinks this water will get thirsty again.'", "historicalContext": "Jesus now draws a sharp contrast between the temporary nature of physical satisfaction and the permanent provision He offers. Every earthly source of fulfillment — whether water, wealth, relationships, or achievements — leaves the drinker thirsty again.", "crossRefs": [{"ref": "Ecclesiastes 1:8", "explanation": "'The eye is not satisfied with seeing, nor the ear filled with hearing' — the endless cycle of unsatisfied desire."}, {"ref": "Isaiah 55:1-2", "explanation": "'Why do you spend money for what is not bread?' — seeking satisfaction from sources that cannot truly satisfy."}], "words": [{"english": "Whosoever drinketh", "original": "πᾶς ὁ πίνων", "transliteration": "pas ho pinōn", "pronunciation": "pahs ho PEE-known", "strongs": "G3956/G4095", "partOfSpeech": "adjective nominative masculine singular + participle present active nominative masculine singular with article", "literalMeaning": "everyone + the one drinking", "definition": "Πᾶς (everyone, all) combined with the articular participle ὁ πίνων ('the one who drinks') creates a universal statement — anyone and everyone without exception. The present tense participle suggests habitual drinking — 'everyone who keeps drinking.' The statement applies universally to all earthly sources of satisfaction.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "of this water", "original": "ἐκ τοῦ ὕδατος τούτου", "transliteration": "ek tou hydatos toutou", "pronunciation": "ek too HOO-dah-tos TOO-too", "strongs": "G1537/G5204/G3778", "partOfSpeech": "preposition + noun genitive singular neuter with article + demonstrative pronoun genitive singular neuter", "literalMeaning": "from/out of + the water + this", "definition": "The demonstrative τούτου ('this') points specifically to Jacob's well water, but by extension to anything this world offers. Even the best provision from the greatest patriarch — water that satisfied Jacob himself — is ultimately temporary. The physical always leaves you wanting more.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "shall thirst again", "original": "διψήσει πάλιν", "transliteration": "dipsēsei palin", "pronunciation": "dip-SAY-say PAH-lin", "strongs": "G1372/G3825", "partOfSpeech": "verb future active indicative 3rd singular + adverb", "literalMeaning": "will thirst + again/once more", "definition": "Διψάω means to thirst, to be parched. The future tense makes this a certainty — will thirst, guaranteed. Πάλιν (again) underscores the endless cycle of earthly need and satisfaction. This is not a criticism of water but a statement about the nature of all created things: they satisfy temporarily but cannot quench the deepest human thirst.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 14, "verseText": "But whosoever drinketh of the water that I shall give him shall never thirst; but the water that I shall give him shall be in him a well of water springing up into everlasting life.", "freshTranslation": "But whoever drinks the water I give will never be thirsty again. The water I give will become an inner spring, bubbling up into eternal life.", "historicalContext": "This is one of Jesus' most profound self-revelatory statements. He claims to provide what no patriarch, prophet, or earthly source can — permanent satisfaction of the soul's deepest thirst. The imagery of an inner spring transforms the person from a consumer who must keep returning to a well into a source who carries living water within.", "crossRefs": [{"ref": "John 7:38", "explanation": "'Rivers of living water will flow from within him' — Jesus later expands this promise."}, {"ref": "Revelation 21:6", "explanation": "'I will give to the thirsty from the spring of the water of life without payment.'"}, {"ref": "Isaiah 12:3", "explanation": "'With joy you will draw water from the wells of salvation.'"}], "words": [{"english": "shall never thirst", "original": "οὐ μὴ διψήσει εἰς τὸν αἰῶνα", "transliteration": "ou mē dipsēsei eis ton aiōna", "pronunciation": "oo may dip-SAY-say ace ton eye-OH-nah", "strongs": "G3756/G3361/G1372/G1519/G165", "partOfSpeech": "double negative + verb future indicative + preposition + noun accusative singular masculine", "literalMeaning": "not not + will thirst + into + the age", "definition": "Οὐ μή is the strongest possible negation in Greek — an emphatic double negative meaning 'absolutely never, by no means ever.' Combined with εἰς τὸν αἰῶνα ('into the age,' i.e., forever), Jesus makes the most absolute promise possible: the one who drinks His water will never, ever, under any circumstances thirst again for all eternity. This is the language of permanent, irreversible transformation.", "translationNote": "English 'shall never thirst' captures the meaning but misses the emphatic force of the double negative. Greek οὐ μή is the linguistic equivalent of slamming the door shut — 'will absolutely never thirst, period.'", "twisted": false, "twistedExplanation": null}, {"english": "a well of water", "original": "πηγὴ ὕδατος", "transliteration": "pēgē hydatos", "pronunciation": "pay-GAY HOO-dah-toss", "strongs": "G4077/G5204", "partOfSpeech": "noun nominative singular feminine + noun genitive singular neuter", "literalMeaning": "spring/fountain + of water", "definition": "Here John returns to πηγή (spring/fountain) rather than φρέαρ (dug well). This is deliberate — the water Jesus gives is not stagnant, stored water in a cistern, but a living, active spring that continually produces fresh water from within. The person becomes a source, not just a recipient. This transforms one's entire relationship to spiritual sustenance.", "translationNote": "KJV 'well' obscures the distinction. This is πηγή (spring/fountain), not φρέαρ (dug well). A spring generates water; a well merely stores it. Jesus offers a generative source, not a storage tank.", "twisted": false, "twistedExplanation": null}, {"english": "springing up", "original": "ἁλλομένου", "transliteration": "hallomenou", "pronunciation": "hal-LOM-en-oo", "strongs": "G242", "partOfSpeech": "participle present middle/passive genitive neuter singular", "literalMeaning": "leaping, springing, bubbling up", "definition": "Ἅλλομαι means to leap, jump, or spring up — a vivid, energetic word. It's used of the lame man leaping in Acts 3:8 and 14:10. This water doesn't sit still; it leaps, gushes, and overflows with vitality. The present tense indicates continuous, ongoing action — always bubbling, never stagnant. This is the exuberant, irrepressible nature of the life Jesus gives.", "translationNote": "English 'springing up' is adequate but tame. The Greek word pictures water leaping and dancing with joyful energy — fountain water shooting upward, not a gentle trickle.", "twisted": false, "twistedExplanation": null}, {"english": "everlasting life", "original": "ζωὴν αἰώνιον", "transliteration": "zōēn aiōnion", "pronunciation": "zoe-ANE eye-OH-nee-on", "strongs": "G2222/G166", "partOfSpeech": "noun accusative singular feminine + adjective accusative singular feminine", "literalMeaning": "life + age-lasting/eternal", "definition": "Ζωή is the word for life in its fullest sense — not mere biological existence (βίος) but the vibrant, abundant, God-quality life. Αἰώνιος means 'of the age to come' or 'eternal' — pertaining to God's own realm of existence. Together, ζωὴ αἰώνιος is not just life that goes on forever, but life of a completely different quality — God's own life shared with humanity. This is John's central theme, stated in 3:16 and demonstrated throughout the Gospel.", "translationNote": "English 'everlasting life' focuses on duration. The Greek emphasizes quality as much as quantity — this is the life of the coming age, God's own quality of existence, not merely endless years.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 15, "verseText": "The woman saith unto him, Sir, give me this water, that I thirst not, neither come hither to draw.", "freshTranslation": "The woman said to Him, 'Sir, give me this water so I won't get thirsty and have to keep coming here to draw.'", "historicalContext": "Like Nicodemus in chapter 3, the woman still operates on the literal level — she wants water that eliminates her daily chore. Yet there may be a deeper longing beneath her practical request. Her daily trek to the well at noon, alone, to avoid other women, hints at the social thirst Jesus is about to address.", "crossRefs": [{"ref": "John 6:34", "explanation": "The crowd similarly says 'Lord, give us this bread always' — grasping at the literal rather than the spiritual."}, {"ref": "John 3:4", "explanation": "Nicodemus asked 'How can a man be born when he is old?' — the same pattern of literal misunderstanding."}], "words": [{"english": "give me this water", "original": "δός μοι τοῦτο τὸ ὕδωρ", "transliteration": "dos moi touto to hydōr", "pronunciation": "DOSE moy TOO-toe toe HOO-dore", "strongs": "G1325/G3427/G3778/G5204", "partOfSpeech": "verb aorist active imperative 2nd singular + pronoun dative 1st singular + demonstrative pronoun + noun accusative singular neuter", "literalMeaning": "give + to me + this + the water", "definition": "She echoes Jesus' own words from verse 7 — 'give me' (δός μοι). The roles have begun to reverse, just as Jesus predicted in verse 10. She is now the one asking. Though she still thinks literally, her request opens the door for Jesus to address the deeper need she doesn't yet know how to articulate.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "that I thirst not", "original": "ἵνα μὴ διψῶ", "transliteration": "hina mē dipsō", "pronunciation": "HEE-nah may dip-SO", "strongs": "G2443/G3361/G1372", "partOfSpeech": "conjunction (purpose) + particle (negative) + verb present active subjunctive 1st singular", "literalMeaning": "in order that + not + I may thirst", "definition": "The purpose clause reveals her motivation — she wants to be free from thirst permanently. On the surface, it's about convenience. But read spiritually, it's the universal human cry: free me from this endless cycle of need, of returning to sources that never permanently satisfy.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "neither come hither to draw", "original": "μηδὲ διέρχωμαι ἐνθάδε ἀντλεῖν", "transliteration": "mēde dierchōmai enthade antlein", "pronunciation": "may-DEH dee-ER-kho-my en-THAH-deh ant-LINE", "strongs": "G3366/G1330/G1759/G501", "partOfSpeech": "conjunction (negative) + verb present middle subjunctive 1st singular + adverb + verb present active infinitive", "literalMeaning": "nor + I pass through/come + here + to draw", "definition": "Διέρχομαι (to pass through/come) combined with ἐνθάδε (here/to this place) reveals that the woman's daily journey to this well was burdensome — she doesn't want to keep making this trip. Ἀντλεῖν (to draw water) was hard physical labor. Her request reveals both physical weariness and, perhaps unconsciously, a longing for something that would transform her daily existence.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 16, "verseText": "Jesus saith unto her, Go, call thy husband, and come hither.", "freshTranslation": "Jesus said to her, 'Go, call your husband, and come back here.'", "historicalContext": "Jesus abruptly shifts the conversation from theology to the woman's personal life. This is not a non sequitur — it's the pastoral application of 'living water.' Before she can receive what He offers, she must confront the truth about herself. Jesus' supernatural knowledge of her situation will become the catalyst for her faith.", "crossRefs": [{"ref": "Hebrews 4:12-13", "explanation": "The word of God exposes the thoughts and intentions of the heart — nothing is hidden from Him."}, {"ref": "John 1:47-48", "explanation": "Jesus demonstrated similar supernatural knowledge with Nathanael, which also led to faith."}], "words": [{"english": "Go, call", "original": "Ὕπαγε φώνησον", "transliteration": "Hypage phōnēson", "pronunciation": "HOO-pah-geh foe-NAY-son", "strongs": "G5217/G5455", "partOfSpeech": "verb present active imperative 2nd singular + verb aorist active imperative 2nd singular", "literalMeaning": "go/depart + call/summon", "definition": "Ὑπάγω means to go, to depart — a command to go away and do something. Φωνέω means to call out, to summon — it's related to φωνή (voice/sound). Two sharp imperatives in rapid succession: Go! Call! Jesus' direct command cuts through the theological discussion to the personal reality she's been avoiding.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "thy husband", "original": "τὸν ἄνδρα σου", "transliteration": "ton andra sou", "pronunciation": "tone AHN-drah soo", "strongs": "G435/G4675", "partOfSpeech": "noun accusative singular masculine with article + pronoun genitive 2nd singular", "literalMeaning": "the man/husband + of you", "definition": "Ἀνήρ means a man, specifically a husband when used with a possessive pronoun. Jesus knew she had no legitimate husband — this request was designed to bring her private life into the open. The word choice is deliberate: ἀνήρ as 'husband' will be contrasted with the five 'husbands' she has had and the man she currently lives with who is not her ἀνήρ.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "come hither", "original": "ἐλθὲ ἐνθάδε", "transliteration": "elthe enthade", "pronunciation": "el-THEH en-THAH-deh", "strongs": "G2064/G1759", "partOfSpeech": "verb aorist active imperative 2nd singular + adverb", "literalMeaning": "come + here/to this place", "definition": "A third imperative: come here. Jesus sends her away and calls her back — go, call, return. The pattern mirrors repentance itself: leave your current state, confront the truth, and come back to the source of living water. Jesus doesn't chase her away; He sends her out only to bring her back.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 17, "verseText": "The woman answered and said, I have no husband. Jesus said unto her, Thou hast well said, I have no husband:", "freshTranslation": "The woman answered, 'I don't have a husband.' Jesus said to her, 'You're right to say you don't have a husband.'", "historicalContext": "The woman's answer is technically true but evasive — she doesn't lie, but she doesn't volunteer the full truth either. Jesus' response validates her honesty ('you spoke well') while preparing to reveal that He knows far more than she disclosed.", "crossRefs": [{"ref": "Psalm 139:1-4", "explanation": "'O LORD, you have searched me and known me... even before a word is on my tongue, you know it altogether.'"}], "words": [{"english": "I have no husband", "original": "Οὐκ ἔχω ἄνδρα", "transliteration": "Ouk echō andra", "pronunciation": "ook EH-kho AHN-drah", "strongs": "G3756/G2192/G435", "partOfSpeech": "adverb (negative) + verb present active indicative 1st singular + noun accusative singular masculine", "literalMeaning": "not + I have + a man/husband", "definition": "A simple, factual statement that is both true and evasive. She technically does not have a husband — the man she lives with is not her husband. Her brevity contrasts with the complexity of her actual situation. Ἔχω (to have) is the most basic verb of possession. She doesn't 'have' what she's supposed to have.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Thou hast well said", "original": "Καλῶς εἶπας", "transliteration": "Kalōs eipas", "pronunciation": "kah-LOCE AY-pahs", "strongs": "G2573/G2036", "partOfSpeech": "adverb + verb aorist active indicative 2nd singular", "literalMeaning": "well/beautifully/rightly + you said", "definition": "Καλῶς means well, rightly, beautifully — Jesus acknowledges her statement as accurate and even commends it. This is not sarcasm but genuine acknowledgment: she told the truth as far as it went. Jesus meets her honesty with affirmation before gently exposing the rest of the story.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 18, "verseText": "For thou hast had five husbands; and he whom thou now hast is not thy husband: in that saidst thou truly.", "freshTranslation": "because you've had five husbands, and the man you're living with now is not your husband. What you said was true.", "historicalContext": "Five marriages was extremely unusual in the ancient world. Whether these ended through death, divorce, or abandonment is unknown. Some scholars see an allegorical reference to the five foreign gods brought to Samaria (2 Kings 17:24-33), but the straightforward personal reading is more compelling. Jesus demonstrates prophetic knowledge that will convince her He is more than an ordinary Jew.", "crossRefs": [{"ref": "2 Kings 17:24-33", "explanation": "Five nations brought five gods to Samaria — some see a symbolic parallel, though the literal reading is primary."}, {"ref": "John 2:24-25", "explanation": "Jesus 'knew what was in man' — His supernatural insight into human hearts is a consistent theme."}], "words": [{"english": "five husbands", "original": "πέντε ἄνδρας", "transliteration": "pente andras", "pronunciation": "PEN-teh AHN-drahs", "strongs": "G4002/G435", "partOfSpeech": "adjective/numeral + noun accusative plural masculine", "literalMeaning": "five + men/husbands", "definition": "Πέντε is the cardinal number five. Five successive husbands paints a picture of a life marked by repeated loss, upheaval, and perhaps social stigma. Whether through death, divorce, or abandonment, this woman's life had been defined by unstable relationships. Jesus speaks this without condemnation, simply as fact.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "is not thy husband", "original": "οὐκ ἔστιν σου ἀνήρ", "transliteration": "ouk estin sou anēr", "pronunciation": "ook ES-tin soo ah-NARE", "strongs": "G3756/G2076/G4675/G435", "partOfSpeech": "adverb (negative) + verb present indicative 3rd singular + pronoun genitive 2nd singular + noun nominative singular masculine", "literalMeaning": "not + is + your + man/husband", "definition": "Jesus distinguishes between cohabitation and marriage. The man she is currently with is not her ἀνήρ — not her husband. This is not a moral harangue but a clinical statement of fact. Jesus identifies the situation precisely without adding commentary or condemnation. The truth itself is sufficient.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "in that saidst thou truly", "original": "τοῦτο ἀληθὲς εἴρηκας", "transliteration": "touto alēthes eirēkas", "pronunciation": "TOO-toe ah-lay-THACE ay-RAY-kahs", "strongs": "G3778/G227/G2046", "partOfSpeech": "demonstrative pronoun + adjective nominative singular neuter + verb perfect active indicative 2nd singular", "literalMeaning": "this + true/unconcealed + you have said", "definition": "Ἀληθής means true, unconcealed — from α (not) + λανθάνω (to be hidden). Truth in Greek is literally 'the unhidden.' The perfect tense εἴρηκας ('you have spoken') gives the statement permanence — what she said stands as true. Jesus bookends His revelation with affirmations of her honesty, wrapping hard truth in respect.", "translationNote": "The Greek concept of truth (ἀλήθεια) as 'unhiddenness' is philosophically rich — truth is what is no longer concealed. Jesus brings the hidden into the open.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 19, "verseText": "The woman saith unto him, Sir, I perceive that thou art a prophet.", "freshTranslation": "The woman said to Him, 'Sir, I can see that you are a prophet.'", "historicalContext": "Her recognition escalates — from 'a Jew' (v.9) to 'Sir' (v.11) to now 'a prophet.' In Samaritan theology, the expected prophet was the Taheb (the 'Restorer'), based on Deuteronomy 18:15-18 — a Moses-like figure. Her identification of Jesus as a prophet was a significant theological step for a Samaritan.", "crossRefs": [{"ref": "Deuteronomy 18:15", "explanation": "'The LORD your God will raise up for you a prophet like me' — the foundational Samaritan messianic expectation."}, {"ref": "John 1:21", "explanation": "John the Baptist was asked 'Are you the Prophet?' — referencing the same Deuteronomy promise."}], "words": [{"english": "I perceive", "original": "θεωρῶ", "transliteration": "theōrō", "pronunciation": "theh-oh-ROE", "strongs": "G2334", "partOfSpeech": "verb present active indicative 1st singular", "literalMeaning": "I see, I observe, I perceive with understanding", "definition": "Θεωρέω means to observe, perceive, or contemplate — not a casual glance but careful consideration leading to understanding. It's the root of our word 'theory.' The woman has moved from physical sight to spiritual perception. She's beginning to 'see' Jesus for who He is.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "a prophet", "original": "προφήτης", "transliteration": "prophētēs", "pronunciation": "pro-FAY-tace", "strongs": "G4396", "partOfSpeech": "noun nominative singular masculine", "literalMeaning": "one who speaks forth, one who speaks before/for God", "definition": "Προφήτης combines πρό (before/forth) and φημί (to speak). A prophet speaks forth God's word and sometimes speaks beforehand (predicts). In Samaritan theology, which accepted only the Pentateuch, the primary prophetic expectation was the Taheb — a Moses-like figure promised in Deuteronomy 18:15. By calling Jesus a prophet, the woman places Him in the highest category her theology allowed.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 20, "verseText": "Our fathers worshipped in this mountain; and ye say, that in Jerusalem is the place where men ought to worship.", "freshTranslation": "Our ancestors worshiped on this mountain, but you Jews say Jerusalem is the place where people must worship.", "historicalContext": "Mount Gerizim, visible from Jacob's well, was the Samaritans' holy mountain. They built a temple there around 400 BC, which the Jewish leader John Hyrcanus destroyed in 128 BC — a wound that still festered. The 'where to worship' debate was the central point of division between Jews and Samaritans. She may be deflecting from her personal life, but Jesus takes the question seriously.", "crossRefs": [{"ref": "Deuteronomy 11:29", "explanation": "Moses commanded blessings be pronounced from Mount Gerizim — the Samaritans' textual basis for their worship site."}, {"ref": "2 Chronicles 6:6", "explanation": "'I have chosen Jerusalem that my name might be there' — the Jewish basis for Jerusalem worship."}], "words": [{"english": "Our fathers", "original": "οἱ πατέρες ἡμῶν", "transliteration": "hoi pateres hēmōn", "pronunciation": "hoy pah-TER-ess hay-MONE", "strongs": "G3962/G2257", "partOfSpeech": "noun nominative plural masculine with article + pronoun genitive 1st plural", "literalMeaning": "the fathers/ancestors + of us", "definition": "Πατέρες (fathers/ancestors) refers to the patriarchs and the Samaritan community's ancestral tradition. The claim 'our fathers' again asserts Samaritan legitimacy — they worshiped here for centuries. This was not an innovation but, in their view, the original and authentic practice.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "worshipped", "original": "προσεκύνησαν", "transliteration": "prosekynēsan", "pronunciation": "pros-eh-KOO-nay-san", "strongs": "G4352", "partOfSpeech": "verb aorist active indicative 3rd plural", "literalMeaning": "bowed down to, did obeisance, worshipped", "definition": "Προσκυνέω literally means to kiss toward, to bow down before, to prostrate oneself in reverence. It combines πρός (toward) and κυνέω (to kiss). This word will become central in verses 23-24 where Jesus redefines true worship. The physical gesture of bowing carries the spiritual meaning of surrender and adoration.", "translationNote": "The literal meaning 'to kiss toward' or 'to bow down and kiss (the ground/feet)' conveys physical intimacy and submission that English 'worship' — now an abstract concept — has lost.", "twisted": false, "twistedExplanation": null}, {"english": "in this mountain", "original": "ἐν τῷ ὄρει τούτῳ", "transliteration": "en tō orei toutō", "pronunciation": "en toe OR-ay TOO-toe", "strongs": "G1722/G3735/G3778", "partOfSpeech": "preposition + noun dative singular neuter with article + demonstrative pronoun dative singular neuter", "literalMeaning": "in/on + the mountain + this", "definition": "Ὄρος means mountain or hill. 'This mountain' is Mount Gerizim, visible from where they stood at Jacob's well. For the Samaritans, Gerizim was the chosen place of worship based on their reading of the Pentateuch — the mountain of blessing (Deut 11:29). Its ruins were still sacred to them even after Hyrcanus' destruction of their temple.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "ye say", "original": "ὑμεῖς λέγετε", "transliteration": "hymeis legete", "pronunciation": "hoo-MACE LEG-eh-teh", "strongs": "G5210/G3004", "partOfSpeech": "pronoun nominative 2nd plural (emphatic) + verb present active indicative 2nd plural", "literalMeaning": "you (yourselves/emphatic) + say/claim", "definition": "The emphatic ὑμεῖς ('you yourselves') draws a sharp line between 'our' tradition and 'your' claim. This is the sectarian divide made explicit — our fathers vs. you Jews. The present tense λέγετε ('you keep saying') indicates an ongoing, well-known Jewish position.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the place where men ought to worship", "original": "ὁ τόπος ὅπου προσκυνεῖν δεῖ", "transliteration": "ho topos hopou proskynein dei", "pronunciation": "ho TOP-oss HOP-oo pros-koo-NINE day", "strongs": "G5117/G3699/G4352/G1163", "partOfSpeech": "noun nominative singular masculine + adverb (relative) + verb present active infinitive + verb present active indicative impersonal", "literalMeaning": "the place + where + to worship + it is necessary", "definition": "Δεῖ (it is necessary) again signals divine obligation — where God requires worship. Τόπος means place or location. The woman frames worship as fundamentally about location — which mountain, which city? Jesus is about to dismantle this entire framework. True worship is not about τόπος but about πνεῦμα (spirit) and ἀλήθεια (truth).", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 21, "verseText": "Jesus saith unto her, Woman, believe me, the hour cometh, when ye shall neither in this mountain, nor yet at Jerusalem, worship the Father.", "freshTranslation": "Jesus said to her, 'Believe me, woman, the hour is coming when you will worship the Father neither on this mountain nor in Jerusalem.'", "historicalContext": "Jesus transcends the entire debate. Neither Gerizim nor Jerusalem will be the defining location for worship. This was a radical statement — the Jerusalem temple was considered the dwelling place of God's presence. Jesus announces its obsolescence, foreshadowing both the temple's destruction in 70 AD and the new covenant reality where God's Spirit dwells in believers.", "crossRefs": [{"ref": "Malachi 1:11", "explanation": "'From the rising of the sun to its setting, my name will be great among the nations' — worship beyond any single location."}, {"ref": "Acts 7:48-49", "explanation": "Stephen declares 'the Most High does not dwell in houses made by hands.'"}, {"ref": "1 Corinthians 3:16", "explanation": "'You are God's temple' — the new location of divine presence is the believer."}], "words": [{"english": "Woman", "original": "γύναι", "transliteration": "gynai", "pronunciation": "GOO-nigh", "strongs": "G1135", "partOfSpeech": "noun vocative singular feminine", "literalMeaning": "woman", "definition": "Γύναι is the vocative of γυνή. In Greek, this was a respectful form of address — not dismissive as 'woman' can sound in modern English. Jesus used the same address for His mother (John 2:4, 19:26). It conveys dignity and directness.", "translationNote": "Modern English ears hear 'woman' as rude or dismissive. In Greek it was equivalent to 'ma'am' or 'dear lady' — respectful and dignified.", "twisted": false, "twistedExplanation": null}, {"english": "believe me", "original": "πίστευέ μοι", "transliteration": "pisteue moi", "pronunciation": "PIS-tyoo-eh moy", "strongs": "G4100/G3427", "partOfSpeech": "verb present active imperative 2nd singular + pronoun dative 1st singular", "literalMeaning": "trust/believe + me", "definition": "Πιστεύω means to trust, believe, or have faith in. The present imperative calls for ongoing trust. This phrase is unique in John's Gospel — Jesus usually says 'truly, truly I say to you' (amen, amen). The personal 'believe me' is tender, almost intimate — He's asking for her personal trust, not just intellectual assent.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the hour cometh", "original": "ἔρχεται ὥρα", "transliteration": "erchetai hōra", "pronunciation": "ER-kheh-tie HO-rah", "strongs": "G2064/G5610", "partOfSpeech": "verb present middle indicative 3rd singular + noun nominative singular feminine", "literalMeaning": "comes/is coming + hour/appointed time", "definition": "Ὥρα in John's Gospel carries immense theological weight — it refers to the divinely appointed time of God's decisive action. 'The hour is coming' points forward to a new era of worship inaugurated by Jesus' death and resurrection. This is eschatological language — the old order is passing away.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the Father", "original": "τῷ πατρί", "transliteration": "tō patri", "pronunciation": "toe pah-TREE", "strongs": "G3962", "partOfSpeech": "noun dative singular masculine with article", "literalMeaning": "the father", "definition": "Jesus introduces God as 'the Father' — not 'God' abstractly, but πατήρ, a relational term. This reframes the entire worship discussion: it's not about which mountain pleases a distant deity, but about relationship with a Father who seeks His children. This relational language was revolutionary, especially for a Samaritan whose religion emphasized God's transcendence.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 22, "verseText": "Ye worship ye know not what: we know what we worship: for salvation is of the Jews.", "freshTranslation": "You Samaritans worship what you don't fully know; we Jews worship what we do know, because salvation comes through the Jewish people.", "historicalContext": "Jesus does not pretend both sides are equally right. The Samaritans, by accepting only the Pentateuch, rejected the Prophets and Writings that progressively revealed God's character and plan. While affirming a new era beyond Jerusalem, Jesus validates the Jewish revelation as the legitimate channel through which God's salvation enters the world.", "crossRefs": [{"ref": "Romans 3:1-2", "explanation": "Paul affirms that the Jews were 'entrusted with the oracles of God' — a real advantage."}, {"ref": "Romans 9:4-5", "explanation": "'To them belong the covenants, the law, the worship, the promises... and from them, according to the flesh, the Christ.'"}, {"ref": "Isaiah 2:3", "explanation": "'Out of Zion shall go forth the law, and the word of the LORD from Jerusalem.'"}], "words": [{"english": "Ye worship ye know not what", "original": "ὑμεῖς προσκυνεῖτε ὃ οὐκ οἴδατε", "transliteration": "hymeis proskyneite ho ouk oidate", "pronunciation": "hoo-MACE pros-koo-NAY-teh ho ook OY-dah-teh", "strongs": "G5210/G4352/G3739/G3756/G1492", "partOfSpeech": "pronoun nominative 2nd plural + verb present active indicative 2nd plural + relative pronoun + adverb negative + verb perfect active indicative 2nd plural", "literalMeaning": "you (emphatic) + worship + what + not + you know (intuitively)", "definition": "Οἴδατε (from οἶδα) means to know intuitively, to understand fully — a deep, complete knowledge. Jesus says the Samaritans worship without full understanding because they rejected the fuller revelation of the Prophets and Writings. Their worship was sincere but incomplete, directed at a God they only partially understood.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "we know what we worship", "original": "ἡμεῖς προσκυνοῦμεν ὃ οἴδαμεν", "transliteration": "hēmeis proskynoumen ho oidamen", "pronunciation": "hay-MACE pros-koo-NOO-men ho OY-dah-men", "strongs": "G2249/G4352/G3739/G1492", "partOfSpeech": "pronoun nominative 1st plural + verb present active indicative 1st plural + relative pronoun + verb perfect active indicative 1st plural", "literalMeaning": "we (emphatic) + worship + what + we know (intuitively)", "definition": "Jesus identifies Himself with the Jewish people — 'we worship.' This is remarkable: the Son of God aligns Himself with His human community's religious heritage. The emphatic ἡμεῖς ('we ourselves') draws a clear contrast with 'you.' Jewish worship was informed by the full Old Testament revelation.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "salvation is of the Jews", "original": "ἡ σωτηρία ἐκ τῶν Ἰουδαίων ἐστίν", "transliteration": "hē sōtēria ek tōn Ioudaiōn estin", "pronunciation": "hay so-tay-REE-ah ek tone ee-oo-DIE-own es-TIN", "strongs": "G4991/G1537/G2453/G2076", "partOfSpeech": "noun nominative singular feminine + preposition + noun genitive plural masculine with article + verb present indicative 3rd singular", "literalMeaning": "the salvation/deliverance + out of/from + the Jews + is", "definition": "Σωτηρία means deliverance, salvation, preservation — rescue from danger or destruction. Ἐκ (out of, from) indicates origin. This is one of the most theologically dense statements in John: God's salvation comes through the Jewish people. The Messiah is Jewish; the Scriptures are Jewish; the covenants are Jewish. Salvation's channel runs through Israel, even as its scope reaches all nations — including this Samaritan woman.", "translationNote": "'Of the Jews' means 'from/through the Jews' as its source or channel — not that salvation belongs exclusively to Jews or is only for Jews. The preposition ἐκ indicates origin, not ownership.", "twisted": true, "twistedExplanation": "This verse has been misused both to claim Jewish supremacy and, conversely, to fuel antisemitism ('the Jews had their chance and lost it'). The context shows Jesus affirming Jewish revelation as the channel of salvation while simultaneously breaking down ethnic barriers by offering it to a Samaritan. It means salvation comes through Israel's story, not that it's limited to Israel."}]}, {"verseNumber": 23, "verseText": "But the hour cometh, and now is, when the true worshippers shall worship the Father in spirit and in truth: for the Father seeketh such to worship him.", "freshTranslation": "But the hour is coming — and is already here — when true worshipers will worship the Father in spirit and truth. The Father is actively seeking such people to worship Him.", "historicalContext": "Jesus adds 'and now is' to His earlier 'the hour is coming' (v.21). The new era is not just future — it is breaking in now, in this very conversation, with this very woman. God the Father is actively searching for genuine worshipers regardless of ethnicity, location, or religious pedigree.", "crossRefs": [{"ref": "Philippians 3:3", "explanation": "'We are the circumcision, who worship by the Spirit of God' — Paul echoes Jesus' teaching on Spirit-led worship."}, {"ref": "Romans 12:1", "explanation": "'Present your bodies as a living sacrifice' — true worship engages the whole person, not just rituals."}, {"ref": "Psalm 51:16-17", "explanation": "'The sacrifices of God are a broken spirit; a broken and contrite heart, O God, you will not despise.'"}], "words": [{"english": "and now is", "original": "καὶ νῦν ἐστιν", "transliteration": "kai nyn estin", "pronunciation": "kai noon es-TIN", "strongs": "G2532/G3568/G2076", "partOfSpeech": "conjunction + adverb + verb present indicative 3rd singular", "literalMeaning": "and + now + is", "definition": "This addition — absent from verse 21 — collapses the future into the present. The new era of worship is not merely anticipated; it has already begun. In John's theology, the 'already but not yet' tension of the kingdom is concentrated in Jesus' person. Where He is, the future breaks into the present.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "the true worshippers", "original": "οἱ ἀληθινοὶ προσκυνηταί", "transliteration": "hoi alēthinoi proskynētai", "pronunciation": "hoy ah-lay-thee-NOY pros-koo-nay-TIE", "strongs": "G228/G4353", "partOfSpeech": "adjective nominative plural masculine with article + noun nominative plural masculine", "literalMeaning": "the genuine/real + worshipers", "definition": "Ἀληθινός means genuine, real, authentic — not counterfeit. It's stronger than ἀληθής (true/factual); ἀληθινός means 'the real deal.' Προσκυνητής (worshiper) appears only here in the NT. True worshipers are not defined by location, ritual correctness, or ethnic heritage, but by the spirit and truth of their engagement with God.", "translationNote": "English 'true' is weak for ἀληθινός. This means 'genuine, authentic, the real thing' — as opposed to mere external or formal worship. Think 'authentic' rather than just 'correct.'", "twisted": false, "twistedExplanation": null}, {"english": "in spirit and in truth", "original": "ἐν πνεύματι καὶ ἀληθείᾳ", "transliteration": "en pneumati kai alētheia", "pronunciation": "en PNYOO-mah-tee kai ah-lay-THAY-ah", "strongs": "G1722/G4151/G2532/G225", "partOfSpeech": "preposition + noun dative singular neuter + conjunction + noun dative singular feminine", "literalMeaning": "in + spirit/wind/breath + and + truth/unhiddenness", "definition": "Πνεῦμα means spirit, wind, or breath — likely referring both to the human spirit and the Holy Spirit. Ἀλήθεια means truth — reality as it truly is, without concealment. Together, 'in spirit and truth' defines authentic worship as internally engaged (not merely external ritual) and grounded in reality (not superstition or falsehood). This is worship from the deepest part of a person, enabled by God's Spirit, aligned with God's revealed truth.", "translationNote": "Whether πνεύματι refers to the Holy Spirit, the human spirit, or both is debated. The best reading is likely both — worship enabled by the Holy Spirit arising from the human spirit, not confined to temples, mountains, or rituals.", "twisted": true, "twistedExplanation": "This verse has been misused to dismiss all structured worship, liturgy, or gathered church practice as 'not in spirit and truth.' Jesus is not opposing form and structure but opposing worship that is merely external without genuine spiritual engagement. Spirit and truth worship can happen in a cathedral or a field."}, {"english": "the Father seeketh", "original": "ὁ πατὴρ ζητεῖ", "transliteration": "ho patēr zētei", "pronunciation": "ho pah-TARE zay-TAY", "strongs": "G3962/G2212", "partOfSpeech": "noun nominative singular masculine with article + verb present active indicative 3rd singular", "literalMeaning": "the father + seeks/searches for", "definition": "Ζητέω means to seek, search for, or desire earnestly. The present tense indicates continuous, active seeking. This is one of the most stunning revelations in the passage: God is not passively waiting to be found — He is actively seeking worshipers. The almighty Creator is the seeker; humans are the sought. This inverts every human religious instinct that sees worship as our initiative toward a distant God.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}]}