{"book": "John", "bookGreek": "Κατὰ Ἰωάννην", "chapter": 6, "author": "John (Ἰωάννης / Yohanan — 'God is gracious'), son of Zebedee, apostle. Wrote ~85-95 AD from Ephesus.", "audience": "Greek-speaking believers and seekers in Asia Minor.", "historicalContext": "John 6 takes place near Passover (v.4), the second Passover mentioned in this Gospel, placing the events roughly one year before the crucifixion. The setting shifts from the western shore of the Sea of Galilee (Sea of Tiberias) to Capernaum. The feeding of the 5,000 is the only miracle recorded in all four Gospels, underscoring its centrality. The crowd's attempt to make Jesus king by force (v.15) reflects Messianic expectations of a political deliverer who would overthrow Rome. The Bread of Life discourse in the Capernaum synagogue (v.59) is one of the most theologically dense passages in Scripture, deliberately echoing Exodus manna narratives and anticipating the Eucharist. The chapter ends with mass desertion and Peter's confession — a turning point in Jesus' Galilean ministry.", "verses": [{"verseNumber": 1, "verseText": "After these things Jesus went over the sea of Galilee, which is the sea of Tiberias.", "freshTranslation": "After these events, Jesus crossed to the other side of the Sea of Galilee — that is, the Sea of Tiberias.", "historicalContext": "The Sea of Galilee was also known as the Sea of Tiberias after the city Tiberias, built by Herod Antipas around 20 AD and named for Emperor Tiberius. John uses the Roman name for his Gentile audience. The phrase 'after these things' connects to the Jerusalem healing of chapter 5, implying a time gap.", "crossRefs": [{"ref": "Matthew 14:13", "explanation": "Parallel account of Jesus crossing the sea before the feeding miracle."}, {"ref": "Mark 6:1", "explanation": "Mark's parallel departure to a desolate place."}], "words": [{"english": "After", "original": "Μετὰ", "transliteration": "Meta", "pronunciation": "meh-TAH", "strongs": "G3326", "partOfSpeech": "preposition with accusative", "literalMeaning": "after, with, among", "definition": "A primary preposition indicating succession in time or accompaniment. With the accusative case (as here), it means 'after' in temporal sequence. One of the most common Greek prepositions, it survives in English compounds like 'metaphysics' (after physics) and 'metabolism.'", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "these things", "original": "ταῦτα", "transliteration": "tauta", "pronunciation": "TOW-tah", "strongs": "G5023", "partOfSpeech": "demonstrative pronoun, accusative neuter plural", "literalMeaning": "these things", "definition": "The neuter plural of the demonstrative pronoun οὗτος (houtos). It functions as a summary reference to the events and discourse of the preceding chapter. John frequently uses this phrase as a literary bridge between major narrative sections.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Jesus", "original": "Ἰησοῦς", "transliteration": "Iēsous", "pronunciation": "ee-ay-SOOS", "strongs": "G2424", "partOfSpeech": "proper noun, nominative masculine singular", "literalMeaning": "Yahweh saves", "definition": "The Greek form of the Hebrew name Yeshua (יֵשׁוּעַ), itself a contraction of Yehoshua (Joshua), meaning 'Yahweh is salvation.' This was a common Jewish name in the first century. The Septuagint uses Ἰησοῦς to translate Joshua. Every time this name is spoken, it declares God's saving purpose.", "translationNote": "The English 'Jesus' obscures the name's Hebrew meaning and its connection to Joshua, the one who led Israel into the Promised Land.", "twisted": false, "twistedExplanation": null}, {"english": "went over", "original": "ἀπῆλθεν", "transliteration": "apēlthen", "pronunciation": "ah-PEEL-then", "strongs": "G565", "partOfSpeech": "verb, aorist active indicative, 3rd person singular", "literalMeaning": "went away from", "definition": "Compound verb from ἀπό (away from) and ἔρχομαι (to come/go). The aorist tense presents the crossing as a simple completed action. It implies departure from one location with arrival at another, here combined with πέραν to indicate crossing to the far shore.", "translationNote": "KJV 'went over' captures the sense well, though the Greek emphasizes departure ('went away') rather than the crossing itself.", "twisted": false, "twistedExplanation": null}, {"english": "the sea", "original": "τῆς θαλάσσης", "transliteration": "tēs thalassēs", "pronunciation": "tays thah-LAHS-says", "strongs": "G2281", "partOfSpeech": "noun, genitive feminine singular with definite article", "literalMeaning": "the sea", "definition": "From a root meaning 'salt' or possibly related to ἅλς (halas, salt). In classical Greek, θάλασσα refers to the open sea as opposed to a lake. The Sea of Galilee is technically a freshwater lake (about 13 miles long, 8 miles wide), but Semitic languages use 'sea' (yam) for any large body of water. John adopts this Semitic convention.", "translationNote": "Calling this freshwater lake a 'sea' reflects Hebrew idiom. Luke, writing for Greeks, correctly calls it a 'lake' (λίμνη).", "twisted": false, "twistedExplanation": null}, {"english": "of Galilee", "original": "τῆς Γαλιλαίας", "transliteration": "tēs Galilaias", "pronunciation": "tays gah-lee-LIE-ahs", "strongs": "G1056", "partOfSpeech": "proper noun, genitive feminine singular", "literalMeaning": "the ring, the circuit", "definition": "From Hebrew galil (גָּלִיל), meaning 'circle' or 'district.' Isaiah 9:1 calls it 'Galilee of the nations' (galil ha-goyim) because of its mixed Jewish-Gentile population. By Jesus' time, Galilee was predominantly Jewish but still viewed with suspicion by Judean purists. It was the center of Jesus' public ministry.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "of Tiberias", "original": "τῆς Τιβεριάδος", "transliteration": "tēs Tiberiados", "pronunciation": "tays tee-beh-ree-AH-dohs", "strongs": "G5085", "partOfSpeech": "proper noun, genitive feminine singular", "literalMeaning": "named for Emperor Tiberius", "definition": "The city of Tiberias was founded around 20 AD by Herod Antipas on the western shore of the Sea of Galilee and named in honor of the reigning Roman Emperor Tiberius Caesar. Observant Jews initially avoided the city because it was built over a cemetery, rendering it ritually unclean. John adds this Roman-era name as a geographical gloss for readers unfamiliar with Palestinian geography.", "translationNote": "John's double naming (Galilee + Tiberias) serves Gentile readers who would know the Roman name but not the Jewish one.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 2, "verseText": "And a great multitude followed him, because they saw his miracles which he did on them that were diseased.", "freshTranslation": "A large crowd kept following him because they were witnessing the signs he was performing on the sick.", "historicalContext": "The imperfect tense ('kept following') suggests a sustained pattern, not a single event. These crowds were drawn by the healing miracles — signs of messianic power — but as the chapter reveals, most followed for the spectacle and the bread, not genuine faith.", "crossRefs": [{"ref": "John 2:23", "explanation": "Earlier reference to crowds believing because of signs, which Jesus did not trust."}, {"ref": "Matthew 14:14", "explanation": "Parallel noting Jesus' compassion on the multitude."}], "words": [{"english": "a great", "original": "πολύς", "transliteration": "polys", "pronunciation": "poh-LEES", "strongs": "G4183", "partOfSpeech": "adjective, nominative masculine singular", "literalMeaning": "many, much, great", "definition": "One of the most common Greek adjectives, indicating large quantity or degree. The root survives in English 'poly-' compounds (polygon, polyglot). Here it modifies ὄχλος to emphasize the enormous size of the crowd — later specified as 5,000 men plus women and children.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "multitude", "original": "ὄχλος", "transliteration": "ochlos", "pronunciation": "OKH-lohs", "strongs": "G3793", "partOfSpeech": "noun, nominative masculine singular", "literalMeaning": "crowd, throng, mob", "definition": "Refers to a large, often disorganized gathering of common people, as distinct from λαός (laos, a people as a political or ethnic group) or δῆμος (dēmos, the citizenry). In the Gospels, ὄχλος frequently carries a note of fickleness — the crowd that cheers today may turn hostile tomorrow. The English word 'ochlocracy' (mob rule) derives from this root.", "translationNote": "KJV's 'multitude' sounds more dignified than the Greek implies. 'Crowd' better captures the chaotic, fickle nature of the group.", "twisted": false, "twistedExplanation": null}, {"english": "followed", "original": "ἠκολούθει", "transliteration": "ēkolouthei", "pronunciation": "ay-koh-LOO-they", "strongs": "G190", "partOfSpeech": "verb, imperfect active indicative, 3rd person singular", "literalMeaning": "was following, kept following", "definition": "From ἀκόλουθος (akolouthos, 'following, attendant'), which derives from α- (copulative prefix) + κέλευθος (keleuthos, 'road, way'). The imperfect tense is significant — it describes continuous, ongoing action: 'kept on following.' This same verb is used for discipleship, but the crowd's following is motivated by spectacle, not commitment.", "translationNote": "The KJV simple past 'followed' loses the imperfect aspect — they didn't just follow once but kept following persistently.", "twisted": false, "twistedExplanation": null}, {"english": "miracles", "original": "σημεῖα", "transliteration": "sēmeia", "pronunciation": "say-MAY-ah", "strongs": "G4592", "partOfSpeech": "noun, accusative neuter plural", "literalMeaning": "signs, marks, tokens", "definition": "From σῆμα (sēma, 'a mark or sign'). John never uses the word δύναμις (dynamis, 'miracle/power') that the Synoptics prefer. He always calls Jesus' miracles σημεῖα — signs — because they point beyond themselves to a deeper reality about who Jesus is. A sign is not the destination; it's the signpost. The English word 'semiotics' (study of signs) comes from this root.", "translationNote": "KJV's 'miracles' misses John's deliberate theological vocabulary. John chose 'signs' (σημεῖα) because the miracles are pointers to Jesus' identity, not just displays of power.", "twisted": true, "twistedExplanation": "Translating σημεῖα as 'miracles' shifts focus from meaning to marvel. John's entire theology depends on the reader understanding these acts as signs pointing to who Jesus is. The crowd saw miracles; Jesus wanted them to see signs."}, {"english": "diseased", "original": "ἀσθενούντων", "transliteration": "asthenountōn", "pronunciation": "ahs-theh-NOON-tone", "strongs": "G770", "partOfSpeech": "verb (participle), present active, genitive masculine plural", "literalMeaning": "being weak, being without strength", "definition": "From ἀ- (alpha privative, 'without') + σθένος (sthenos, 'strength'). Literally 'those without strength.' It covers a broad range from general weakness to serious illness. The present participle indicates an ongoing state of sickness. The English medical term 'asthenia' (weakness) derives directly from this word.", "translationNote": "KJV's 'diseased' is adequate but slightly narrow; the Greek covers any kind of physical weakness or infirmity.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 3, "verseText": "And Jesus went up into a mountain, and there he sat with his disciples.", "freshTranslation": "Jesus went up on the hillside and sat down there with his disciples.", "historicalContext": "The mountain/hillside east of the Sea of Galilee rises steeply from the shore. Sitting was the customary posture for a Jewish teacher — when a rabbi sat down, it signaled he was about to teach with authority. The scene deliberately parallels Moses on Sinai, especially with Passover approaching (v.4).", "crossRefs": [{"ref": "Matthew 5:1", "explanation": "Jesus also goes up a mountain and sits to teach in the Sermon on the Mount — Moses typology."}, {"ref": "Exodus 19:3", "explanation": "Moses went up to God on the mountain — Jesus as the new Moses."}], "words": [{"english": "went up", "original": "ἀνῆλθεν", "transliteration": "anēlthen", "pronunciation": "ah-NEEL-then", "strongs": "G424", "partOfSpeech": "verb, aorist active indicative, 3rd person singular", "literalMeaning": "went up, ascended", "definition": "Compound of ἀνά (ana, 'up') and ἔρχομαι (erchomai, 'to come/go'). The aorist presents this as a simple completed action. In Jewish thought, going 'up' to a mountain carried prophetic overtones — Moses ascended Sinai, Elijah went up to Carmel. John may be subtly evoking these precedents.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "a mountain", "original": "τὸ ὄρος", "transliteration": "to oros", "pronunciation": "toh OH-rohs", "strongs": "G3735", "partOfSpeech": "noun, accusative neuter singular with definite article", "literalMeaning": "the mountain, the hill", "definition": "A general term for any elevated terrain, from a small hill to a great mountain. The definite article ('the mountain') may suggest a well-known local landmark. In the Gospels, mountains are places of revelation, prayer, and divine encounter, continuing the OT pattern (Sinai, Moriah, Carmel, Zion). The English 'orography' (study of mountains) derives from this root.", "translationNote": "The definite article 'the mountain' suggests a specific, known location, not just any mountain. KJV's 'a mountain' loses this specificity.", "twisted": false, "twistedExplanation": null}, {"english": "sat", "original": "ἐκάθητο", "transliteration": "ekathēto", "pronunciation": "eh-KAH-thay-toh", "strongs": "G2521", "partOfSpeech": "verb, imperfect middle/passive indicative, 3rd person singular", "literalMeaning": "was sitting, sat down", "definition": "From κάθημαι (kathēmai, 'to sit'). Compound of κατά (kata, 'down') + ἧμαι (hēmai, 'to sit'). The imperfect tense indicates a settled, continuing posture — he sat and remained sitting. In Jewish culture, the teacher sat while students stood or sat around him. A rabbi's seated posture was his 'chair' of authority. The English 'cathedral' (where the bishop's chair is) derives from this root.", "translationNote": "Accurate. The sitting posture signals teaching authority.", "twisted": false, "twistedExplanation": null}, {"english": "disciples", "original": "μαθητῶν", "transliteration": "mathētōn", "pronunciation": "mah-thay-TONE", "strongs": "G3101", "partOfSpeech": "noun, genitive masculine plural", "literalMeaning": "learners, pupils", "definition": "From μανθάνω (manthanō, 'to learn'). A μαθητής is fundamentally a learner or apprentice, not merely a follower. In first-century Judaism, a disciple attached himself to a rabbi, living with him, learning his interpretations of Torah, and imitating his way of life. The relationship was far more intensive than modern student-teacher dynamics. The English word 'mathematics' shares this root — originally 'the things learned.'", "translationNote": "Accurate, though 'disciple' in modern usage often loses the intensity of the ancient master-apprentice relationship.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 4, "verseText": "And the passover, a feast of the Jews, was nigh.", "freshTranslation": "Now the Passover, the Jewish festival, was near.", "historicalContext": "This is the second of three Passovers mentioned in John's Gospel (2:13, 6:4, 11:55), establishing a roughly three-year ministry. John's mention of Passover is not incidental — it provides the theological lens for the entire chapter. The feeding miracle echoes the manna God provided during the Exodus, and Jesus' 'Bread of Life' discourse explicitly connects to Passover themes of deliverance and divine provision.", "crossRefs": [{"ref": "Exodus 12:1-14", "explanation": "Institution of the first Passover — the foundational event Jesus' discourse reinterprets."}, {"ref": "John 2:13", "explanation": "The first Passover in John's Gospel, when Jesus cleansed the temple."}, {"ref": "John 11:55", "explanation": "The third and final Passover, leading to the crucifixion."}], "words": [{"english": "the passover", "original": "τὸ πάσχα", "transliteration": "to pascha", "pronunciation": "toh PAHS-khah", "strongs": "G3957", "partOfSpeech": "noun, nominative neuter singular (indeclinable) with definite article", "literalMeaning": "passing over", "definition": "From Hebrew pesach (פֶּסַח), meaning 'to pass over, to skip.' It commemorates God's angel passing over Israelite homes marked with lamb's blood during the tenth plague in Egypt (Exodus 12). By Jesus' time, Passover was one of three pilgrimage festivals requiring Jewish males to travel to Jerusalem. The lamb was slaughtered on Nisan 14 and eaten that evening. John's placement of this note frames the entire chapter as a Passover theology — Jesus is both the bread from heaven and the Passover lamb.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "feast", "original": "ἑορτή", "transliteration": "heortē", "pronunciation": "heh-or-TAY", "strongs": "G1859", "partOfSpeech": "noun, nominative feminine singular", "literalMeaning": "festival, feast day", "definition": "A festival or holy day set apart for religious observance and celebration. In the LXX, it translates Hebrew ḥag (חַג), the appointed feasts of Israel. The word carries connotations of joy, communal gathering, and sacred time. Ancient Greek feasts (ἑορταί) involved both religious ritual and communal meals.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "of the Jews", "original": "τῶν Ἰουδαίων", "transliteration": "tōn Ioudaiōn", "pronunciation": "tone ee-oo-DIE-own", "strongs": "G2453", "partOfSpeech": "noun, genitive masculine plural with definite article", "literalMeaning": "of the Judeans / of the Jewish people", "definition": "From Ἰούδας (Ioudas, 'Judah'). This term in John is complex and debated. It can mean (1) the Jewish people generally, (2) the Judean leadership specifically, or (3) those hostile to Jesus. John uses the phrase 'feast of the Jews' as an explanatory note for Gentile readers who wouldn't know Jewish customs. It is a geographical-cultural description, not a pejorative.", "translationNote": "The phrase 'of the Jews' is John explaining customs to non-Jewish readers. Some modern readers hear anti-Semitism, but John himself was Jewish, as was Jesus and every disciple.", "twisted": false, "twistedExplanation": null}, {"english": "was nigh", "original": "ἐγγύς", "transliteration": "engys", "pronunciation": "eng-GOOS", "strongs": "G1451", "partOfSpeech": "adverb", "literalMeaning": "near, close", "definition": "An adverb of proximity indicating nearness in space or time. Here it denotes temporal nearness — Passover was approaching. The word creates literary urgency and theological framing: everything that follows should be read through the lens of Passover. It appears frequently in eschatological contexts as well ('the kingdom of God is near').", "translationNote": "KJV's 'nigh' is archaic; 'near' or 'approaching' is clearer for modern readers.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 5, "verseText": "When Jesus then lifted up his eyes, and saw a great company come unto him, he saith unto Philip, Whence shall we buy bread, that these may eat?", "freshTranslation": "When Jesus looked up and saw a huge crowd coming toward him, he said to Philip, 'Where can we buy bread for these people to eat?'", "historicalContext": "Jesus addresses Philip specifically, likely because Philip was from nearby Bethsaida (John 1:44, 12:21) and would know the local area. The question about buying bread echoes Moses' complaint in Numbers 11:13 ('Where am I to get meat to give to all these people?'). Jesus is testing Philip, setting up the revelation that he himself is the provision.", "crossRefs": [{"ref": "Numbers 11:13", "explanation": "Moses' parallel question about feeding the multitude in the wilderness."}, {"ref": "John 1:44", "explanation": "Philip's hometown of Bethsaida, near this location."}, {"ref": "2 Kings 4:42-44", "explanation": "Elisha feeding 100 men with 20 loaves — a smaller-scale precedent."}], "words": [{"english": "lifted up", "original": "ἐπάρας", "transliteration": "eparas", "pronunciation": "eh-PAH-rahs", "strongs": "G1869", "partOfSpeech": "verb, aorist active participle, nominative masculine singular", "literalMeaning": "having lifted up", "definition": "Compound of ἐπί (epi, 'upon') and αἴρω (airō, 'to lift, raise'). The aorist participle indicates an action completed before the main verb — he lifted his eyes, then saw. 'Lifting the eyes' is a Semitic idiom for deliberate, focused looking. It implies intentionality — Jesus wasn't casually glancing; he surveyed the crowd with purpose.", "translationNote": "Accurate. The Semitic idiom 'lifted up his eyes' means he looked deliberately.", "twisted": false, "twistedExplanation": null}, {"english": "eyes", "original": "ὀφθαλμούς", "transliteration": "ophthalmous", "pronunciation": "off-thahl-MOOS", "strongs": "G3788", "partOfSpeech": "noun, accusative masculine plural", "literalMeaning": "eyes", "definition": "The physical organ of sight. From a root related to ὄψ (ops, 'face, eye'). In Scripture, the eyes are not just sensory organs but windows of perception, understanding, and spiritual awareness. The English 'ophthalmology' derives directly from this word. In John's Gospel, seeing and believing are deeply intertwined themes.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "a great company", "original": "πολὺς ὄχλος", "transliteration": "polys ochlos", "pronunciation": "poh-LEES OKH-lohs", "strongs": "G4183/G3793", "partOfSpeech": "adjective + noun, nominative masculine singular", "literalMeaning": "a large crowd", "definition": "See notes on πολύς (v.2) and ὄχλος (v.2). The repetition emphasizes the sheer scale of the crowd that has gathered. Matthew 14:21 later clarifies this was 5,000 men 'besides women and children,' making the total possibly 15,000-20,000 people.", "translationNote": "KJV's 'great company' is accurate but somewhat formal.", "twisted": false, "twistedExplanation": null}, {"english": "Philip", "original": "Φίλιππον", "transliteration": "Philippon", "pronunciation": "FIH-lip-pon", "strongs": "G5376", "partOfSpeech": "proper noun, accusative masculine singular", "literalMeaning": "lover of horses", "definition": "From φίλος (philos, 'beloved, friend') + ἵππος (hippos, 'horse'). A Greek name common among Hellenized Jews. Philip was from Bethsaida (John 1:44), the nearest town to the site of the miracle, which explains why Jesus directed this question specifically to him. Philip is characterized in John as practical and somewhat literal-minded (cf. John 14:8-9).", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Whence", "original": "Πόθεν", "transliteration": "Pothen", "pronunciation": "POH-then", "strongs": "G4159", "partOfSpeech": "interrogative adverb", "literalMeaning": "from where?", "definition": "An interrogative adverb asking about the source or origin of something. In John's Gospel, 'whence' (πόθεν) is a theologically loaded word — it asks about origins. The crowd will later ask 'whence' Jesus' bread comes from, and Jesus will answer that it comes from heaven. The question of origin is central to Johannine Christology.", "translationNote": "KJV's 'whence' is archaic. 'Where' captures the sense for modern readers.", "twisted": false, "twistedExplanation": null}, {"english": "buy", "original": "ἀγοράσωμεν", "transliteration": "agorasōmen", "pronunciation": "ah-goh-RAH-so-men", "strongs": "G59", "partOfSpeech": "verb, aorist active subjunctive, 1st person plural", "literalMeaning": "we might buy, we should purchase", "definition": "From ἀγορά (agora, 'marketplace'). To purchase goods in the marketplace. The subjunctive mood ('should we buy?') makes this a deliberative question — Jesus is inviting Philip to consider the logistics. The agora was the commercial and social heart of every Greek and Roman city. The word's marketplace origin grounds the miracle in real economic impossibility.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "bread", "original": "ἄρτους", "transliteration": "artous", "pronunciation": "AHR-toos", "strongs": "G740", "partOfSpeech": "noun, accusative masculine plural", "literalMeaning": "loaves of bread", "definition": "The primary staple food of the ancient Mediterranean world, typically flat barley or wheat loaves. Bread was so central to survival that it often stands for food in general, and metaphorically for sustenance and life itself. This word becomes the chapter's dominant metaphor: Jesus will declare himself the 'bread of life' (ἄρτος τῆς ζωῆς). In the LXX, it translates Hebrew lechem (לֶחֶם), as in Beth-lechem ('house of bread').", "translationNote": "Accurate. The plural 'loaves' is more precise than the generic 'bread.'", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 6, "verseText": "And this he said to prove him: for he himself knew what he would do.", "freshTranslation": "He said this to test him, because he already knew what he was going to do.", "historicalContext": "John gives the reader an inside look at Jesus' intent — this is a test of faith, not a request for logistical help. The narrator's omniscient perspective is characteristic of John's Gospel. Jesus' foreknowledge is a recurring Johannine theme, emphasizing his divine nature.", "crossRefs": [{"ref": "Genesis 22:1", "explanation": "God 'tested' Abraham with Isaac — same pattern of testing faith through impossible demands."}, {"ref": "John 2:24-25", "explanation": "Jesus knew what was in people — his omniscience is consistently affirmed in John."}], "words": [{"english": "to prove", "original": "πειράζων", "transliteration": "peirazōn", "pronunciation": "pay-RAH-zone", "strongs": "G3985", "partOfSpeech": "verb, present active participle, nominative masculine singular", "literalMeaning": "testing, trying, proving", "definition": "From πεῖρα (peira, 'trial, experience'). This verb has two distinct uses: (1) testing to prove or strengthen (as God tests faith), and (2) tempting to cause failure (as Satan tempts). Here the context is clearly the first — Jesus tests Philip to reveal Philip's faith level and to set up the miracle. The same word is used for Satan's temptation of Jesus in the wilderness (Matthew 4:1).", "translationNote": "KJV's 'prove' is an older meaning of 'test.' Modern readers may hear 'demonstrate' rather than 'test,' which misses the point.", "twisted": false, "twistedExplanation": null}, {"english": "knew", "original": "ᾔδει", "transliteration": "ēdei", "pronunciation": "AY-day", "strongs": "G1492", "partOfSpeech": "verb, pluperfect active indicative, 3rd person singular", "literalMeaning": "he had known, he knew intuitively", "definition": "From οἶδα (oida), a perfect tense with present meaning, indicating intuitive or inherent knowledge (as opposed to γινώσκω, which implies learned or experiential knowledge). The pluperfect 'he had known' indicates Jesus' foreknowledge was settled before the event. This is not hindsight but divine prescience. John consistently uses this verb to portray Jesus as having immediate, complete knowledge — the knowledge of God.", "translationNote": "The distinction between οἶδα (inherent knowledge) and γινώσκω (acquired knowledge) is untranslatable in English but theologically significant — Jesus didn't figure out a plan; he always knew.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 7, "verseText": "Philip answered him, Two hundred pennyworth of bread is not sufficient for them, that every one of them may take a little.", "freshTranslation": "Philip answered him, 'Two hundred denarii worth of bread wouldn't be enough for each of them to get even a small piece.'", "historicalContext": "Two hundred denarii was roughly eight months' wages for a common laborer (a denarius being a day's wage). Philip's answer reveals a purely economic, human-calculation approach to the problem. He sees scarcity where Jesus is about to reveal abundance. This response pattern — measuring divine possibility by human resources — is a recurring theme in Scripture.", "crossRefs": [{"ref": "Mark 6:37", "explanation": "Parallel account with the same 200-denarii figure."}, {"ref": "Numbers 11:21-22", "explanation": "Moses similarly calculates the impossibility of feeding Israel in the wilderness."}], "words": [{"english": "Two hundred", "original": "Διακοσίων", "transliteration": "Diakosiōn", "pronunciation": "dee-ah-koh-SEE-own", "strongs": "G1250", "partOfSpeech": "adjective (numeral), genitive neuter plural", "literalMeaning": "two hundred", "definition": "From δίς (dis, 'twice') + ἑκατόν (hekaton, 'hundred'). A substantial sum representing about eight months of labor wages. Philip's precise calculation suggests he had already been thinking about the problem practically. The specific number also appears in Mark's account, confirming an early, fixed tradition.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "pennyworth", "original": "δηναρίων", "transliteration": "dēnariōn", "pronunciation": "day-nah-REE-own", "strongs": "G1220", "partOfSpeech": "noun, genitive neuter plural", "literalMeaning": "denarii (Roman silver coins)", "definition": "A Roman silver coin weighing about 3.9 grams, the standard day's wage for a laborer (cf. Matthew 20:2). The name derives from Latin denarius ('containing ten'), as it was originally worth ten asses. By Jesus' time, the denarius bore the image of the emperor — the very coin Jesus referenced in 'Render unto Caesar.' Two hundred denarii would be a small fortune for a working-class person.", "translationNote": "KJV's 'pennyworth' is badly misleading — a denarius was a full day's wage, not a penny. Modern translations correctly use 'denarii' or give the wage equivalent.", "twisted": true, "twistedExplanation": "Translating δηνάριον as 'penny' drastically understates the amount. 200 denarii = roughly 8 months' wages. 200 pennies sounds trivial; 200 day-wages sounds impossible. The whole point is that even a fortune couldn't feed this crowd."}, {"english": "sufficient", "original": "ἀρκοῦσιν", "transliteration": "arkousin", "pronunciation": "ahr-KOO-sin", "strongs": "G714", "partOfSpeech": "verb, present active indicative, 3rd person plural", "literalMeaning": "they are sufficient, they are enough", "definition": "From ἀρκέω (arkeō, 'to be enough, to suffice, to ward off'). The root idea is 'to keep off' danger or want — hence, to have enough to keep want at bay. Paul uses this word in 2 Corinthians 12:9 when God says 'My grace is sufficient (ἀρκεῖ) for you.' Philip says human resources are not sufficient; Jesus will show divine grace is.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 8, "verseText": "One of his disciples, Andrew, Simon Peter's brother, saith unto him,", "freshTranslation": "One of his disciples — Andrew, Simon Peter's brother — said to him,", "historicalContext": "Andrew is consistently portrayed in John as the one who brings people to Jesus (he brought Peter in John 1:41-42, he brings the Greeks in John 12:22). Here he brings a boy with food. He is always identified in relation to Peter, suggesting Peter was the more well-known brother in the early church.", "crossRefs": [{"ref": "John 1:40-42", "explanation": "Andrew's first appearance — he found his brother Simon and brought him to Jesus."}, {"ref": "John 12:22", "explanation": "Andrew again brings people to Jesus — a consistent character trait."}], "words": [{"english": "Andrew", "original": "Ἀνδρέας", "transliteration": "Andreas", "pronunciation": "ahn-DREH-ahs", "strongs": "G406", "partOfSpeech": "proper noun, nominative masculine singular", "literalMeaning": "manly, brave", "definition": "From ἀνήρ (anēr, 'man'). A Greek name, suggesting Andrew's family was Hellenized — fitting for fishermen from Bethsaida, a town with significant Greek influence. Andrew was originally a disciple of John the Baptist before following Jesus (John 1:35-40). In John's Gospel, Andrew is characterized as a practical connector — he brings people and resources to Jesus, even when the resources seem inadequate.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "Simon Peter's", "original": "Σίμωνος Πέτρου", "transliteration": "Simōnos Petrou", "pronunciation": "SEE-mo-nos PEH-troo", "strongs": "G4613/G4074", "partOfSpeech": "proper nouns, genitive masculine singular", "literalMeaning": "Simon = 'hearing/listening'; Peter = 'rock/stone'", "definition": "Simon is from Hebrew Shim'on (שִׁמְעוֹן), meaning 'he has heard,' one of the twelve tribes of Israel. Peter (Πέτρος) is the Greek translation of Aramaic Kēpha (כֵּיפָא), meaning 'rock,' the name Jesus gave Simon (John 1:42). That Andrew is identified as Simon Peter's brother shows Peter's prominence was already well-established when John wrote.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 9, "verseText": "There is a lad here, which hath five barley loaves, and two small fishes: but what are they among so many?", "freshTranslation": "There's a boy here who has five barley loaves and two small fish — but what good is that for so many people?", "historicalContext": "Barley bread was the food of the poor — wheat bread cost twice as much. The boy likely carried a peasant's lunch. The two fish were probably small dried or pickled fish (ὀψάρια), eaten as a relish with bread. Andrew's skeptical question mirrors the human perspective throughout Scripture when confronted with divine abundance. The five loaves and two fish may echo 2 Kings 4:42-44, where Elisha multiplied twenty barley loaves.", "crossRefs": [{"ref": "2 Kings 4:42-44", "explanation": "Elisha's multiplication of barley loaves — Jesus performs the same miracle on a vastly greater scale."}, {"ref": "Judges 7:2-7", "explanation": "God deliberately reduces Gideon's army to show that victory comes from God, not human resources."}], "words": [{"english": "a lad", "original": "παιδάριον", "transliteration": "paidarion", "pronunciation": "pie-DAH-ree-on", "strongs": "G3808", "partOfSpeech": "noun, nominative neuter singular", "literalMeaning": "a little boy, a young child", "definition": "Diminutive of παῖς (pais, 'child, boy, servant'). The diminutive form emphasizes the youth and smallness of the boy — this is a child, not an adult. Only John mentions this boy; the Synoptics simply note the five loaves and two fish. The detail highlights the absurd disproportion between the resources and the need, making the miracle more vivid. The word appears in the LXX for the boy carrying Goliath's weapons (1 Samuel 17:41).", "translationNote": "KJV's 'lad' is decent but dated. 'Boy' captures it naturally.", "twisted": false, "twistedExplanation": null}, {"english": "barley", "original": "κρίθινους", "transliteration": "krithinous", "pronunciation": "KREE-thee-noos", "strongs": "G2916", "partOfSpeech": "adjective, accusative masculine plural", "literalMeaning": "made of barley", "definition": "From κριθή (krithē, 'barley'). Barley was the poor person's grain — cheaper, coarser, and less desirable than wheat. Barley bread cost about half the price of wheat bread. This detail signals the socioeconomic level of the crowd and the boy. Significantly, Elisha's miracle in 2 Kings 4:42 also involved barley loaves, strengthening the new-Elisha/new-Moses typology.", "translationNote": "Accurate. The detail of barley (not wheat) matters — it marks this as a poor person's meal.", "twisted": false, "twistedExplanation": null}, {"english": "loaves", "original": "ἄρτους", "transliteration": "artous", "pronunciation": "AHR-toos", "strongs": "G740", "partOfSpeech": "noun, accusative masculine plural", "literalMeaning": "loaves, bread cakes", "definition": "See note on verse 5. Here the loaves are specifically barley loaves — small, flat cakes, not the large loaves modern readers might imagine. A single person might eat two or three for a meal. Five would be a modest personal supply for a boy, making the multiplication all the more dramatic.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "small fishes", "original": "ὀψάρια", "transliteration": "opsaria", "pronunciation": "op-SAH-ree-ah", "strongs": "G3795", "partOfSpeech": "noun, accusative neuter plural", "literalMeaning": "small fish, relish", "definition": "Diminutive of ὄψον (opson, 'cooked food eaten with bread, relish'). Originally any food eaten alongside bread as a relish, it came to mean specifically small fish — salted, dried, or pickled — which were the most common accompaniment to bread around the Sea of Galilee. These were likely tilapia or sardines, preserved for travel. John is the only Gospel writer to use this specific word; the Synoptics use ἰχθύς (ichthys, the general word for fish).", "translationNote": "KJV's 'small fishes' captures the diminutive well. The word implies preserved fish eaten as a side dish, not fresh catch.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 10, "verseText": "And Jesus said, Make the men sit down. Now there was much grass in the place. So the men sat down, in number about five thousand.", "freshTranslation": "Jesus said, 'Have the people sit down.' There was plenty of grass in that spot, so the men sat down — about five thousand of them.", "historicalContext": "The 'much grass' is a spring detail consistent with Passover season (March-April), when Galilean hillsides are green. By summer, the grass would be brown. The organized seating (Mark adds 'in groups of hundreds and fifties') echoes Moses organizing Israel in the wilderness (Exodus 18:21). The count of 5,000 men (ἄνδρες, males specifically) means the total crowd was far larger.", "crossRefs": [{"ref": "Mark 6:39-40", "explanation": "Mark adds that they sat in groups of hundreds and fifties — military/wilderness organization."}, {"ref": "Exodus 18:21", "explanation": "Moses organized Israel in groups of thousands, hundreds, fifties, and tens."}, {"ref": "Psalm 23:2", "explanation": "'He makes me lie down in green pastures' — the Good Shepherd provides."}], "words": [{"english": "sit down", "original": "ἀναπεσεῖν", "transliteration": "anapesein", "pronunciation": "ah-nah-peh-SAYN", "strongs": "G377", "partOfSpeech": "verb, aorist active infinitive", "literalMeaning": "to recline, to lie back", "definition": "From ἀνά (ana, 'back') + πίπτω (piptō, 'to fall'). Literally 'to fall back,' meaning to recline. In the ancient world, formal meals were eaten in a reclining position. Jesus commanding the crowd to recline signals that this is not just snacking — it's a formal meal, a banquet in the wilderness. The Good Shepherd makes his flock lie down (Psalm 23:2) and then feeds them.", "translationNote": "KJV's 'sit down' misses the image of reclining at a banquet. Jesus is hosting a wilderness feast, not a picnic.", "twisted": false, "twistedExplanation": null}, {"english": "grass", "original": "χόρτος", "transliteration": "chortos", "pronunciation": "KHOR-tohs", "strongs": "G5528", "partOfSpeech": "noun, nominative masculine singular", "literalMeaning": "grass, herbage, fodder", "definition": "Any green herbage or grass growing in a field. The detail 'much grass' pinpoints the season — near Passover in spring, when Galilean hillsides are lush and green. By late summer, the same hills would be dry and brown. This seemingly trivial detail is a hallmark of eyewitness memory. The word also carries pastoral/shepherd imagery (Psalm 23).", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "men", "original": "ἄνδρες", "transliteration": "andres", "pronunciation": "AHN-dres", "strongs": "G435", "partOfSpeech": "noun, nominative masculine plural", "literalMeaning": "men, males (adult)", "definition": "Specifically adult males, as distinct from ἄνθρωπος (anthrōpos, 'human being' regardless of gender). John uses ἄνδρες here to indicate the count of 5,000 was males only. Matthew 14:21 makes this explicit: 'about five thousand men, besides women and children.' The actual crowd was likely 15,000-20,000, making the miracle far more staggering than 'five thousand' alone suggests.", "translationNote": "The English 'men' can mean either 'males' or 'people.' Here it specifically means males — the total crowd was much larger.", "twisted": false, "twistedExplanation": null}, {"english": "five thousand", "original": "πεντακισχίλιοι", "transliteration": "pentakischilioi", "pronunciation": "pen-tah-kis-KHEE-lee-oy", "strongs": "G4000", "partOfSpeech": "adjective (numeral), nominative masculine plural", "literalMeaning": "five thousand", "definition": "Compound of πέντε (pente, 'five') + χίλιοι (chilioi, 'thousand'). This is the largest crowd Jesus feeds in any Gospel account. Five thousand men alone would constitute a small army — Rome's famous legions numbered about 5,000 soldiers. The crowd's later attempt to make Jesus king 'by force' (v.15) makes more sense when you realize this was a force large enough to stage a revolt.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 11, "verseText": "And Jesus took the loaves; and when he had given thanks, he distributed to the disciples, and the disciples to them that were set down; and likewise of the fishes as much as they would.", "freshTranslation": "Then Jesus took the loaves, gave thanks, and distributed them to those who were seated. He did the same with the fish — as much as they wanted.", "historicalContext": "The sequence — took, gave thanks, distributed — mirrors the Jewish meal blessing (berakah) and anticipates the Last Supper eucharistic pattern (Luke 22:19). 'Giving thanks' (εὐχαριστέω) is the very word from which 'Eucharist' derives. Jesus functions as both host and provision. The phrase 'as much as they wanted' emphasizes not mere sufficiency but lavish abundance.", "crossRefs": [{"ref": "Luke 22:19", "explanation": "The Last Supper uses identical language: took bread, gave thanks, broke it, distributed."}, {"ref": "1 Corinthians 11:24", "explanation": "Paul's eucharistic tradition echoes this same pattern."}, {"ref": "Matthew 14:19", "explanation": "Synoptic parallel — Jesus looked up to heaven, blessed, broke, and gave."}], "words": [{"english": "took", "original": "ἔλαβεν", "transliteration": "elaben", "pronunciation": "EH-lah-ben", "strongs": "G2983", "partOfSpeech": "verb, aorist active indicative, 3rd person singular", "literalMeaning": "took, received, grasped", "definition": "From λαμβάνω (lambanō, 'to take, to receive'). One of the most common verbs in Greek. The aorist presents the action as a decisive moment. In the eucharistic pattern, 'taking' the bread is the first act — claiming the offering before blessing it. Jesus takes what is offered (however small) before transforming it.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "given thanks", "original": "εὐχαριστήσας", "transliteration": "eucharistēsas", "pronunciation": "yoo-khah-ris-TAY-sahs", "strongs": "G2168", "partOfSpeech": "verb, aorist active participle, nominative masculine singular", "literalMeaning": "having given thanks, having expressed gratitude", "definition": "From εὖ (eu, 'well, good') + χάρις (charis, 'grace, favor'). To express gratitude, especially to God in prayer. This is the word from which 'Eucharist' directly derives. In Jewish practice, the head of household blessed God before meals: 'Blessed are you, Lord our God, King of the universe, who brings forth bread from the earth.' Jesus follows this custom here. The fact that John uses εὐχαριστέω rather than εὐλογέω (to bless) may reflect early Christian liturgical language.", "translationNote": "Accurate. The Eucharistic overtone is unmistakable — early Christians would have heard this as anticipating the Lord's Supper.", "twisted": false, "twistedExplanation": null}, {"english": "distributed", "original": "διέδωκεν", "transliteration": "diedōken", "pronunciation": "dee-EH-doe-ken", "strongs": "G1239", "partOfSpeech": "verb, aorist active indicative, 3rd person singular", "literalMeaning": "distributed, gave through", "definition": "From διά (dia, 'through') + δίδωμι (didōmi, 'to give'). To distribute, to give out among many. The prefix διά suggests thoroughness — the bread went through the entire crowd. Some manuscripts add 'to the disciples' as intermediaries, but the critical text has Jesus distributing directly. Either way, the supply never ran out as it passed through thousands of hands.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "as much as they would", "original": "ὅσον ἤθελον", "transliteration": "hoson ēthelon", "pronunciation": "HOH-son AY-theh-lon", "strongs": "G3745/G2309", "partOfSpeech": "correlative pronoun + verb, imperfect active indicative, 3rd person plural", "literalMeaning": "as much as they were wanting", "definition": "ὅσον (hoson) means 'as much as, to the degree that.' ἤθελον (ēthelon) from θέλω (thelō, 'to will, to want, to desire'). The imperfect tense 'were wanting' indicates ongoing, continuous desire being met — they kept wanting and kept receiving. This is not rationed scarcity but overflowing abundance. God's provision exceeds human appetite.", "translationNote": "Accurate. The imperfect tense emphasizes that the supply continuously met ongoing demand — not a one-time portion but unlimited refills.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 12, "verseText": "When they were filled, he said unto his disciples, Gather up the fragments that remain, that nothing be lost.", "freshTranslation": "When everyone had eaten their fill, he told his disciples, 'Gather up the leftover pieces so that nothing is wasted.'", "historicalContext": "The command to gather leftovers demonstrates both the reality of the miracle (there was more than enough) and a Jewish value against wastefulness (bal tashchit — 'do not destroy'). The word 'lost' (ἀπόληται) is the same verb used for spiritual loss/perishing throughout John (3:16, 10:28, 17:12), hinting at a deeper meaning.", "crossRefs": [{"ref": "John 3:16", "explanation": "Same verb ἀπόλλυμι — 'should not perish.' Nothing is wasted in God's economy."}, {"ref": "John 17:12", "explanation": "Jesus kept his disciples and 'none of them is lost' — same word."}, {"ref": "Deuteronomy 20:19", "explanation": "Bal tashchit principle — the Torah prohibits needless destruction."}], "words": [{"english": "filled", "original": "ἐνεπλήσθησαν", "transliteration": "eneplēsthēsan", "pronunciation": "en-eh-PLAYS-thay-sahn", "strongs": "G1705", "partOfSpeech": "verb, aorist passive indicative, 3rd person plural", "literalMeaning": "they were filled up, they were satisfied", "definition": "From ἐν (en, 'in') + πίμπλημι (pimplēmi, 'to fill'). To fill completely, to satisfy fully. The passive voice means they were filled by an external agent — God through Jesus was the one who satisfied them. This is not 'they ate a little'; this is total satiation. The word echoes Psalm 132:15: 'I will satisfy her poor with bread.'", "translationNote": "Accurate. The word means completely satisfied, not merely 'they ate some.'", "twisted": false, "twistedExplanation": null}, {"english": "fragments", "original": "κλάσματα", "transliteration": "klasmata", "pronunciation": "KLAHS-mah-tah", "strongs": "G2801", "partOfSpeech": "noun, accusative neuter plural", "literalMeaning": "broken pieces, fragments", "definition": "From κλάω (klaō, 'to break'). Broken pieces of bread — the leftovers from the meal. In early Christian usage, κλάσμα became a technical term for the eucharistic bread. The Didache (an early Christian document, c. 70-100 AD) uses this exact word in its eucharistic prayer: 'As this broken bread was scattered over the mountains and gathered together became one, so let your church be gathered.' The fragments are not waste; they are proof of abundance.", "translationNote": "Accurate. The word specifically means broken pieces, not crumbs.", "twisted": false, "twistedExplanation": null}, {"english": "lost", "original": "ἀπόληται", "transliteration": "apolētai", "pronunciation": "ah-POH-lay-tie", "strongs": "G622", "partOfSpeech": "verb, aorist middle subjunctive, 3rd person singular", "literalMeaning": "might perish, might be lost, might be destroyed", "definition": "From ἀπό (apo, 'away from') + ὄλλυμι (ollymi, 'to destroy'). This is the same verb used in John 3:16 ('should not perish'), John 10:28 ('they shall never perish'), and John 17:12 ('none of them is lost'). On the surface, Jesus is talking about bread. But John's readers would hear the deeper resonance: nothing in God's economy is wasted or lost — not bread, not people.", "translationNote": "The theological depth of 'lost/perish' (ἀπόλλυμι) — the same word used for eternal perishing — is impossible to convey in a single English word.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 13, "verseText": "Therefore they gathered them together, and filled twelve baskets with the fragments of the five barley loaves, which remained over and above unto them that had eaten.", "freshTranslation": "So they gathered them up and filled twelve baskets with leftover pieces from the five barley loaves — beyond what the people had eaten.", "historicalContext": "Twelve baskets — one per apostle — is symbolically rich. The κόφινος (kophinos) was a distinctly Jewish wicker basket, typically carried by Jews for keeping food kosher while traveling. Juvenal (Roman satirist) mocked Jews for always carrying their kophinos. The twelve baskets may represent the twelve tribes of Israel, all fed and with surplus remaining.", "crossRefs": [{"ref": "Matthew 14:20", "explanation": "Synoptic parallel confirming twelve baskets."}, {"ref": "Matthew 16:9-10", "explanation": "Jesus later references the twelve baskets as a lesson about faith and divine provision."}, {"ref": "Ruth 2:14", "explanation": "Ruth ate until satisfied and 'had some left over' — OT pattern of God's generous provision."}], "words": [{"english": "twelve", "original": "δώδεκα", "transliteration": "dōdeka", "pronunciation": "DOE-deh-kah", "strongs": "G1427", "partOfSpeech": "adjective (numeral, indeclinable)", "literalMeaning": "twelve", "definition": "The number twelve is deeply symbolic in Jewish thought: twelve tribes of Israel, twelve patriarchs, twelve apostles. That the surplus filled exactly twelve baskets — one per disciple — suggests God's provision is not just sufficient but organized, purposeful, and personally distributed. Each disciple carried away a full basket as a tangible lesson in faith.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "baskets", "original": "κοφίνους", "transliteration": "kophinous", "pronunciation": "KOH-fee-noos", "strongs": "G2894", "partOfSpeech": "noun, accusative masculine plural", "literalMeaning": "wicker baskets (Jewish travel baskets)", "definition": "A κόφινος was a relatively small, rigid wicker basket distinctly associated with Jewish travelers. Roman writers (Juvenal, Satires 3.14) mocked Jews for always carrying their kophinos and a bundle of hay. These baskets allowed Jews to carry their own food and maintain kosher laws while traveling through Gentile territory. Importantly, this is a different word from σπυρίς (spyris), the large hamper-style basket used in the feeding of the 4,000 (Mark 8:8). Jesus later references this distinction (Matthew 16:9-10).", "translationNote": "English 'baskets' obscures the distinction between κόφινος (small Jewish travel basket, feeding of 5,000) and σπυρίς (large hamper, feeding of 4,000).", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 14, "verseText": "Then those men, when they had seen the miracle that Jesus did, said, This is of a truth that prophet that should come into the world.", "freshTranslation": "When the people saw the sign he had performed, they began saying, 'This is truly the Prophet who is coming into the world!'", "historicalContext": "The crowd identifies Jesus as 'the Prophet' — the one Moses predicted in Deuteronomy 18:15: 'The LORD your God will raise up for you a prophet like me.' Since Moses provided manna in the wilderness, a prophet who provides bread from nothing must be 'the Prophet like Moses.' This was a distinct messianic expectation in Second Temple Judaism, separate from (though sometimes merged with) the expectation of the Davidic king.", "crossRefs": [{"ref": "Deuteronomy 18:15", "explanation": "Moses' prophecy of a coming Prophet — the basis of the crowd's identification."}, {"ref": "John 1:21", "explanation": "The delegation asked John the Baptist, 'Are you the Prophet?' — showing this was a well-known expectation."}, {"ref": "Acts 3:22-23", "explanation": "Peter identifies Jesus as the fulfillment of Moses' prophet prophecy."}], "words": [{"english": "the miracle", "original": "σημεῖον", "transliteration": "sēmeion", "pronunciation": "say-MAY-on", "strongs": "G4592", "partOfSpeech": "noun, accusative neuter singular", "literalMeaning": "sign, mark, token", "definition": "See note on verse 2. Here singular — this specific sign. The crowd sees the sign correctly (this points to 'the Prophet') but incompletely — they want a political deliverer, not the bread of life. They read the signpost but head to the wrong destination.", "translationNote": "Again, KJV's 'miracle' misses John's deliberate choice of 'sign' (σημεῖον).", "twisted": true, "twistedExplanation": "See note on verse 2. John never calls Jesus' works 'miracles' — always 'signs.' The crowd's problem is that they saw the miracle without reading the sign."}, {"english": "that prophet", "original": "ὁ προφήτης", "transliteration": "ho prophētēs", "pronunciation": "hoh proh-FAY-tays", "strongs": "G4396", "partOfSpeech": "noun, nominative masculine singular with definite article", "literalMeaning": "the one who speaks before/forth", "definition": "From πρό (pro, 'before/forth') + φημί (phēmi, 'to speak'). A prophet speaks God's word forth to the people, and sometimes speaks before (predicts) future events. The definite article 'the prophet' (ὁ προφήτης) is crucial — this is not just any prophet but the specific Prophet of Deuteronomy 18:15-18 whom Moses promised. In Second Temple Judaism, this figure was awaited as a distinct eschatological deliverer.", "translationNote": "The definite article 'THE Prophet' is critical — this refers to a specific prophesied figure, not a generic 'prophet.'", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 15, "verseText": "When Jesus therefore perceived that they would come and take him by force, to make him a king, he departed again into a mountain himself alone.", "freshTranslation": "Then Jesus, knowing they were about to come and seize him to make him king by force, withdrew again to the mountain by himself alone.", "historicalContext": "This verse reveals the political powder keg of first-century Palestine. A miracle-working leader who could feed an army of 5,000+ men in the wilderness was exactly the military messiah the zealot movement was waiting for. The crowd's impulse was to draft Jesus as a revolutionary king. Jesus' withdrawal is not timidity but a deliberate rejection of political messianism — his kingdom is 'not of this world' (John 18:36).", "crossRefs": [{"ref": "John 18:36", "explanation": "'My kingdom is not of this world' — Jesus consistently refuses political kingship."}, {"ref": "Matthew 4:8-10", "explanation": "Satan offered Jesus all kingdoms of the world. The crowd offers something similar."}, {"ref": "Mark 6:46", "explanation": "Parallel account — Jesus went to the mountain to pray."}], "words": [{"english": "perceived", "original": "γνοὺς", "transliteration": "gnous", "pronunciation": "GNOOS", "strongs": "G1097", "partOfSpeech": "verb, aorist active participle, nominative masculine singular", "literalMeaning": "having known, having perceived", "definition": "From γινώσκω (ginōskō, 'to know by experience, to perceive, to recognize'). Unlike οἶδα (inherent knowledge), γινώσκω implies perceptive knowledge — Jesus read the crowd's intentions. The aorist participle indicates this recognition was immediate and decisive. The English words 'gnosis' and 'agnostic' derive from this root.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "by force", "original": "ἁρπάζειν", "transliteration": "harpazein", "pronunciation": "har-PAH-zayn", "strongs": "G726", "partOfSpeech": "verb, present active infinitive", "literalMeaning": "to seize, to snatch, to take by force", "definition": "A violent word meaning to seize or carry off by force. It's the same word used for the 'rapture' in 1 Thessalonians 4:17 ('caught up') and for the Spirit snatching Philip away in Acts 8:39. Here it describes the crowd's intention to forcibly conscript Jesus into political kingship against his will. This is not a polite invitation — it's an attempted coup, a kidnapping of the Messiah for their agenda.", "translationNote": "KJV's 'take him by force' is accurate and captures the violence of the word.", "twisted": false, "twistedExplanation": null}, {"english": "king", "original": "βασιλέα", "transliteration": "basilea", "pronunciation": "bah-see-LEH-ah", "strongs": "G935", "partOfSpeech": "noun, accusative masculine singular", "literalMeaning": "king, ruler, sovereign", "definition": "From βαίνω (bainō, 'to go, to walk') — one who leads the way, or from an older root meaning 'foundation.' The βασιλεύς was the supreme ruler. In the Roman Empire, claiming kingship was treason (crimen laesae maiestatis) — only Caesar was king. The crowd's desire to make Jesus king was politically explosive and potentially fatal. Jesus will acknowledge his kingship only before Pilate, on his own terms (John 18:37).", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "alone", "original": "μόνος", "transliteration": "monos", "pronunciation": "MOH-nohs", "strongs": "G3441", "partOfSpeech": "adjective, nominative masculine singular", "literalMeaning": "alone, solitary, only", "definition": "From a root meaning 'single, unique.' Jesus withdraws into complete solitude — not even the twelve come with him. Mark tells us he went to pray (Mark 6:46). The English 'monk,' 'monologue,' and 'monotheism' all derive from this root. Jesus' solitude contrasts sharply with the crowd's mob energy — he refuses to be swept along by popular fervor.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 16, "verseText": "And when even was now come, his disciples went down unto the sea,", "freshTranslation": "When evening came, his disciples went down to the lake,", "historicalContext": "The transition to evening shifts the scene from the miraculous feeding to the equally significant walking on water. The disciples descend from the hillside to the shore without Jesus, setting up a night crossing that becomes a test of faith.", "crossRefs": [{"ref": "Matthew 14:22-23", "explanation": "Parallel — Jesus 'made' the disciples get into the boat, suggesting urgency to separate them from the crowd's kingship fervor."}], "words": [{"english": "even", "original": "ὀψία", "transliteration": "opsia", "pronunciation": "op-SEE-ah", "strongs": "G3798", "partOfSpeech": "noun/adjective, nominative feminine singular", "literalMeaning": "evening, late hour", "definition": "From ὀψέ (opse, 'late, in the evening'). In Jewish reckoning, there were two 'evenings' — early evening (3-6 PM) and late evening (after sunset). This is likely the late evening, after sunset, since the disciples soon find themselves in darkness on the lake. The shift from daylight provision to nighttime testing mirrors Israel's experience in the wilderness.", "translationNote": "KJV's 'even' is archaic for 'evening.'", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 17, "verseText": "And entered into a ship, and went over the sea toward Capernaum. And it was now dark, and Jesus was not come to them.", "freshTranslation": "They got into a boat and started across the sea toward Capernaum. It had already become dark, and Jesus had not yet come to them.", "historicalContext": "Capernaum was Jesus' adopted hometown on the northwest shore. The detail that 'it was now dark' is both literal (night crossing) and symbolic in John's dualistic theology — darkness represents the absence of Jesus, the Light of the World (John 8:12). Without Jesus present, the disciples are literally and figuratively in the dark.", "crossRefs": [{"ref": "John 8:12", "explanation": "'I am the light of the world' — the darkness here symbolizes separation from Jesus."}, {"ref": "John 13:30", "explanation": "When Judas left to betray Jesus, 'it was night' — John uses darkness symbolically."}], "words": [{"english": "ship", "original": "πλοῖον", "transliteration": "ploion", "pronunciation": "PLOY-on", "strongs": "G4143", "partOfSpeech": "noun, accusative neuter singular", "literalMeaning": "boat, vessel", "definition": "From πλέω (pleō, 'to sail'). A general term for a boat or ship. Galilean fishing boats from this era have been excavated — the famous 'Jesus Boat' discovered in 1986 near Kibbutz Ginosar was about 27 feet long and 7.5 feet wide, designed for a crew of about five plus cargo or passengers. It could hold roughly thirteen people — about right for Jesus and the Twelve.", "translationNote": "KJV's 'ship' is misleading — this was a small fishing boat, not a ship. Modern translations correctly use 'boat.'", "twisted": false, "twistedExplanation": null}, {"english": "dark", "original": "σκοτία", "transliteration": "skotia", "pronunciation": "skoh-TEE-ah", "strongs": "G4653", "partOfSpeech": "noun, nominative feminine singular", "literalMeaning": "darkness, gloom", "definition": "From σκότος (skotos, 'darkness'). In John's Gospel, darkness is never merely physical — it carries profound theological weight. John 1:5 declares 'the light shines in the darkness.' John 3:19 says 'people loved darkness rather than light.' Here the physical darkness on the sea represents the disciples' separation from Jesus. The word is related to 'scotoma' (a blind spot in vision).", "translationNote": "Accurate, but the symbolic dimension — darkness = absence of Christ the Light — is invisible in translation.", "twisted": false, "twistedExplanation": null}, {"english": "Capernaum", "original": "Καφαρναούμ", "transliteration": "Kapharnaoum", "pronunciation": "kah-far-nah-OOM", "strongs": "G2584", "partOfSpeech": "proper noun (indeclinable)", "literalMeaning": "village of Nahum (comfort)", "definition": "From Hebrew Kfar Nahum (כְּפַר נַחוּם), meaning 'village of Nahum' or 'village of comfort.' Located on the northwest shore of the Sea of Galilee, it served as Jesus' operational base during his Galilean ministry (Matthew 4:13 calls it 'his own city'). Archaeological excavations have uncovered the synagogue where Jesus taught and what tradition identifies as Peter's house. It was a prosperous fishing and trade town on the Via Maris trade route.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 18, "verseText": "And the sea arose by reason of a great wind that blew.", "freshTranslation": "The sea became rough because a strong wind was blowing.", "historicalContext": "The Sea of Galilee is notorious for sudden, violent storms. It sits 700 feet below sea level in a basin surrounded by hills. Cool air from the Mediterranean or from the Golan Heights can funnel down through valleys and collide with the warm air over the lake, producing sudden squalls. Experienced fishermen like Peter, Andrew, James, and John would have known this — yet the storm still threatened them.", "crossRefs": [{"ref": "Psalm 107:25-29", "explanation": "God commands storms and calms them — a sovereign act echoed in Jesus walking on water."}, {"ref": "Jonah 1:4", "explanation": "God sent a great wind on the sea — storms at sea as divine encounters."}], "words": [{"english": "arose", "original": "διεγείρετο", "transliteration": "diegeireto", "pronunciation": "dee-eh-GUY-reh-toh", "strongs": "G1326", "partOfSpeech": "verb, imperfect passive indicative, 3rd person singular", "literalMeaning": "was being aroused, was being stirred up", "definition": "From διά (dia, 'through, thoroughly') + ἐγείρω (egeirō, 'to raise up, to awaken'). The imperfect passive indicates the sea was continuously being stirred up — the storm was intensifying, not a sudden event. The same root verb (ἐγείρω) is used for resurrection, creating an interesting resonance: the sea that death cannot contain is being 'raised up' in turmoil.", "translationNote": "Accurate. The imperfect tense shows an escalating storm, not just a sudden wave.", "twisted": false, "twistedExplanation": null}, {"english": "a great wind", "original": "ἀνέμου μεγάλου", "transliteration": "anemou megalou", "pronunciation": "ah-NEH-moo meh-GAH-loo", "strongs": "G417/G3173", "partOfSpeech": "noun + adjective, genitive masculine singular", "literalMeaning": "a great wind", "definition": "ἄνεμος (anemos) is wind in motion, from ἄημι (aēmi, 'to blow'). The English 'anemometer' (wind gauge) derives from it. μέγας (megas, 'great, large') indicates exceptional force — this was not a breeze but a gale. In ancient cosmology, winds were seen as semi-divine forces; for Jesus to walk through such a wind demonstrates authority over the chaotic elements.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 19, "verseText": "So when they had rowed about five and twenty or thirty furlongs, they see Jesus walking on the sea, and drawing nigh unto the ship: and they were afraid.", "freshTranslation": "When they had rowed about three or four miles, they saw Jesus walking on the sea and approaching the boat — and they were terrified.", "historicalContext": "25-30 stadia (3-4 miles) puts them roughly in the middle of the lake. They've been rowing against the wind for hours (Mark says it was the 'fourth watch,' 3-6 AM). In the Hebrew Bible, only God walks on water (Job 9:8, 'He alone stretches out the heavens and treads on the waves of the sea'). The disciples' fear is not merely surprise — it's the terror of a theophany, a divine manifestation.", "crossRefs": [{"ref": "Job 9:8", "explanation": "God 'treads on the waves of the sea' — Jesus does what only God does."}, {"ref": "Psalm 77:19", "explanation": "'Your path was through the sea, your way through the mighty waters, yet your footprints were unseen.'"}, {"ref": "Isaiah 43:16", "explanation": "The LORD 'makes a way in the sea' — divine sovereignty over water."}], "words": [{"english": "rowed", "original": "ἐληλακότες", "transliteration": "elelakotes", "pronunciation": "eh-lay-lah-KOH-tes", "strongs": "G1643", "partOfSpeech": "verb, perfect active participle, nominative masculine plural", "literalMeaning": "having driven/rowed", "definition": "From ἐλαύνω (elaunō, 'to drive, to row, to push forward'). The perfect tense indicates completed action with ongoing results — they had been rowing and were still out on the water. The word implies hard physical labor against resistance. These experienced fishermen were exhausting themselves against the storm.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "furlongs", "original": "σταδίους", "transliteration": "stadious", "pronunciation": "stah-DEE-oos", "strongs": "G4712", "partOfSpeech": "noun, accusative masculine plural", "literalMeaning": "stadia (unit of distance)", "definition": "A stadion was approximately 607 feet (185 meters), the length of the original stadium at Olympia. Twenty-five to thirty stadia equals roughly 3-3.5 miles (4.8-5.6 km). The Sea of Galilee is about 7 miles wide at its broadest point, so 3-4 miles puts the boat roughly in the middle — the most exposed and vulnerable position. The English 'stadium' derives directly from this word.", "translationNote": "KJV's 'furlongs' is a different measurement than the Greek stadia. Modern translations correctly give the approximate distance in miles or kilometers.", "twisted": false, "twistedExplanation": null}, {"english": "walking", "original": "περιπατοῦντα", "transliteration": "peripatounta", "pronunciation": "peh-ree-pah-TOON-tah", "strongs": "G4043", "partOfSpeech": "verb, present active participle, accusative masculine singular", "literalMeaning": "walking about, walking around", "definition": "From περί (peri, 'around') + πατέω (pateō, 'to walk, to tread'). The present participle shows ongoing action — Jesus was in the continuous act of walking on the water, not momentarily standing on it. In Jewish Scripture, treading on the sea is exclusively a divine attribute (Job 9:8). The word also carries philosophical overtones — Aristotle's school was called the 'Peripatetic' school because he taught while walking.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "afraid", "original": "ἐφοβήθησαν", "transliteration": "ephobēthēsan", "pronunciation": "eh-foh-BAY-thay-sahn", "strongs": "G5399", "partOfSpeech": "verb, aorist passive indicative, 3rd person plural", "literalMeaning": "they were frightened, they feared", "definition": "From φόβος (phobos, 'fear, terror, reverence'). The passive voice ('were frightened') suggests fear seized them from outside — it was the natural human response to the numinous, to encountering the divine. This is the same 'fear and trembling' that grips people throughout Scripture when they encounter God's presence (Isaiah 6:5, Luke 5:8). The English 'phobia' derives from this root.", "translationNote": "KJV's 'afraid' is mild. The Greek indicates something closer to terror — the primal fear of a divine encounter.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 20, "verseText": "But he saith unto them, It is I; be not afraid.", "freshTranslation": "But he said to them, 'I AM — don't be afraid.'", "historicalContext": "The Greek ἐγώ εἰμι ('I am') is identical to the divine name God reveals to Moses in Exodus 3:14 (LXX). While on the surface Jesus may simply be identifying himself ('It's me'), the context — walking on water (a divine act) in darkness during a storm — strongly suggests this is a theophanic self-revelation. 'Do not fear' is the standard divine reassurance given during theophanies throughout the OT (Genesis 15:1, Isaiah 41:10, 43:1).", "crossRefs": [{"ref": "Exodus 3:14", "explanation": "God says 'I AM WHO I AM' (ἐγώ εἰμι ὁ ὤν in the LXX) — the divine name Jesus invokes."}, {"ref": "Isaiah 43:1-2", "explanation": "'Fear not, for I have redeemed you... when you pass through the waters, I will be with you.'"}, {"ref": "John 8:58", "explanation": "'Before Abraham was, I AM' — Jesus' most explicit use of ἐγώ εἰμι as a divine claim."}], "words": [{"english": "It is I", "original": "Ἐγώ εἰμι", "transliteration": "Egō eimi", "pronunciation": "eh-GOH ay-MEE", "strongs": "G1473/G1510", "partOfSpeech": "personal pronoun (nominative) + verb (present indicative, 1st person singular)", "literalMeaning": "I am, I exist", "definition": "Ἐγώ (egō) is the emphatic first-person pronoun ('I myself'). εἰμί (eimi) is the verb 'to be.' Together they form the phrase ἐγώ εἰμι — 'I AM.' This is the most theologically charged phrase in John's Gospel. It echoes God's self-revelation to Moses at the burning bush (Exodus 3:14, rendered ἐγώ εἰμι ὁ ὤν in the LXX). John records seven formal 'I AM' statements with predicates (bread of life, light of the world, etc.) and several absolute uses (here, 8:24, 8:28, 8:58, 13:19, 18:5-6). The phrase operates on two levels: ordinary self-identification ('It's me') and divine self-revelation ('I AM').", "translationNote": "KJV's 'It is I' grammatically domesticates what may be a divine name declaration. The Greek ἐγώ εἰμι is identical to the LXX divine name. Most translations obscure this by rendering it as simple self-identification.", "twisted": true, "twistedExplanation": "Translating ἐγώ εἰμι as merely 'It is I' hides what is arguably a theophanic declaration of divine identity. Jesus is walking on water — something only God does (Job 9:8) — and then speaks the divine name. The translational ambiguity may be intentional in the Greek, but English 'It is I' loses the divine resonance entirely."}, {"english": "be not afraid", "original": "μὴ φοβεῖσθε", "transliteration": "mē phobeisthe", "pronunciation": "may foh-BAY-stheh", "strongs": "G3361/G5399", "partOfSpeech": "negative particle + verb, present middle/passive imperative, 2nd person plural", "literalMeaning": "stop being afraid, do not continue to fear", "definition": "μή (mē) is the negative particle used with non-indicative moods (commands, wishes, conditions). φοβεῖσθε is from φοβέω (phobeō, 'to fear'). The present imperative with μή means 'stop doing what you're already doing' — they are already afraid, and Jesus commands them to stop. 'Fear not' is the most repeated command in Scripture, appearing over 100 times. It is the standard divine greeting in theophanies — when God shows up, the first thing he says is 'don't be afraid.'", "translationNote": "Accurate, though the present imperative nuance ('stop being afraid' rather than 'don't start being afraid') is lost.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 21, "verseText": "Then they willingly received him into the ship: and immediately the ship was at the land whither they went.", "freshTranslation": "Then they were glad to take him into the boat, and immediately the boat reached the shore where they were heading.", "historicalContext": "The 'immediately' reaching shore suggests a second miracle — either instant transport or a compressed sense of time. John's account differs from the Synoptics: he omits the wind ceasing (Mark 6:51) but adds this mysterious instant arrival. This may echo Psalm 107:30: 'He brought them to their desired haven.'", "crossRefs": [{"ref": "Psalm 107:28-30", "explanation": "'Then they cried to the LORD... He made the storm be still... then they were glad... and he brought them to their desired haven.'"}, {"ref": "Mark 6:51", "explanation": "Mark records the wind ceasing when Jesus entered the boat."}], "words": [{"english": "willingly", "original": "ἤθελον", "transliteration": "ēthelon", "pronunciation": "AY-theh-lon", "strongs": "G2309", "partOfSpeech": "verb, imperfect active indicative, 3rd person plural", "literalMeaning": "they were willing, they wanted", "definition": "From θέλω (thelō, 'to will, to desire, to wish'). The imperfect indicates their willingness was immediate and eager when they recognized Jesus. Their fear transformed into desire. This verb expresses volitional consent — they wanted to receive him, in contrast to the crowd that wanted to seize him (v.15).", "translationNote": "KJV's 'willingly received' captures the eagerness well.", "twisted": false, "twistedExplanation": null}, {"english": "immediately", "original": "εὐθέως", "transliteration": "eutheōs", "pronunciation": "yoo-THEH-ohs", "strongs": "G2112", "partOfSpeech": "adverb", "literalMeaning": "at once, immediately, straightaway", "definition": "From εὐθύς (euthys, 'straight, direct'). An adverb of instantaneous action — no delay, no transition. The boat was 3-4 miles from shore; suddenly it was at the destination. This suggests either a third miracle (supernatural transport) or John's theological compression of time. Either way, the message is clear: with Jesus aboard, you arrive where you're meant to be.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 22, "verseText": "The day following, when the people which stood on the other side of the sea saw that there was none other boat there, save that one whereinto his disciples were entered, and that Jesus went not with his disciples into the boat, but that his disciples were gone away alone;", "freshTranslation": "The next day, the crowd that had stayed on the other side of the sea noticed that only one boat had been there, and that Jesus had not gotten into it with his disciples — his disciples had gone off alone.", "historicalContext": "John provides a detailed account of the crowd's detective work, trying to figure out how Jesus got to Capernaum. They knew there was only one boat, they knew Jesus didn't get in it, yet he's now on the other side. This careful reasoning builds the mystery that will prompt the crowd's question in verse 25.", "crossRefs": [{"ref": "John 6:25", "explanation": "The crowd's question, 'Rabbi, when did you get here?' — the answer to which is the walking-on-water miracle they didn't witness."}], "words": [{"english": "the people", "original": "ὁ ὄχλος", "transliteration": "ho ochlos", "pronunciation": "hoh OKH-lohs", "strongs": "G3793", "partOfSpeech": "noun, nominative masculine singular with definite article", "literalMeaning": "the crowd", "definition": "See note on verse 2. Now 'the crowd' specifically refers to those who stayed behind on the eastern shore after the feeding miracle. These are the same people who tried to make Jesus king by force (v.15). They are persistent in their pursuit, but as Jesus will reveal, their motives are shallow.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 23, "verseText": "(Howbeit there came other boats from Tiberias nigh unto the place where they did eat bread, after that the Lord had given thanks:)", "freshTranslation": "(However, boats from Tiberias came near the place where they had eaten the bread after the Lord had given thanks.)", "historicalContext": "This parenthetical note explains how the crowd eventually crossed the lake. Boats from the city of Tiberias (on the western shore) had come to the area, providing transportation. John's mention that this was 'where they had eaten bread after the Lord had given thanks' uses eucharistic language, reinforcing the sacramental connection.", "crossRefs": [{"ref": "John 6:11", "explanation": "The giving of thanks (εὐχαριστέω) — the same eucharistic language repeated here."}], "words": [{"english": "the Lord", "original": "ὁ κύριος", "transliteration": "ho kyrios", "pronunciation": "hoh KOO-ree-ohs", "strongs": "G2962", "partOfSpeech": "noun, nominative masculine singular with definite article", "literalMeaning": "the lord, the master, the one with authority", "definition": "From κῦρος (kyros, 'authority, power'). In everyday Greek, κύριος meant 'sir' or 'master.' But in the LXX, κύριος translates the divine name YHWH over 6,000 times. Early Christians used κύριος as their central confession: 'Jesus is Lord' (Romans 10:9, 1 Corinthians 12:3). This is one of the few places in John's narrative (as opposed to dialogue) where the narrator calls Jesus 'the Lord' — a post-resurrection perspective coloring the retelling.", "translationNote": "Accurate, though the weight of 'Lord' as a divine title (= YHWH) is easily lost in English where 'lord' can be merely polite.", "twisted": false, "twistedExplanation": null}, {"english": "given thanks", "original": "εὐχαριστήσαντος", "transliteration": "eucharistēsantos", "pronunciation": "yoo-khah-ris-TAY-sahn-tohs", "strongs": "G2168", "partOfSpeech": "verb, aorist active participle, genitive masculine singular", "literalMeaning": "having given thanks", "definition": "See note on verse 11. The repetition of this eucharistic term anchors the feeding miracle in the language of Christian worship. By the time John wrote (85-95 AD), the 'giving of thanks' (εὐχαριστία) was already the established term for the Lord's Supper.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 24, "verseText": "When the people therefore saw that Jesus was not there, neither his disciples, they also took shipping, and came to Capernaum, seeking for Jesus.", "freshTranslation": "So when the crowd realized that neither Jesus nor his disciples were there, they got into the boats and went to Capernaum looking for Jesus.", "historicalContext": "The crowd pursues Jesus across the lake. Their persistence seems admirable but, as Jesus will shortly reveal (v.26), they're seeking him for the wrong reasons — they want more bread, not the Bread of Life. This pursuit sets up the Bread of Life discourse.", "crossRefs": [{"ref": "John 6:26", "explanation": "Jesus' diagnosis: 'You seek me not because you saw signs, but because you ate the loaves and were filled.'"}], "words": [{"english": "seeking", "original": "ζητοῦντες", "transliteration": "zētountes", "pronunciation": "zay-TOON-tes", "strongs": "G2212", "partOfSpeech": "verb, present active participle, nominative masculine plural", "literalMeaning": "seeking, searching for, looking for", "definition": "From ζητέω (zēteō, 'to seek, to search, to desire'). The present participle indicates ongoing, active searching. In John's Gospel, 'seeking' is a loaded concept — some seek Jesus genuinely (John 1:38), while others seek to kill him (John 5:18, 7:1). The crowd here seeks Jesus, but for material rather than spiritual reasons. True seeking requires looking beyond the bread to the Bread-giver.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 25, "verseText": "And when they had found him on the other side of the sea, they said unto him, Rabbi, when camest thou hither?", "freshTranslation": "When they found him on the other side of the lake, they asked, 'Rabbi, when did you get here?'", "historicalContext": "The crowd's question reveals their confusion — they know Jesus didn't take the only boat. The question 'when did you come here?' is really 'how did you get here?' Jesus never answers this question directly. Instead of explaining the water-walking miracle, he redirects to their deeper need.", "crossRefs": [{"ref": "John 3:4", "explanation": "Nicodemus' 'how' question was also redirected by Jesus to a deeper truth."}, {"ref": "John 4:9", "explanation": "The Samaritan woman's surface question was similarly redirected."}], "words": [{"english": "Rabbi", "original": "Ῥαββί", "transliteration": "Rhabbi", "pronunciation": "hrah-BEE", "strongs": "G4461", "partOfSpeech": "noun (title), vocative (indeclinable)", "literalMeaning": "my great one, my master/teacher", "definition": "From Hebrew rav (רַב, 'great, master') + the first person possessive suffix -i ('my'). Literally 'my great one.' By Jesus' time, it was the standard respectful title for a Torah teacher. The title was not yet formalized as it would be after 70 AD; it was more like 'Master' or 'Teacher' than a formal ordination title. John translates it as 'Teacher' (διδάσκαλος) in John 1:38.", "translationNote": "Accurate. The title expresses respect but falls short — they call him Rabbi (teacher) when he has just demonstrated he is Lord (God).", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 26, "verseText": "Jesus answered them and said, Verily, verily, I say unto you, Ye seek me, not because ye saw the miracles, but because ye did eat of the loaves, and were filled.", "freshTranslation": "Jesus answered them, 'Truly, truly, I tell you — you're looking for me not because you saw signs, but because you ate the loaves and had your fill.'", "historicalContext": "The double 'Amen, amen' (truly, truly) is unique to John's Gospel and signals a solemn, authoritative declaration. Jesus diagnoses the crowd's motives with surgical precision: they followed him for free food, not because the sign pointed them to God. This begins the Bread of Life discourse — Jesus will progressively redirect them from physical bread to spiritual bread, from Moses' manna to himself.", "crossRefs": [{"ref": "Isaiah 55:2", "explanation": "'Why do you spend your money for that which is not bread... listen to me, and eat what is good.'"}, {"ref": "John 2:24-25", "explanation": "Jesus knew what was in people — he sees through the crowd's motives."}, {"ref": "John 4:32", "explanation": "'I have food to eat that you know nothing about' — Jesus' consistent redirection from physical to spiritual."}], "words": [{"english": "Verily, verily", "original": "Ἀμὴν ἀμήν", "transliteration": "Amēn amēn", "pronunciation": "ah-MAIN ah-MAIN", "strongs": "G281", "partOfSpeech": "Hebrew particle (transliterated, indeclinable), doubled", "literalMeaning": "truly truly, certainly certainly, it is established", "definition": "From Hebrew אָמֵן (amen), derived from the root אמן (ʾ-m-n, 'to be firm, trustworthy, established'). In Jewish practice, 'amen' was spoken after someone else's prayer or statement to affirm it. Jesus uniquely uses it before his own statements — and in John, always doubled — to claim personal authority for what follows. No rabbi before Jesus used 'amen' this way. The double form (found only in John, 25 times) intensifies the solemnity. It functions as a divine oath formula.", "translationNote": "KJV's 'verily, verily' is recognizable but loses the Hebrew origin. 'Truly, truly' or 'Amen, amen' are more transparent.", "twisted": false, "twistedExplanation": null}, {"english": "the miracles", "original": "σημεῖα", "transliteration": "sēmeia", "pronunciation": "say-MAY-ah", "strongs": "G4592", "partOfSpeech": "noun, accusative neuter plural", "literalMeaning": "signs", "definition": "See notes on verses 2 and 14. Here Jesus explicitly contrasts seeing the 'signs' (σημεῖα) — understanding what they point to — with merely eating the loaves. The crowd experienced the miracle but missed the sign. They ate the bread but didn't see the Bread-giver.", "translationNote": "KJV again translates σημεῖα as 'miracles' when Jesus specifically says 'signs.' The irony is sharpened in Greek: 'You don't seek me because you saw SIGNS but because you ate bread.' They saw the event but missed its meaning.", "twisted": true, "twistedExplanation": "This is perhaps the most important instance: Jesus is explicitly contrasting sign-seeing with bread-eating. Translating σημεῖα as 'miracles' collapses the very distinction Jesus is making."}, {"english": "filled", "original": "ἐχορτάσθητε", "transliteration": "echortasthēte", "pronunciation": "eh-khor-TAHS-thay-teh", "strongs": "G5526", "partOfSpeech": "verb, aorist passive indicative, 2nd person plural", "literalMeaning": "you were fed to the full, you were gorged", "definition": "From χόρτος (chortos, 'grass, fodder' — see v.10). Originally used for animals being fed to satisfaction ('fattened'). Its application to humans carries a slightly coarse edge — you were 'stuffed,' 'gorged.' Jesus' word choice is deliberately unflattering: they followed him like cattle follow the farmer who fills their trough. The same word is used in the Beatitudes: 'Blessed are those who hunger and thirst for righteousness, for they shall be filled (χορτασθήσονται).'", "translationNote": "The animal-feeding connotation of χορτάζω is invisible in the dignified English 'filled.' Jesus is being deliberately pointed — you followed me like animals follow food.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 27, "verseText": "Labour not for the meat which perisheth, but for that meat which endureth unto everlasting life, which the Son of man shall give unto you: for him hath God the Father sealed.", "freshTranslation": "Don't work for food that spoils, but for food that endures to eternal life — the food the Son of Man will give you. For God the Father has set his seal of approval on him.", "historicalContext": "Jesus begins his redirection from physical to spiritual bread. 'The Son of Man' is Jesus' preferred self-designation, drawn from Daniel 7:13-14, where 'one like a son of man' receives eternal dominion from the Ancient of Days. The 'sealing' by the Father may refer to the Holy Spirit's descent at Jesus' baptism (John 1:32-33) — God's visible certification of Jesus' identity and mission.", "crossRefs": [{"ref": "Daniel 7:13-14", "explanation": "The Son of Man receives everlasting dominion — the background for Jesus' title."}, {"ref": "Isaiah 55:1-2", "explanation": "'Come, buy... without money... Why spend money on what is not bread?'"}, {"ref": "John 1:32-33", "explanation": "The Spirit descending on Jesus at baptism — the moment of 'sealing.'"}], "words": [{"english": "Labour", "original": "ἐργάζεσθε", "transliteration": "ergazesthe", "pronunciation": "ehr-GAH-zeh-stheh", "strongs": "G2038", "partOfSpeech": "verb, present middle/passive imperative, 2nd person plural", "literalMeaning": "work, labor, toil", "definition": "From ἔργον (ergon, 'work, deed'). To work, labor, or engage in productive activity. The present imperative commands ongoing action: 'keep working.' The English words 'energy' and 'ergonomic' derive from this root. Importantly, Jesus does not say 'don't work' but 'don't work for the wrong thing.' The issue is not effort but its object.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "meat", "original": "βρῶσιν", "transliteration": "brōsin", "pronunciation": "BRO-sin", "strongs": "G1035", "partOfSpeech": "noun, accusative feminine singular", "literalMeaning": "food, eating, the act of eating", "definition": "From βιβρώσκω (bibrōskō, 'to eat'). Refers to food in general, not specifically meat. In older English, 'meat' meant 'food' broadly (cf. 'sweetmeat'), which is why the KJV uses it here. The word can also mean the act of eating itself. Jesus contrasts perishable food with imperishable — the stuff that rusts and rots versus what nourishes eternally.", "translationNote": "KJV's 'meat' is misleading to modern readers who hear 'animal flesh.' The Greek means 'food' in general.", "twisted": true, "twistedExplanation": "Modern English 'meat' exclusively means animal flesh. The KJV translators used it when 'meat' still meant 'food' broadly. This creates needless confusion for modern readers."}, {"english": "perisheth", "original": "ἀπολλυμένην", "transliteration": "apollymenēn", "pronunciation": "ah-pol-LOO-meh-nayn", "strongs": "G622", "partOfSpeech": "verb, present middle participle, accusative feminine singular", "literalMeaning": "perishing, being destroyed", "definition": "From ἀπόλλυμι (apollymi, 'to destroy, to perish'). See note on verse 12. The present participle indicates food that is in the ongoing process of perishing — it's already decaying the moment you receive it. This is the same verb used for eternal perishing (John 3:16). Physical food perishes; the food Jesus offers endures forever.", "translationNote": "Accurate.", "twisted": false, "twistedExplanation": null}, {"english": "everlasting", "original": "αἰώνιον", "transliteration": "aiōnion", "pronunciation": "ah-ee-OH-nee-on", "strongs": "G166", "partOfSpeech": "adjective, accusative feminine singular", "literalMeaning": "of the age, pertaining to the ages, eternal", "definition": "From αἰών (aiōn, 'age, era, epoch'). The adjective means 'belonging to the age to come' or 'lasting through all ages.' In Jewish eschatology, there were two ages: 'this present age' (olam hazeh) and 'the age to come' (olam haba). αἰώνιος describes the quality of life in the age to come — not merely endless duration but a different quality of existence. The English 'aeon/eon' derives from αἰών.", "translationNote": "'Everlasting' emphasizes duration; the Greek also implies a qualitative difference — the life of the coming age, God's own kind of life.", "twisted": false, "twistedExplanation": null}, {"english": "the Son of man", "original": "ὁ υἱὸς τοῦ ἀνθρώπου", "transliteration": "ho huios tou anthrōpou", "pronunciation": "hoh hwee-OHS too ahn-THROW-poo", "strongs": "G5207/G444", "partOfSpeech": "noun phrase, nominative masculine singular", "literalMeaning": "the son of the man / the human one", "definition": "Jesus' most frequent self-designation, used over 80 times in the Gospels. It draws primarily from Daniel 7:13-14, where 'one like a son of man' approaches the Ancient of Days and receives universal, eternal dominion. The phrase is paradoxically humble (emphasizing humanity) and exalted (claiming Daniel's heavenly figure). In Aramaic (bar enash), it could simply mean 'a human being,' providing Jesus with strategic ambiguity — an ordinary phrase carrying extraordinary claims.", "translationNote": "Accurate, but the Daniel 7 background — where this figure receives cosmic authority — is invisible to most English readers.", "twisted": false, "twistedExplanation": null}, {"english": "sealed", "original": "ἐσφράγισεν", "transliteration": "esphragisen", "pronunciation": "ehs-FRAH-gee-sen", "strongs": "G4972", "partOfSpeech": "verb, aorist active indicative, 3rd person singular", "literalMeaning": "sealed, stamped, certified", "definition": "From σφραγίς (sphragis, 'a seal, signet ring'). In the ancient world, a seal served three functions: (1) authentication — confirming something is genuine, (2) ownership — marking something as belonging to someone, (3) protection — securing something from tampering. God 'sealed' Jesus, meaning God authenticated Jesus as genuine, claimed him as his own, and authorized his mission. The aorist points to a specific moment — likely the baptism, when the Spirit descended and the Father's voice declared, 'This is my beloved Son.'", "translationNote": "Accurate. The rich cultural meaning of 'sealing' (authentication + ownership + authorization) is largely lost to modern readers unfamiliar with ancient seal practices.", "twisted": false, "twistedExplanation": null}]}, {"verseNumber": 28, "verseText": "Then said they unto him, What shall we do, that we might work the works of God?", "freshTranslation": "So they asked him, 'What must we do to perform the works God requires?'", "historicalContext": "The crowd takes Jesus' command to 'work for eternal food' in a predictably legalistic direction — they want a to-do list. This response reflects the common Jewish expectation that eternal life is earned through meritorious works. Jesus' answer will radically redefine 'the work of God.'", "crossRefs": [{"ref": "Acts 16:30", "explanation": "The Philippian jailer asks the same essential question: 'What must I do to be saved?'"}, {"ref": "Micah 6:6-8", "explanation": "'What does the LORD require of you?' — the OT version of this question."}], "words": [{"english": "the works", "original": "τὰ ἔργα", "transliteration": "ta erga", "pronunciation": "tah EHR-gah", "strongs": "G2041", "partOfSpeech": "noun, accusative neuter plural with definite article", "literalMeaning": "the works, the deeds", "definition": "From ἔργον (ergon, 'work, deed, action'). The plural 'works' reveals the crowd's mindset — they expect multiple required actions, a checklist of religious duties. This is the works-based approach to righteousness. Jesus will reduce the plural 'works' to a singular 'work' in the next verse — believe.", "translationNote": "The shift from plural 'works' (crowd) to singular 'work' (Jesus, v.29) is a crucial rhetorical move that English preserves well.", "twisted": false, "twistedExplanation": null}]}]}